[
  {
    "content": "Field Marketing Operations Coordinator - Admin (Phuket Based)Wyndham Vacation Resorts (Thailand) LimitedJob Highlights\nAdministrator, Coordinator, Tour Booking, Teamwork\nProcessing, Marketing, Stock order, Email, Service\nInformation, Communication,Data integrity,FlexiblePRINCIPAL RESPONSIBILITIES:  (Include but not limited to)\n\nProcess tour bookings in Club Wyndham Asia’s system\nAssist with reporting for the Field Marketing department\nAssist with the Dispatch/Logistics function of Field Marketing\nAssist with the processing and approval of Field Marketing  payroll\nAssist with processing of invoices\nAssist with organizing and sourcing Field Marketing collateral and premiums\nGain relevant approvals for and complete stock orders for all Field Marketing regions\nProvide Adhoc information requests\nEnsure data integrity of systems and maintain accurate records to ensure departmental compliance with business and government standards and regulations.\nDisplay Count on Me! Service to all internal and external parties\nShow integrity in all aspects of the position by doing the right thing, taking responsibility and delivering on the Wyndham promise.\nDisplay leadership values by ensuring effective communication and respecting your peers and managers. Support others within the team and empower each other wherever possible.\nAdhere to all company policies and procedures\nAny other duties within your skill levels as requested by the Company from time to time\n\n KEY POSITION CRITERIA:\n\nCommitted to providing excellent customer service at all times.\nBe detailed, accurate and thorough.\nPossess a positive, can do attitude with the ability to self motivate.\nIntermediate to advanced MS Office skills, particularly Microsoft Excel and Access\nAbility to work in a fast paced environment\nGood written and verbal communication skills with the ability to effectively respond to questions from managers, co-workers and clients.\nAbility to meet time frames and performance standards\nAbility to manage multiple tasks and be able to think laterally when problem solving\nGood time management skills\nFlexibility in working schedule- ability to work weekends, public holidays and evenings as requiredundefined"
  },
  {
    "content": "Oversea Purchasing / Import - Export/เจ้าหน้าที่ต่างประเทศXenon Inter Co., Ltd.Job Highlights\nมีความก้าวหน้าในการทำงาน\nโอกาสในการเติบโตสูง\nมีการทำงานที่หลากหลายหน้าที่ความรับผิดชอบ\n\nจัดหา และสั่งซื้อสินค้า จาก supplier ต่างประเทศ \nติดตามการดำเนินการนำเข้า ระยะเวลาการผลิต และเงื่อนไขการขนส่งจนสินค้าถึงโกดัง\nตรวจสอบเอกสารการนำเข้า/ส่งออก สินค้า ได้แก่ Invoice, Packing list, AWB, B/L และขอใบอนุญาตนำเข้าต่างๆ\nดูแลเอกสารการชำระสินค้า ผ่านธนาคาร (นำเข้า / ส่งออก) ในเงื่อนไข L/C, B/C, T/T\nประสานงานกับหน่วยงานที่เกี่ยวข้อง ในการส่งกลับคืน / เคลมหากสินค้าไม่ได้มาตรฐาน\nติดต่อ และยื่นเอกสารกับหน่วยงานราชการ เพื่อนำเข้า และส่งออกสินค้า\n\nคุณสมบัติ\n\nระดับการศึกษา : ปริญญาตรี ขึ้นไป\nประสบการณ์(ปี) : 1ปีขึ้นไป\n\nคุณสมบัติเพิ่มเติม\n\nประสบการณ์ ในตำแหน่ง Import / Export 1 ปีขึ้นไป\nมีความรู้ด้านภาษาอังกฤษ\nมีบุคลิกภาพดี คล่องแคล่ว ว่องไว ไหวพริบดี พูดจาฉะฉาน มีความมั่นใจ กระตือรือร้น\nมีความรับผิดชอบสูง และมีความอดทนundefined"
  },
  {
    "content": "IT System AdministratorIsuzu Motors Co., (Thailand) Ltd.Job Highlights\nIT support\nIT Administrator\nSystem supportProfile & Qualifications Required\n\n20 - 25 Years Old\nExperience  0-3 Years.\nBachelor degree in Information Technology, Computer Engineer or related fields.\nAble to report and communicate in English.\nAble to work overtime and holiday\nSpecific Knowledge:\n\nHave basic knowledge of Operating System Windows (+ AD or LINUX is advantage)\nHave some knowledge in basic application program skill such as Microsoft excel,\nHave good service mind\nKey Responsibility:\n\nSupport for IT admin (user password and permission management)\nUpdate status and report by periodical (Weekly , Monthly , Yearly)\nServer Replacement/Improvement in part of admin and AD (Active Directory)\nReceive problems from 1st tier, work around in admin concern point  and troubleshooting\nMonitoring, Checking and investigate system healthy and performance\nMaintain Email & VPN account (Add / Remove / Change)\nOr other assignment that relate the job improvementundefined"
  },
  {
    "content": "เจ้าหน้าที่สนับสนุนการตลาดBoonrawd Brewery Co., Ltd.Job Highlights\nเจ้าหน้าที่ธุรการ\nมีความรู้เรื่องการจัดเทรดโปรโมชั่นส่งเสริมการขาย\nประสานงานResponsibilities:\n\nช่วยจัดทำงบประมาณของแผนงานและเสนอความคิดในการวางแผนต่างๆของหน่วยงาน\nประสานงานกับหน่วยงานภายในบริษัท\nดำเนินการจัดทำงบประมาณของหน่วยงาน รวมทั้งตั้งหนี้ ติดตามการใช้งบประมาณ และค่าใช้จ่ายต่างๆของหน่วยงานกับ Supplier และคู่ค้าตามแผนงานที่กำหนดไว้\nติดต่อประสานงานหน่วยงานต่างๆ ทั้งภายในและภายนอก ดูแลควบคุมงานเอกสารต่างๆตามระเบียบ นโยบายของบริษัทตามที่ได้รับมอบหมาย\nQualifications:\n\nจบการศึกษาระดับชั้นปริญญาตรี\nสามารถใช้ Ms. Office ได้ดี เช่น Ms.Excel, Ms.Word\nมีประสบการณ์ด้านงานธุรการมาก่อน โดยเฉพาะในกลุ่มผลิตภัณฑ์อุปโภคบริโภคจะพิจารณาเป็นพิเศษundefined"
  },
  {
    "content": "Maintenance EngineerSiam Denso Manufacturing Co., Ltd.Job Highlights\nMaintenance Engineer\nCorrective and Preventive Maintenance\nAutomotive PartsResponsibilities\n• Monitor and maintain machine\n• Cooperate all issues for Reactive maintenance\n• Responsible for the maintenance and repair of machines and equipment including Preventive Maintenance\n• Analyze the problem, the cause of the problem in the process, machine production line problems\n• Make recommendations to repair the damaged parts effectively• Join the training and cross-functional meetings in respect of the responsibility\n• Plan TPM and PM Machine and Spare Part\n• Management and control BM plan and KPI.\n• Other assigned jobs from the supervisor\n\n Requirements\n\n• Good English Communicate (Must have TOEIC score 400 up)\n• Experience of more than 0-2 years in a Maintenance, Corrective and Preventive Maintenance.\n• Bachelor 's degree major in Mechanical Engineering, Control Engineering, Robot Automation Engineering, Mechatronic Engineering, Electrical Engineer.\n• Knowledge in PLC, Robot, Sensor, Servo motor, CNC machine, Instrument, SCADA.undefined"
  },
  {
    "content": "Production Engineer (Supplier Development Engineer)Siam Denso Manufacturing Co., Ltd.Job Highlights\nProduction Engineer\nSupplier Development Engineer\nAutomotive partsResponsibilities\nThe SDE will help and support to develop a partnership with suppliers and give training and support to Lead productivity cost reduction activity (DENSO way) with suppliers.\n- Early involvement in new projects, layout and set proper evaluation in place and hold vendors accountable on assuring their ability to meet company requirements, goals, and objectives.\n- Help and support improving supplier process and procedures.\n- Support divisions on suppliers to productivity improvement activities\n- Ability to identify supplier improvements (process, cost reduction system) and ensure effective actions are taken to improve.\n- Support / Lead productivity improvement Kaizen activities and cost reduction activities (DENSO way) with suppliers and develop supplier improvement plans.\n- Develop and manage and report supplier performance KPI’s.\n- Assumes and performs other duties as assigned.\n\nRequirements\n- Bachelor’s degree in engineering.\n- At 1-4 years of experience in improvement and development quality supplier and development performance of supplier\n- Must have TOEIC score 400\n- Have a well coordination and interpersonal skills for both internal and external departments.\n- Computer literacy including Microsoft Office.\n- Superb communication, interpersonal and leadership skills, Problem solver with a strong analytical mindset.undefined"
  },
  {
    "content": "Customer Service Executive - Key AccountDHL eCommerce Solutions (Thailand) LimitedJob Highlights\nHave experience in managing Key Account Client\nService mind and good interpersonal skills\nAble to work under pressure and logical thinkingJob descriptions\n\nTake care of Key Account Customer to provide smooth and engaging experience\nAct as the primary contact for customers and liaise with vendors on the service delivery to customers\nPrepare written correspondence to customers when required to furnish information requested by customers or in dealing with complaint resolution.\nProactively inform customers on shipment delays and potential service failures.\nAnticipate customer needs and solve them properly.\nCollaborate to set goals together with customer.\nProvide responsive reply & ensure promptness in handling customers’ enquiries and complaints\nLead and drive customer satisfaction by providing best in class standards with a view towards establishing and maintaining a competitive advantage\nComplete weekly, monthly and quarterly reports as required by customers and/or Management\nLiaise with Operations Team and other internal functions to achieve prompt and efficient resolution of customer issues and queries.\nQualifications\n\nGraduate with minimum Bachelor Degree\nMinimum 1 years of experience in managing Key Account Client in express logistics, freight forwarding or other related\nService mind and good interpersonal skills\nAble to work under pressure and logical thinking\nProficient in MS Office (Word, Excel)\nGood command in Englishundefined"
  },
  {
    "content": "Sales Executive (Copper scrap) - SCG InternationalThe Siam Cement Public Company Limited (SCG)Job Highlights\nPurchasing & Selling Non-ferrous scrap metals.\nPartnerships with International& Domestic Customer\nAble to work upcountryResponsibilities :\n\n\nResponsible for the purchasing and selling of non-ferrous scrap metals. (Copper scrap)\nDevelop and grow partnerships with international and domestic customers (Local-Export-Offshore-Import)  \nEstablish and maintain current suppliers and potential supplier relationships.\nIdentify prospective customers and contact them and also other accounts as assigned.\nDevelop knowledge and market trends of Copper scraps market\nClosely follow up supply situation\nManage account service through quality checks and others follow–up.\nAssist in developing strategic plans for generating new sources and sales \nPrepare for Sales related documents \nIdentify and resolve customer concerns.\nCoordinate company staff and manage internal systems  to accomplish the work required to close sales.\nFollow-up for collection of payment.\nCoordinate shipping schedules , delivery , services.\nQualifications :\nBachelor’s degree in Marketing, Business Administration or related field\nGood communication in both spoken and written English (required TOEIC at least 550)\nAchieved a minimum GPA of 2.7 for Undergraduate and 3.3 for Post-graduate studies.\n1 - 5 years of experience in Sales Executive (Industrial products) , Sales Import-Export  , Supply Chain \nDirect experience of Recycled / Metal -Non metal Non-Ferrous products or scraps related industry is preferable \nHaving driving license\nAble to work upcountry and rotate between each region is a must\n\n\nundefined"
  },
  {
    "content": "Project CoordinatorITE-ACME Joint Venture Co.,LtdJob Highlights\nGreat interpersonal skills & fluent in English\nProject Coordinator\nEngineeringEmployment Type:   Permanent staff\nWork days:                Monday – Friday (08.00 am – 05.00 pm)\nWorkplace:                Italthai Tower, Huaykwang, BKK\n--------------------------------------------\nRole Objectives:   \n\nResponsibilities (in details):\n\nProject support and task tracking including contracts, proposal letters, work authorizations, creation and/or maintenance of project directories and ensure all applicable permits are in place\nSupport Construction activities to ensure efficient process workflow\nMonitor and report field progress including manpower and quantities installed against the resources loaded estimate\nSupport Construction documentation management to ensure configuration control \nCoordinate and set-up meetings with team members and stakeholders Document, distribute and follow-up on action items\nProvide support to the Start-up and Commissioning team, including providing available manufacturer documentations and coordinating with 3rd Party vendor testing\nCoordinate training of installed equipment with facilities and maintenance teams\nProject Close-Out tasks include coordination of final inspections with local officials, close-out of all permits, documenting lessons learned and transmitting actual cost and schedule data to the estimating team for use in future project development\n\nQualifications:\n-      Bachelor's Degree in Engineering or other related majors\n-      At least 1 years of field oversight or coordinator experience with a construction firm.\n-      Ability to effectively prioritize with strong time management skills in a fast-paced environment\n-      Superior verbal and written communication skills\n-      Proficiency in speaking English is a must\n-      Highly organized with a strong attention to detail and professionalism and strong sense of urgency\n\nSuccessful candidates will be remunerated:-\n-     Life and Accident Insurance\n-     Dental Claims\n-     Health Insurance\n-     Provident Fund\n-     Bonus &  Salary Increment\n-     Annual Leave \n-     Corporate Activities such as New Year party, Outing etc.\n\n\nIf you meet the qualifications and are excited about this opportunity, please submit your resume and cover letter for consideration. We look forward to hearing from you!\nContact person :   Jarukit  080-908-2504\nLinkedin : ITE-ACME Joint Venture Co.,Ltd\nwww.ite-acme.com/\nhttps://www.linkedin.com/company/ite-acme-jointventure-co-ltd/mycompany/undefined"
  },
  {
    "content": "Supply Chain Planner ( SCG Distribution )The Siam Cement Public Company Limited (SCG)Job Highlights\nPlanning & Design Supply Chain Model\nAnalyze & Control Supply Chain Costing Process\nExp. in Logistic Management, Supply Chain etc.หน้าที่ความรับผิดชอบ:\nวางแผน และออกแบบ Supply Chain Operation Model และ Supply Chain Distribution Network ให้สอดคล้องประเภทสินค้าและระดับการบริการ (SLA)\nวิเคราะห์ ติดตาม และวางแผนต้นทุนใน Supply Chain  เช่น ต้นทุนการบริหารจัดการคลังสินค้า ต้นทุนการจัดเก็บสินค้า ต้นทุนการจัดส่งและกระจายสินค้าให้เหมาะสมและสอดคล้องกับระดับการบริการ  \nวางแผน และเสนอแนวทางสำหรับพัฒนากระบวณการใน Supply Chain (Supply Chain Process Improvement) เพื่อตอบสนองความต้องการของลูกค้า ในแต่ละช่องทางการขาย \nวิเคราะห์ และนำเสนอแนวทางในการลดต้นทุนใน Supply Chain \nตรวจสอบและติดตาม Supply Chain Performance พร้อมเสนอแนวทางในการพัฒนาและปรับปรุงประสิทธิภาพ \nประสานงานกับหน่วยงานที่เกี่ยวข้องทั้ง Internal และ External เพื่อให้การบริหารจัดการ Supply Chain  เป็นไปอย่างมีประสิทธิภาพ\n\n\nคุณสมบัติ : \n\n\nจบปริญญาตรีในสาขา Business Administration, Logistic, Supply Chain, Industrial Engineering หรือสาขาอื่นที่เกี่ยวข้อง (GPA 2.70 ขึ้นไปในระดับปริญญาตรี และ GPA 3.30 ขึ้นไปในระดับปริญญาโท) \n\nมีทักษะภาษาอังกฤษในระดับดี (TOEIC > 550)\nมีประสบการณ์ 1-3 ปี ที่เกี่ยวข้องกับ Logistic, Supply Chain หรืออื่นๆที่เกี่ยวข้อง (ยินดีรับพิจารณานักศึกษาจบใหม่)\nมีทักษะในการใช้โปรแกรม Microsoft Office  และ Power BI ได้เป็นอย่างดี \nมีความอดทน ละเอียด รอบคอบ มีทักษะด้านการบริหารจัดการที่ดี สามารถทำงานเป็นทีม และ ทำงานภายใต้ภาวะกดดันได้\nมีทักษะติดต่อประสานงาน  และมีไหวพริบในการแก้ไขปัญหาเฉพาะหน้าได้\nundefined"
  },
  {
    "content": "Design EngineerSatys Electric (Thailand) Co., Ltd.Job Highlights\nDesign Product & Drawing\nBachelor's Degree\nSamutparkranDesign Engineer\n\nResponsibilities:\n\nMainly responsibility is Design & Design support\nSkilled in Drawing (2D, 3D)\nDesign product & drawing following specification of customer for production.\nCheck production control plan & Ensure Technical spec availability\nPre-define Process flow for production & ensure feasibility of product\nDefine production technical file and raw materials needed for Production\nFile document control for raw material & product.\nMake & Control Bill Of Material (BOM). \nMake & Follow sample product for customer approval.\nMake Document for Customer approval Record\n\nRequirement:\n\nBachelor's Degree of Electrical Engineering /Electronic Engineering. \n2-5 years up for experience in Engineering Design (Electronic / Mechanical Fields).\nExpert in AutoCAD (2D/3D)\nSkilled on Pack Office\n\nสวัสดิการ:\n\n\nโบนัส\nประกันอุบัติเหตุกลุ่ม\nเงินช่วยเหลือต่างๆ(ฌาปนกิจ,งานแต่งงาน,ค่าศึกษาบุตร)\nประกันสังคม\nสิทธิวันลาพักร้อนสูงสุด 20 วันต่อปี ฯลฯ\nตรวจสุขภาพประจำปี \n\nสถานที่ปฏิบัติงาน  :  Bangkok Free Trade Zone (บางเสาธง  สมุทรปราการ)\n\nเวลาปฏิบัติงาน  :  จ-ศ เวลา 07.30 -16.30 น. หรือ  08.30 – 17.30 น.\n\nSatys Electric (Thailand) Co., Ltd.\nNo. 55/20,77 Moo15, Tambon Bangsaothong,\nAmphur Bangsaothong, Samutprakarn 10570\nTel : (66)2182 5198-9 ext.108\nFax : (66) 2182 5200\nWebsite: www.satyselectric.comundefined"
  },
  {
    "content": "QA Engineer (INSPECTION)Mitsubishi Electric Consumer Products (Thailand) Co., Ltd.Job Highlights\nNew graduated are welcome\nDegree in Electronics Engineering\nExperiences 0 – 4 yearsJob Scope:\n\n\nPCB Development test for New Model\nDis-continue part and VE part evaluation.\nDefected part investigation from production and customer claim.\nInvestigate defected part from Production and Testing room.\nReliability test (Electronic, Electric parts)\nResponsibility for all claim part (Local & Oversea)\nIncoming part Quality Control & Analysis job for construction part\n\nQualification\n\n\nNew graduated are welcome.\nBachelor's degree in Electronics Engineering\nExperiences 0 – 4 years\nBasic to English language for spoken and written.\nSkill Expertise in Microsoft office (Proficient: PowerPoint & Excel)\nCan use tools such as Digital oscilloscope, Scope Corders, power quality analysis.\nTOEIC score minimum 400 point.\n\n Product: Air conditioner “Mitsubishi Electric Mr. Slim”\n\nWorking Location:\n\nAmata City Chonburi Industrial Estate, Phase 4\n\n700/406 Moo7 Tambol Don Hua Roh Amphur Muang Chonburi 20000\n\nWorking conditions:\n\nWorking day – hours: Monday – Friday 07.40 – 17.00 (245 working Day/Year approximately)\nMonthly gross salary: Open for discussion or based on company policy.\n\nBenefits & Welfare: (Not limited as the below statements)\n\nVariable bonus\nProvident fund\nSaving cooperative\nMedical allowance and life insurance (including family)\nUniform and Transportation service\nDiligent allowance\nOversea training program \n\nAll position is required minimum GPA 2.50 and Proficient in English communication.\n\nThe successful candidate will receive generous remuneration package and fringe benefits. Interested persons please apply in person of send application letter with resume, Transcript and a recent photo to:\n\nHRD Section, Human Resources and Administration Department\n\nMitsubishi Electric Consumer Products (Thailand) Co., Ltd.\n\nAmata City Chonburi\n\n700 / 406 Moo 7  Tambon Don Hua Roh Amphur Muang Chonburi 2000\n\nTel : 0-3826-5800 Ext . 2233  E-mail. Recruit @ mcp.meap.com\n\nURL: www.mitsubishi-mcp.co.thundefined"
  },
  {
    "content": "Export Sales (Food Product : Located Singapore)Betagro Public Company LimitedJob Highlights\nExport Sales / International Sales\nFood Industry / FMCG / Trade\nWork at Singapore Office (Relocation Provide)Job Purpose\nBeing the company representative as a front line contact to response to customer inquiry or needs and look for new business opportunities and expanding new customers in Singapore. Cooperate with HQ teams and departments to coordinate and drive sales to achieve the optimum profits to the company. \n\n1. Company representative and front line or initial contact with customers in Singapore\n• Provide the best services as well as quick responsive to existing customers as well as coordinate with team in HQ and factory in Thailand on customers requirements\n• Seeking and establishing a new customer, then pass the new customer to HQ sales and/or market team to follow up \n\n2. Information Gathering, generating report and look for new business opportunity\n• Conduct market survey, analyze and report back to HQ regularly\n• Generate reporting of the current state of sales performance and search for new business opportunities\n• Work with marketing, product development and production team to develop product and sales plan to meet customer requirement\n• Seeking for any new business opportunity in Singapore & Malaysia  in order to generate own income\n\nQualifications\n1. Bachelor's/Master's Degree in Marketing, Business Administration, Economics, or any related filed\n2. Experiences at least 5 years in Sales & Marketing (Export Marketing would be advantage)\n3. Having Business Knowledge in Marketing, Supply Chain, and Finance\n4. Great communication (English TOEIC 650+ / Chinese HSK 3,4)\n5. Able to use basic computer (MsOffice - Excel ,Power Point)\n6. Well inter-personal skills and organized\n7. Leadership skill, Achievement Oriented, Work under pressure \n\nundefined"
  },
  {
    "content": "Process EngineerMondi Bangkok Co., Ltd.Job Highlights\n3 years experience in Process and Manufacturing\nAnalytic and problem solving aptitude\nGood in Written & Spoken at EnglishLocation:  Petchaburi\n\nJob Scope \n\n\nAssist in production operations to drive improvement in manufacturing efficiencies by utilizing continuous improvement techniques\nWork with Quality and test to deliver a robust and cost-effective end to end process\nIdentify and implement new technologies, specification of requirements\nApply Lean Manufacturing and Sig Sigma tools and methodology / throughout the manufacturing facility and processes\nUses general data analysis skills to identify issues and use existing data sets that move projects and forward across multiple sites\nAssist Process Owners in identifying barriers to project success and helps to drive changes when needed.\nProblem solving in process an corrective action and Preventive action \nCo-ordinate with all other departments mainly production, quality and maintenance to ensure maximum utilization of machines and keep track of all key indicators.\n\nQualification\n\nBachelor Degree in Industrial Engineering or related\n3 years experience in Process and Manufacturing\nWorking in an international surrounding is a plus\nUnderstand BRC PPM for Food Packaging\nPossesses basic statistical knowledge and the ability to apply statistics to process improvement projects\nExcellent in Office Application software, Words, PowerPoint and Excel\nExcellent inter-personal skills to build relationship internally and externally\nCross-functional business team environment experience preferred\nReliable and flexible in their approach\nGood in Written & Spoken at English \nWe invite qualified candidates to submit their resume stating\npresent and expected salary via: \n\n\"Apply Now\" \n\nMondi TSP Co., Ltd.   \n110 Moo 3, Nong Chumphon Nuea , Khao Yoi , Pechaburi ,Thailand 76140\nhttps://www.mondigroup.comundefined"
  },
  {
    "content": "School Administrator/เจ้าหน้าที่ธุรการAster International School BangkokJob Highlights\nBachelor’s degree\nGreat attention to detail.\nFlexible and adaptable approach.JOB HIGHLIGHTS\n\nBachelor’s degree\nExperience of Human Resources work and other Administrative functions within a thriving and fast paced work environment.\nFluency in English and Thai language is essential.\nStrong IT proficiency.\nGreat attention to detail.\nFlexible and adaptable approach.\nAble to work with colleagues and external agencies, with clear communication, a friendly disposition and a professional demeanor.\nKEY RESPONSIBILITIES\n\nAdministrative Support & Receptions\nIn discussion with the School Manager, Director of Business Services and Principal, coordinate and support on areas of Administration that the school requires. This could range to working alongside the academic team in running events.\nReporting to management and performing administrative duties.\nAnswering telephone calls, as well as screening and forwarding calls.\nWelcoming and assisting visitors in a friendly and professional manner.\nHandling basic inquiries and sorting mail.\nPerforming other administrative tasks, if required.\n\nPlease send resume Apply Nowundefined"
  },
  {
    "content": "Production Engineer - Map Ta PhutThai Polycarbonate Co., Ltd.Job Highlights\nBachelor's Degree in Chemical Engineering.\n0-3 Years of experience in Petrochemical plant\nNew graduate are welcomeQualifications :\n\nBachelor's Degree in Chemical Engineering.\n0 - 3 years of experience with the petrochemical or chemical plant.\nGood command of English both in writing & speaking.\nResponsibilities :\n\nInstruct operation team for start-up and shutdown plants.\nResearch to improve plant performance and efficiency, safety for solving technical problems to update techniques, and work with process engineer.\nWork with DCS and instrument engineer to improve and ensure process control and monitoring.\nComply with the Quality system, Environmental system, Occupational and Safety management system strictly.\nWork location: Map Ta Phut, Rayong\n\nSpecial welfare :\n\n\nWe provide basic salary plus 30% allowances for the position base in Maptaphut plant.undefined"
  },
  {
    "content": "Strategic Planning Officer/เจ้าหน้าที่วางแผนกลยุทธ์Bangkok Aviation Fuel Services Public Company LimitedJob Highlights\nปริญญาตรี บริหารธุรกิจ การจัดการ เศรษฐศาสตร์\nมีประสบการณ์ด้านการวางแผนกลยุทธ์ อย่างน้อย 2 ปี\nประสานงานได้ดี นำเสนอดี มีความรู้ภาษาอังกฤษดีคุณสมบัติ\n\nการศึกษาระดับ ปริญญาตรี บริหารธุรกิจ การจัดการ เศรษฐศาสตร์ หรือสาขาที่เกี่ยวข้อง\nมีประสบการณ์ด้านการวางแผนกลยุทธ์ อย่างน้อย 2 ปี\nมีทักษะการติดต่อสื่อสารชัดเจน ประสานงานได้ดี มีทักษะการนำเสนอดี \nมีความคิดสร้างสรรค์ มีความเป็นผู้นำ มีความละเอียดถี่ถ้วน\nมีความรู้ภาษาอังกฤษดี\nมีความรู้และใช้โปรแกรมคอมพิวเตอร์ Microsoft Office และอื่น ๆ ได้เป็นอย่างดี\nปฏิบัติงานที่สำนักงานใหญ่ ดอนเมือง\n\nหน้าที่โดยย่อ\n\nรวบรวมและจัดการข้อมูลเพื่อจัดทำแผนกลยุทธ์กลุ่มบริษัทให้สอดคล้องกับสถานการณ์ปัจจุบัน และรับผิดชอบในการติดตามงาน/สรุปผลการดำเนินงานที่เกี่ยวข้องกับกลุ่มบริษัท เพื่อนำเสนอให้ฝ่ายบริหารพิจารณาเป็นแนวทางในการบริหารจัดการ และศึกษาข้อมูลเชิงลึกในแต่ละกลุ่มธุรกิจของแต่ละหน่วยงาน สร้างความเชื่อมโยงและสอดคล้องกันระหว่างกลยุทธ์และผู้มีส่วนได้ส่วนเสียทั้งภายในและภายนอก รวมถึงการสื่อสารโดยการจัดกิจกรรมสื่อสารเชิงกลยุทธ์\n\nความยากของงาน\n\nเป็นงานที่เกี่ยวกับการรวบรวม จัดการข้อมูลและประสานงานกับทุกหน่วยงานในบริษัทและกลุ่มบริษัทเพื่อนำข้อมูลมาจัดทำแผนกลยุทธ์กลุ่มบริษัท สามารถให้คำแนะนำด้านตัวชี้ วัดผลการดำเนินงานหรือข้อมูลเกี่ยวกับแผนกลยุทธ์กลุ่มบริษัท รวมทั้งสื่อสารและกระตุ้นพนักงานหรือบุคคลที่เกี่ยวข้องให้รับทราบทิศทางแผนกลยุทธ์กลุ่มบริษัท พร้อมกับจัดทำเอกสารประกอบการประชุมและ Workshop นัดหมาย จองห้องประชุม บันทึกการประชุม จัดทำรายงานที่เกี่ยวกับแผนกลยุทธ์กลุ่มบริษัท ตรวจสอบเอกสารทั้งหมดก่อนจัดเก็บในระบบ Athena ดังนั้น จึงต้องมีความละเอียดถี่ถ้วน และมีความเข้าใจในหลักการวางแผนกลยุทธ์กลุ่มบริษัทและการจัดทำดัชนีชี้ วัดผลการดำเนินงานเป็นอย่างดี มีความเชี่ยวชาญในการบันทึกข้อมูลในระบบ Athena และสามารถแก้ปัญหาในระบบ Athena ในเบื้องต้นได้ มีความสามารถในการจัดพิมพ์ จัดเรียงเอกสารประกอบการประชุมได้รวดเร็ว รวมทั้งมีเทคนิคการสื่อสารที่ชัดเจน กระชับและตรงประเด็นundefined"
  },
  {
    "content": "R&D Officer – Senior/เจ้าหน้าที่วิจัยและพัฒนาผลิตภัณฑ์Berli Jucker Foods LimitedJob Highlights\nMaster’s degree in Food Science & Food Tech\nBachelor’s degree with food industry experience >1\nexp.in R&D function in food industryResponsibilities :\n\nTo Research and develop new project product and to coordinate with Marketing and Supplier\n\nRequirements:\n\n• Master’s degree in Food Science & Food Tech, Food Engineering or Bachelor’s degree with food industry or consumer product experience > 1 year\n• At last 3 years’ experience in R&D function in food industry\n• Knowledge of GMP, HACCP and ISO systems a good creative & innovative in research and developing food products\n• Good Command of spoken & written in English\n• Good Computer literate in MS-Office, SPSS, Outlook\n• Able to work Monday – Saturday ( 09.00-18.00 )\n• Please attach the transcript document.\n\nWelfare and Benefit\n\n• Bonus\n• Vacation 10-15 days\n• Public holiday 15 days / year\n• Provident Fund\n• Expense for medical cover to spouse and children\n• first aid room\n• Employee saving cooperative\n• Annual physical check-up\n• Life Insurance\n• Transportation\n• Uniform\n• Training and Development\n• Scholarship for employee’s children\n• Low priced foods & company product\n• Wedding Giftundefined"
  },
  {
    "content": "HR OfficerOffice of Human Resources Management, Chulalongkorn UniversityJob Highlights\nSalary 19,500 - 29,300 THB\nMaster's or Bachelor’s Degree in any field\nHR StrategyChulalongkorn University is Thailand's top-ranked university, working to produce graduates who are academically competent, equipped with up-to-date skills, and instilled with public-mindedness and leadership qualities and to venture into and integrate a variety of knowledge as well as to create teaching, learning, and research innovations. In addition, Chulalongkorn University's mission is to produce academic research works that are acceptable at the international level and apply the knowledge to mobilize the nation and Thai society in a sustainable manner.\n\nThe Office of Human Resource Management's vision is to be the top department in human resource management. The department aims to please service personnel and support the university's main missions.\n\n\nJob descriptions\n\nAnalyzing, scrutinizing, and summarizing discussion agenda from the faculties including making a memorandum to inform the board’s consideration result to faculties\nPreparing agenda and presentation to the board\nMaking a minute\nPerforming the HR Projects as assigned\nCoordinating with other departments\nOther tasks as assigned\n\nSpecific qualifications\n\nGraduated with a Master's or Bachelor’s Degree in any field\nGood command of English (TOEIC 400, IELTS 4, TOEFL 433)\nThe ability to analyze and concisely present\nThe ability to coordinate, communicate, and consult\n\nIf you are interested in this position, please apply via our website https://careers.chula.ac.th/recruit/jobdetail/11814\n\nClosing date: 6 Dec 2023\n\nIf you have any queries about this role, don't hesitate to get in touch with K.Walisara Kreethapol via Tel. 02 218 0363\n\nundefined"
  },
  {
    "content": "Admin/พนักงานธุรการThe Planner Education Co., Ltd.Job Highlights\nBachelor's Degree (English Major or similar)\n20-25k/ detail oriented/ 1 yr exp\ninsurance, bonus, yearly pay raiseResponsibility\n\n\narrange and record class schedules\nregister exams for students and keep track for the exam results\nperform tasks related to academic fields and book productions \nprepare documents, books, and files (hard and soft copy) for students\ncommunicate across students, parents, teachers, and other teams\nmanage office supplies and ensure all office supplies are in good conditions\nprovide overall administrative tasks as assigned\nQualifications\nBachelor's Degree (Major in English preferable)\nAt least 1 year work experience in Administrative Role or similar role\nGood command of English (all the books, tests, timetables are in English)\n\nGood at using Office (Excel, Word), Google Suite\nAttention to detail\nAble to work on Saturday and Sunday (2 days off on weekdays)\nOffice: Mercury Ville @ Chitlom, 3rd floor, Pleonchit Road, Patumwan, Bangkok (BTS Chidlom exit 4)\n\n\n\nFor interested candidates, please send the documents below to APPLY NOW button\n1. your resume\n2. recent photo\n\n\nundefined"
  },
  {
    "content": "Engineer (Body Assembly Engineering)TOYOTA DAIHATSU ENGINEERING & MANUFACTURING CO., LTD.Job Highlights\nLead overall jobs for Body Assembly\nProject preparation\nNew graduateLead overall jobs for Body Assembly\nProject preparation\nNew graduate\nQualifications: \n\nLead overall jobs for Body Assembly project preparation since initial study, SE process, Tooling specification, Installation and trial, Welding quality & QBI confirmation\nProblem analysis, countermeasure\nFollow up until standard operating procedure go smoothly\nManage working team & collaborate activity among Toyota Research & Development group\nQualifications:\nBachelor degree in Mechanical, Industrial Engineering or related field\nGPAX not lower than 2.50\nGood command of English both reading and writing (TOEIC score at least 550 *MUST*)\nSelf-Motivation and Leadership mindset\n\nLet us find you easier by apply on our website: https://www.toyota.co.th/career/careerundefined"
  },
  {
    "content": "Administrator/Salary 20,000 - 30,000 bahtCentury Grow Co., Ltd.Job Highlights\nExperience in administrative\nCommunication in English or Chinese\nArranging visa and work permit for employeesIndustry: E-Commerce\n\nLocation: Nearby BTS Asok, MRT Sukhumvit\n\nJob Description:\n\nMeeting and greeting clients, answering incoming calls and coordinating internally.\nSupervise all administrative tasks and Provide main contact of the company.\nResponsible for planning, organizing, and developing of the overall operation of the housekeeping\nDealing with email enquiries and arranging post and deliveries.\nArranging visa and work permit for employees.\nExamine time of attendance of employees.\nOrganizing travel and accommodation for staff and management team.\nReimbursement for all admin expenses and control cost.\nCoordinate with the juristic office regarding parking, repair, office decoration etc.\nOversee purchasing functions.\nExecutive assistants as assigned.\nResponsible for all documents related to the administrative work.\nSupport Recruitment job\nQualifications:\n\nGraduated with a bachelor's degree in any related field.\nMinimum 1 years of experience in administrative work and visa and work permit experience. (New graduation are welcome)\nService-minded, Work well under pressure, Detail oriented,  Strong problem solving skills when faced with challenges.\nFluent in written and spoken English or Chinese undefined"
  },
  {
    "content": "Procurement and Administration OfficerNuovo Plus Company LimitedJob Highlights\nProcurement and Administration\nTOEIC Score 600 คะแนนขึ้นไป\nNegotiation & Communication SkillsMain Purpose:\n\nResponsible for planning and procurement activities in the Bangkok area and managing projects to align with budgets and centralize operations. Supporting various employee activities within the company through general management and support duties.\n\n\nMain Responsibilities:\n\nThe general daily management responsibilities include overseeing office operations and documentation to ensure smooth workflow.\nManage employee welfare according to policies, practices, and employee manuals. This includes providing uniforms, gift cards for birthdays, condolences for funerals, etc.\"\nManage the company's office and transportation services, including workspace procurement, space management, and amenities in the office. Oversee office repairs or renovations, internal office management such as the dining area, office equipment, cleanliness, and maintenance of the Bangkok office building. This also involves managing reception staff, housekeeping, and drivers, handling internal and interprovincial document transfers, and coordinating central transportation services. Procure fuel cards, such as M Pass, for company vehicles and oversee the maintenance and management of company vehicles according to the maintenance plan.\nManage and oversee various contracts related to office building management, such as leasing contracts for office space in Bangkok, service contracts for office space, contracts for housekeeping/driver/messenger services, equipment leasing contracts, and telephone network contracts. This also includes company vehicle leasing contracts and contracts for properties falling under the responsibility, aiming to maximize benefits for employees and the company.\nOversee and execute the procurement of office supplies and general office procurement, as well as compile reports.\nInspect the management of office equipment and the entire fleet of the company's vehicles.\nCoordinate with hotels and travel agents for booking accommodation, transportation, travel insurance, and visas for employees.\nEstablish and maintain effective relationships with suppliers, service providers, and various departments to ensure quality service delivery.\nReview all agreements and contracts related to the company's operations and infrastructure procurement.\nServe as a central point for receiving requests, coordinating tasks, monitoring statuses, and resolving procurement issues from internal users in the Bangkok area and projects.\nCompile and summarize the results of organizational procurement and commercial procurement for analysis and continuous improvement planning.\nInspect the receipt of goods and related services in the central management operations.\nPerform other duties as assigned.\n\nQualification:\n\n\nBachelor's degree in a related field.\nMinimum 2-3 years of experience in office management.\nSkills in planning and systematic coordination. \nFlexible in performing tasks\nProficient in using computer programs such as SAP and others.\nGood proficiency in listening, speaking, reading, and writing in English.\nTOEIC 600 is requiredundefined"
  },
  {
    "content": "Administrative OfficerThe Border Consortium (TBC)Job Highlights\nDetails Oriented\nCommunication Skill\nInter-personal SkillAdministration:\n\n         Assist with database processing including database entry, database updating, database compilation and help to communicate information from HR & Admin Team to TBC staff.\n         Assist front-office reception services, including telephone exchange and recording postal correspondence.\n         Assist with delivery and receipt of goods and correspondence (e.g. dealing with mail & courier services).\n         Assist with travel, accommodation and logistical arrangements for staff and visitors (e.g. arranging bookings, tickets, taxis, etc.)\n         Provide secretarial support as required (e.g. typing narrative reports, data entry, scanning and copying)\n         Assist in logistics and food preparation for meetings, trainings, and workshops.\n         Update, maintain and consolidate TBC employees’ leave record.\n         Maintain office equipment and facilities in good working condition and keep the record for Fixed Assets Register/Inventory Record.\n         Assist the purchase and monitoring of office supplies following TBC procurement procedures (e.g. collecting quotes).\n         Arrange for stocks (e.g. stationery and office supplies) to be replenished and equipment (e.g. air conditioning units and phones) to be repaired where necessary.\n         Assist with bill payments following the TBC Staff Policy Manual (e.g. checking receipts and paying bills)ใ\n\nGovernment liaison:\n\n         Support visa and work permit application process for international staff and their dependences.\n         Coordinate with Ministry of Interior and TBC’s field office to support processing all camp pass requests  and permission letters\n\nOther Occasional Duties:\n\n         Provide other forms of support as required and/or requested by HR & Admin Specialist.\n        Support HR & Admin team during an absence of a team member.undefined"
  },
  {
    "content": "PRODUCTION IMPROVEMENT (ASSEMBLY PROCESS) - ENGINEERMitsubishi Motors (Thailand) Co., Ltd.Job Highlights\nNew graduate are welcome\n5 Working days a week with Flexible working hour\nGood Benefit & Welfare , Employee shuttle servicePosition    :     PRODUCTION IMPROVEMENT (ASSEMBLY PROCESS) - ENGINEER\nAvailable  :     1 position\nLocation   :     Laemchabang Industrial Estate, Chonburi\n\n\n\nWe offer a competitive salary and the following benefits\n■  5 working days a week\n■  Flexible working hours\n■  Shuttle bus for employee \n■  Group insurance\n■  Long service award\n■  Scholarship opportunities for child\n■  Mitsubishi Car discount scheme\n■  Mitsubishi Parts 50% discount scheme\n■  Provident fund maximum 13% salary each month\n■  Medical claim allowance for family (parents & spouse)\n■  Opportunity to work abroad with fully support allowance\n \n\n\nJob Summary\nDevelops and improves manufacturing processes by studying products and manufacturing methods. Improves manufacturing efficiency by analyzing and planning workflow, space requirements, and equipment layout.\n \n\n\nJob Description\n■   New model preparing such as Mold, Jig, Die, Tool, Equipment, and New Machine.\n■  Production Equipment capacity planning and improvement.\n■  Process guideline planning and Process change control.\n■  Involve for improve quality, cost, delivery, and energy saving.\n■  Utilize new technology for production tools, equipment, process, and Material.\n■  Preparation or setting conditions for safety.\n■  Problem analysis.\n■  Support another division for ABP and LRBP.\n■  Environment matter for Equipment and Facility.\n■  Improve current and new equipment.\n■  Sub-material preparation and authorization.\n \n\n\nJob Specification\n■  New graduate or 1-2 years of working experience in production process.\n■  Bachelor’s degree or higher in Engineering.\n■  Good command of English, able to communicate effectively.\n■  Computer literacy especially in MS Office, PowerPoint, and Outlook.\n■  Good attitude, communication, teamwork, and collaboration.\n■  Able to work under pressure, good team player, and good coordination skills.\n■  Experienced in assembly process will be an advantage.\n___________________________________________________________________________________\nRemark: English resume requested\nundefined"
  },
  {
    "content": "Laboratory Officer/เจ้าหน้าที่ห้องปฏิบัติการAqua Touch Laboratory Co. Ltd.Job Highlights\nงานห้องปฏิบัติการ\nการศึกษา ป. ตรีวิทยาศาสตร์ เทคโนโลยีชีวภาพ\nยินดีต้อนรับนักศึกษาจบใหม่เงินเดือน: ตามตกลง\n\nสวัสดิการ: ประกันสังคม ประกันสุขภาพ วันหยุดประจำปี เบี้ยขยัน  เงินค่าล่วงเวลา และอื่น ๆ\n\nจำนวน: 2 อัตรา\n\nสถานที่ทำงาน: กรุงเทพฯ ลาดกระบัง\n\nเวลาทำงาน: จันทร์ – ศุกร์ 8:00-17:00\n\nความรับผิดชอบ:\n\nรับตัวอย่าง ลงบันทึก และเตรียมตัวอย่างเพื่อตรวจโรคสัตว์น้ำในห้องปฏิบัติการ\nปฏิบัติงานทดสอบในห้องปฏิบัติการตรวจโรคสัตว์น้ำ ได้แก่ DNA/RNA extraction, PCR, Real-time PCR และด้านจุลชีววิทยาตามขั้นตอนระบุใน SOP\nจัดทำเอกสาร บันทึกผล รายงานผลการทดสอบ ต่อหัวหน้างาน ภายในระยะเวลาที่กำหนด\nดูแลรักษาและลงบันทึก เครื่องมือ อุปกรณ์ สถานที่ สิ่งแวดล้อม ที่ได้รับมอบหมาย\nจัดทำเอกสารคุณภาพ คู่มือและ SOP ต่าง ๆ ของห้องปฏิบัติการ\nให้ความร่วมมือในการขอการรับรอง ISO/IEC 17025:2017 และระบบคุณภาพอื่น ๆ ที่ เกี่ยวข้อง\nปฏิบัติงานอื่น ๆ ในห้องปฏิบัติการที่ได้รับมอบหมาย\nคุณสมบัติ:\nต้องผ่านการเกณฑ์ทหารแล้ว\nวุฒิการศึกษา ป. ตรีวิทยาศาสตร์ ขึ้นไป สาขาชีววิทยา เทคโนโลยีชีวภาพจุลชีววิทยา ประมง หรือสาขาอื่น ๆ ที่เกี่ยวข้อง\nมีทักษะด้าน Molecular biology เช่น การสกัด DNA และ RNA, PCR และ Real-time PCR\nมีทักษะด้าน Microbiology เช่น เตรียมอาหารเลี้ยงเชื้อ ทดสอบหาเชื้อแบคทีเรียก่อโรค\nมีมนุษย์สัมพันธ์ดี สามารถทำงานเป็นทีม ละเอียด รอบคอบ เรียนรู้งานได้อย่างรวดเร็ว และมีความรับผิดชอบสูง\nสามารถทำงานคนเดียวและเป็นทีมภายใต้แรงกดดันได้ดี\nมีความสามารถในการใช้คอมพิวเตอร์ Microsoft Office (Word, Excel) ได้ดี\nสามารถเขียนและอ่านภาษาอังกฤษในระดับดี\nมีประสบการณ์ในห้องปฏิบัติการตรวจโรค หรือการทดลองเกี่ยวกับโรคสัตว์น้ำจะพิจารณาเป็นพิเศษ\nมีประสบการณ์ในระบบมาตรฐานห้องปฏิบัติการ ISO/IEC 17025:2017 และระบบคุณภาพอื่น ๆ จะพิจารณาเป็นพิเศษ\nยินดีต้อนรับนักศึกษาจบใหม่undefined"
  },
  {
    "content": "Group Performance CoordinatorSiam City Cement Public Company LimitedJob Highlights\nPerformance Management\nFlexibility to adapt\nCoordinatorProvide high-level administrative support to Group Performance Office, assisting in managing daily operations, schedules, communications, and various administrative tasks. This role demands a proactive and organized individual capable of handling a wide range of responsibilities in a fast-paced environment. The Group Performance Coordinator will be a key contributor to optimizing the efficiency and effectiveness of the CPO's work.\n\nRole & Responsibilities:\n\nMaintain and coordinate the CPO's calendar, scheduling appointments, meetings, and events.\nEnsure that the CPO is well-prepared and informed for all engagements.\nArrange and coordinate travel itineraries, accommodation, and transportation for the CPO's business trips.\nPrepare meeting agendas, attend meetings as required, and take minutes.\nCoordinate and organize materials for meetings, conferences, and presentations.\nOversee the efficient operation of the Performance Office (with team), including office supplies, equipment, and facilities.\nAssist in managing budgets and expense reports.\nAct as a primary point of contact between the CPO and internal/external stakeholders.\nManage and respond to emails, phone calls, and correspondence on behalf of the CPO.\nDraft, consolidate from different sources and edit business documents, reports, and presentations.\nTrack and manage projects and tasks assigned, ensuring deadlines are met.\nCollaborate with team members to facilitate project execution and report progress.\nMaintain and organize files, records, and documents, both physical and electronic.\nEnsure data and information confidentiality and accuracy.\nDynamic nature of the business and schedule coupled with overlapping/conflicting priorities of other top management executives in the company.\nQualifications:\n\nBachelor’s degree or equivalent experience.\nAt least 3 years proven work experience in a similar capacity in a fast paced company is preferred.\nProficiency in office software and communication tools (e.g., MS Office, email, calendars).\nExceptional organizational and time management skills.\nStrong communication and interpersonal abilities. Fluent in English & Thai.\nHigh level of discretion and confidentiality.\nDetail-oriented and proactive problem-solving skills.\nFlexibility to adapt to changing priorities and responsibilities.undefined"
  },
  {
    "content": "URGENT !! Export Operation Officer/เจ้าหน้าที่ประสานงานฝ่ายส่งออกMaruzen Showa (Thailand) Ltd.Job Highlights\nExport Operation\nGood command in English\nHighly responsible and fast learnerJob details:\n\nPermanent employee.\nOffice Place :     Bangkok (Near BTS Ekkamai).\nHoliday :            Weekend, and Public Holiday.\nOffice Hour :      Monday – Friday, 9.00 A.M. – 5.00 P.M.\n\nJob Description :\n\n\nCo-ordinate with customer, shipping and overseas agent.\nCo-ordinate with carrier for booking vessel space and  process documentation. \nSend export pre-alert and corresponding with oversea agent for any cases and support any problem.\nBooking truck for inland transportation and cross border \nChecking export declaration sheet\nChecking inland / overseas policy for transportation.\nChecking for warehouse available for future plan.\nDocument support, Email \nPrepare invoice and collect all document.    \nChecking BOI, JTEPA, AJ Form, BIS or any document FORM which is related to export business.\n\nQualifications:\n\nEducation : High Vocational Certificate in Management or Bachelor Degree in Logistics, Supply Chain, International Business or related field.\n\nSkills required  :\n\n\nGood command in basic computer programs. (Word, Excel, Power Point, PDF)\nGood command in communication skills English & Thai - verbal and written.\nWell-organized and able to work under pressure and time constraint.\nMultitasking Skills.\nStrong analytical and problem-solving skills.\nStrong interpersonal and communication skills and service mind.\nGood collaborations and teamwork\nHave knowledge of Customs Act and preparing import / export declaration sheet will be advantaged.\nHave knowledge in document which is related to import / export cargo, and customs clearance procedure. (BOI, JTEPA, AJ Form, Form E, Form D, BIS, TISI, FDA, Royal Forest Dept., and Etc.) will be advantaged.undefined"
  },
  {
    "content": "Company Secretary(Junior)/เลขานุการบริษัทCHEWATHAI PLC.Job Highlights\ncompany secretary\nSecurities company\nReal Estateความรับผิดชอบ (โดยย่อ)\n\nรับผิดชอบงานเลขานุการบริษัท อาทิ จัดประชุมผู้ถือหุ้น, ประชุมคณะกรรมการบริษัท, ประชุมคณะกรรมการบริหาร รวมถึงประชุมคณะจัดการหรือคณะกรรมการชุดย่อยอื่นๆ งานควบคุมและติดตามการจัดเก็บเอกสารที่เกี่ยวข้องของบริษัท งานกำกับดูแลกับหน่วยงาน เช่น สำนักงานตลาดหลักทรัพย์ฯ งานดูแลการเปิดเผยข้อมูลและรายงานสารสนเทศต่อหน่วยงานที่กำกับดูแลและสาธารณะชนให้ถูกต้องครบถ้วนตามกฎหมาย และงานอื่นที่เกี่ยวข้อง\n\nคุณสมบัติทั่วไป\n\n\nมีประสบการณ์อย่างน้อย 2 - 4 ขึ้นไปที่เกี่ยวกับงานเลขานุการบริษัทหรือบริษัทมหาชน\nมีความรู้ ความเข้าใจเกี่ยวกับกฎหมายบริษัทมหาชน จำกัด ข้อกำหนด กฎเกณฑ์ และระเบียบปฏิบัติของตลาดหลักทรัพย์แห่งประเทศไทย และสำนักงานคณะกรรมการกำกับหลักทรัพย์และตลาดหลักทรัพย์ในระดับที่เหมาะสมกับงานที่รับผิดชอบ\nหากผ่านการอบรมหลักสูตรบังคับของงานเลขานุการบริษัทจากสถาบันที่เกี่ยวข้อง เช่น สถาบันกรรมการบริษัทไทย (Thai-IOD) หรือ สมาคมบริษัทจดทะเบียนไทย (TLCA) เป็นต้น จะได้รับพิจารณาเป็นพิเศษundefined"
  },
  {
    "content": "Secretary เลขานุการ/เลขานุการM V S T CO., LTD.Job Highlights\n5 days work week\nExcellent time management skill\nGood command of Englishรายละเอียดงาน\n• ติดตามและประสานงานภายในและภายนอกในงานประชุม การจัดประชุม การจัดทำเอกสารประชุม รายงานการประชุม และการแจ้งมติที่ประชุม รวมถึงควบคุมและติดตามการดำเนินการทางธุรการต่าง ๆ ของการประชุม\n• ดูแล ติดตาม และประสานงานตารางนัดหมาย การเบิกค่าใช้จ่ายต่างๆ ของผู้บริหาร และอื่นๆ\n• สนับสนุนรายงานและติดตามงานที่ได้รับมอบหมายจากผู้บังคับบัญชา ทั้งงานประจำ หรืองานโครงการที่เกี่ยวกับงานของบริษัท\n• ดำเนินการจัดทำระบบฐานข้อมูลในงานที่เกี่ยวข้อง\n• กลั่นกรองงานเอกสารที่เกี่ยวข้อง รวมถึงการจัดทำหนังสือ จดหมาย เป็นต้น • รับรองผู้ติดต่อ/ ผู้บริหารทั้งภายในและภายนอกองค์กร\n• ปฎิบัติงานตามที่ได้รับมอบหมายจากผู้บังคับบัญชา\n\nคุณสมบัติผู้สมัคร\nปริญญาตรี สาขาการจัดการ หรือสาขาที่เกี่ยวข้อง\nมีประสบการณ์ด้านเลขานุการระดับผู้บริหาร อย่างน้อย 2 ปีขึ้นไป\nมีทักษะในการสื่อสารภาษาไทย และภาษาอังกฤษระดับดี\nมีความสามารถในการใช้คอมพิวเตอร์โปรแกรม MS Office MS Excel ได้อย่างคล่องแคล่ว\nมีทักษะในการจัดเก็บข้อมูลอย่างเป็นระบบ\nมีความสามารถในการแก้ไขปัญหาเฉพาะหน้า\nมีทัศนคติที่ดีต่อการทำงาน\nมีความสามารถในการแก้ไขปัญหาเฉพาะหน้า\nมีทักษะการประสานงานอย่างมีประสิทธิภาพundefined"
  }
]