[
  {
    "id": "300003002971817",
    "url": "https://th.jobsdb.com/th/en/job/field-marketing-operations-coordinator-admin-phuket-based-300003002971817?token=0~a6ddbf7c-c1f3-48f4-94b1-98542bf7ff6a&sectionRank=1&jobId=jobsdb-th-job-300003002971817",
    "content": "Field Marketing Operations Coordinator - Admin (Phuket Based)Wyndham Vacation Resorts (Thailand) LimitedJob Highlights\nAdministrator, Coordinator, Tour Booking, Teamwork\nProcessing, Marketing, Stock order, Email, Service\nInformation, Communication,Data integrity,FlexiblePRINCIPAL RESPONSIBILITIES:  (Include but not limited to)\n\nProcess tour bookings in Club Wyndham Asia’s system\nAssist with reporting for the Field Marketing department\nAssist with the Dispatch/Logistics function of Field Marketing\nAssist with the processing and approval of Field Marketing  payroll\nAssist with processing of invoices\nAssist with organizing and sourcing Field Marketing collateral and premiums\nGain relevant approvals for and complete stock orders for all Field Marketing regions\nProvide Adhoc information requests\nEnsure data integrity of systems and maintain accurate records to ensure departmental compliance with business and government standards and regulations.\nDisplay Count on Me! Service to all internal and external parties\nShow integrity in all aspects of the position by doing the right thing, taking responsibility and delivering on the Wyndham promise.\nDisplay leadership values by ensuring effective communication and respecting your peers and managers. Support others within the team and empower each other wherever possible.\nAdhere to all company policies and procedures\nAny other duties within your skill levels as requested by the Company from time to time\n\n KEY POSITION CRITERIA:\n\nCommitted to providing excellent customer service at all times.\nBe detailed, accurate and thorough.\nPossess a positive, can do attitude with the ability to self motivate.\nIntermediate to advanced MS Office skills, particularly Microsoft Excel and Access\nAbility to work in a fast paced environment\nGood written and verbal communication skills with the ability to effectively respond to questions from managers, co-workers and clients.\nAbility to meet time frames and performance standards\nAbility to manage multiple tasks and be able to think laterally when problem solving\nGood time management skills\nFlexibility in working schedule- ability to work weekends, public holidays and evenings as requiredundefined"
  },
  {
    "id": "300003002967451",
    "url": "https://th.jobsdb.com/th/en/job/oversea-purchasing-import-export-%E0%B9%80%E0%B8%88%E0%B9%89%E0%B8%B2%E0%B8%AB%E0%B8%99%E0%B9%89%E0%B8%B2%E0%B8%97%E0%B8%B5%E0%B9%88%E0%B8%95%E0%B9%88%E0%B8%B2%E0%B8%87%E0%B8%9B%E0%B8%A3%E0%B8%B0%E0%B9%80%E0%B8%97%E0%B8%A8-300003002967451?token=0~a6ddbf7c-c1f3-48f4-94b1-98542bf7ff6a&sectionRank=2&jobId=jobsdb-th-job-300003002967451",
    "content": "Oversea Purchasing / Import - Export/เจ้าหน้าที่ต่างประเทศXenon Inter Co., Ltd.Job Highlights\nมีความก้าวหน้าในการทำงาน\nโอกาสในการเติบโตสูง\nมีการทำงานที่หลากหลายหน้าที่ความรับผิดชอบ\n\nจัดหา และสั่งซื้อสินค้า จาก supplier ต่างประเทศ \nติดตามการดำเนินการนำเข้า ระยะเวลาการผลิต และเงื่อนไขการขนส่งจนสินค้าถึงโกดัง\nตรวจสอบเอกสารการนำเข้า/ส่งออก สินค้า ได้แก่ Invoice, Packing list, AWB, B/L และขอใบอนุญาตนำเข้าต่างๆ\nดูแลเอกสารการชำระสินค้า ผ่านธนาคาร (นำเข้า / ส่งออก) ในเงื่อนไข L/C, B/C, T/T\nประสานงานกับหน่วยงานที่เกี่ยวข้อง ในการส่งกลับคืน / เคลมหากสินค้าไม่ได้มาตรฐาน\nติดต่อ และยื่นเอกสารกับหน่วยงานราชการ เพื่อนำเข้า และส่งออกสินค้า\n\nคุณสมบัติ\n\nระดับการศึกษา : ปริญญาตรี ขึ้นไป\nประสบการณ์(ปี) : 1ปีขึ้นไป\n\nคุณสมบัติเพิ่มเติม\n\nประสบการณ์ ในตำแหน่ง Import / Export 1 ปีขึ้นไป\nมีความรู้ด้านภาษาอังกฤษ\nมีบุคลิกภาพดี คล่องแคล่ว ว่องไว ไหวพริบดี พูดจาฉะฉาน มีความมั่นใจ กระตือรือร้น\nมีความรับผิดชอบสูง และมีความอดทนundefined"
  },
  {
    "id": "300003002967810",
    "url": "https://th.jobsdb.com/th/en/job/it-system-administrator-300003002967810?token=0~a6ddbf7c-c1f3-48f4-94b1-98542bf7ff6a&sectionRank=3&jobId=jobsdb-th-job-300003002967810",
    "content": "IT System AdministratorIsuzu Motors Co., (Thailand) Ltd.Job Highlights\nIT support\nIT Administrator\nSystem supportProfile & Qualifications Required\n\n20 - 25 Years Old\nExperience  0-3 Years.\nBachelor degree in Information Technology, Computer Engineer or related fields.\nAble to report and communicate in English.\nAble to work overtime and holiday\nSpecific Knowledge:\n\nHave basic knowledge of Operating System Windows (+ AD or LINUX is advantage)\nHave some knowledge in basic application program skill such as Microsoft excel,\nHave good service mind\nKey Responsibility:\n\nSupport for IT admin (user password and permission management)\nUpdate status and report by periodical (Weekly , Monthly , Yearly)\nServer Replacement/Improvement in part of admin and AD (Active Directory)\nReceive problems from 1st tier, work around in admin concern point  and troubleshooting\nMonitoring, Checking and investigate system healthy and performance\nMaintain Email & VPN account (Add / Remove / Change)\nOr other assignment that relate the job improvementundefined"
  },
  {
    "id": "300003002967645",
    "url": "https://th.jobsdb.com/th/en/job/%E0%B9%80%E0%B8%88%E0%B9%89%E0%B8%B2%E0%B8%AB%E0%B8%99%E0%B9%89%E0%B8%B2%E0%B8%97%E0%B8%B5%E0%B9%88%E0%B8%AA%E0%B8%99%E0%B8%B1%E0%B8%9A%E0%B8%AA%E0%B8%99%E0%B8%B8%E0%B8%99%E0%B8%81%E0%B8%B2%E0%B8%A3%E0%B8%95%E0%B8%A5%E0%B8%B2%E0%B8%94-300003002967645?token=0~a6ddbf7c-c1f3-48f4-94b1-98542bf7ff6a&sectionRank=4&jobId=jobsdb-th-job-300003002967645",
    "content": "เจ้าหน้าที่สนับสนุนการตลาดBoonrawd Brewery Co., Ltd.Job Highlights\nเจ้าหน้าที่ธุรการ\nมีความรู้เรื่องการจัดเทรดโปรโมชั่นส่งเสริมการขาย\nประสานงานResponsibilities:\n\nช่วยจัดทำงบประมาณของแผนงานและเสนอความคิดในการวางแผนต่างๆของหน่วยงาน\nประสานงานกับหน่วยงานภายในบริษัท\nดำเนินการจัดทำงบประมาณของหน่วยงาน รวมทั้งตั้งหนี้ ติดตามการใช้งบประมาณ และค่าใช้จ่ายต่างๆของหน่วยงานกับ Supplier และคู่ค้าตามแผนงานที่กำหนดไว้\nติดต่อประสานงานหน่วยงานต่างๆ ทั้งภายในและภายนอก ดูแลควบคุมงานเอกสารต่างๆตามระเบียบ นโยบายของบริษัทตามที่ได้รับมอบหมาย\nQualifications:\n\nจบการศึกษาระดับชั้นปริญญาตรี\nสามารถใช้ Ms. Office ได้ดี เช่น Ms.Excel, Ms.Word\nมีประสบการณ์ด้านงานธุรการมาก่อน โดยเฉพาะในกลุ่มผลิตภัณฑ์อุปโภคบริโภคจะพิจารณาเป็นพิเศษundefined"
  },
  {
    "id": "300003002971378",
    "url": "https://th.jobsdb.com/th/en/job/maintenance-engineer-300003002971378?token=0~a6ddbf7c-c1f3-48f4-94b1-98542bf7ff6a&sectionRank=5&jobId=jobsdb-th-job-300003002971378",
    "content": "Maintenance EngineerSiam Denso Manufacturing Co., Ltd.Job Highlights\nMaintenance Engineer\nCorrective and Preventive Maintenance\nAutomotive PartsResponsibilities\n• Monitor and maintain machine\n• Cooperate all issues for Reactive maintenance\n• Responsible for the maintenance and repair of machines and equipment including Preventive Maintenance\n• Analyze the problem, the cause of the problem in the process, machine production line problems\n• Make recommendations to repair the damaged parts effectively• Join the training and cross-functional meetings in respect of the responsibility\n• Plan TPM and PM Machine and Spare Part\n• Management and control BM plan and KPI.\n• Other assigned jobs from the supervisor\n\n Requirements\n\n• Good English Communicate (Must have TOEIC score 400 up)\n• Experience of more than 0-2 years in a Maintenance, Corrective and Preventive Maintenance.\n• Bachelor 's degree major in Mechanical Engineering, Control Engineering, Robot Automation Engineering, Mechatronic Engineering, Electrical Engineer.\n• Knowledge in PLC, Robot, Sensor, Servo motor, CNC machine, Instrument, SCADA.undefined"
  },
  {
    "id": "300003002971377",
    "url": "https://th.jobsdb.com/th/en/job/production-engineer-supplier-development-engineer-300003002971377?token=0~a6ddbf7c-c1f3-48f4-94b1-98542bf7ff6a&sectionRank=6&jobId=jobsdb-th-job-300003002971377",
    "content": "Production Engineer (Supplier Development Engineer)Siam Denso Manufacturing Co., Ltd.Job Highlights\nProduction Engineer\nSupplier Development Engineer\nAutomotive partsResponsibilities\nThe SDE will help and support to develop a partnership with suppliers and give training and support to Lead productivity cost reduction activity (DENSO way) with suppliers.\n- Early involvement in new projects, layout and set proper evaluation in place and hold vendors accountable on assuring their ability to meet company requirements, goals, and objectives.\n- Help and support improving supplier process and procedures.\n- Support divisions on suppliers to productivity improvement activities\n- Ability to identify supplier improvements (process, cost reduction system) and ensure effective actions are taken to improve.\n- Support / Lead productivity improvement Kaizen activities and cost reduction activities (DENSO way) with suppliers and develop supplier improvement plans.\n- Develop and manage and report supplier performance KPI’s.\n- Assumes and performs other duties as assigned.\n\nRequirements\n- Bachelor’s degree in engineering.\n- At 1-4 years of experience in improvement and development quality supplier and development performance of supplier\n- Must have TOEIC score 400\n- Have a well coordination and interpersonal skills for both internal and external departments.\n- Computer literacy including Microsoft Office.\n- Superb communication, interpersonal and leadership skills, Problem solver with a strong analytical mindset.undefined"
  },
  {
    "id": "300003002967864",
    "url": "https://th.jobsdb.com/th/en/job/customer-service-executive-key-account-300003002967864?token=0~a6ddbf7c-c1f3-48f4-94b1-98542bf7ff6a&sectionRank=7&jobId=jobsdb-th-job-300003002967864",
    "content": "Customer Service Executive - Key AccountDHL eCommerce Solutions (Thailand) LimitedJob Highlights\nHave experience in managing Key Account Client\nService mind and good interpersonal skills\nAble to work under pressure and logical thinkingJob descriptions\n\nTake care of Key Account Customer to provide smooth and engaging experience\nAct as the primary contact for customers and liaise with vendors on the service delivery to customers\nPrepare written correspondence to customers when required to furnish information requested by customers or in dealing with complaint resolution.\nProactively inform customers on shipment delays and potential service failures.\nAnticipate customer needs and solve them properly.\nCollaborate to set goals together with customer.\nProvide responsive reply & ensure promptness in handling customers’ enquiries and complaints\nLead and drive customer satisfaction by providing best in class standards with a view towards establishing and maintaining a competitive advantage\nComplete weekly, monthly and quarterly reports as required by customers and/or Management\nLiaise with Operations Team and other internal functions to achieve prompt and efficient resolution of customer issues and queries.\nQualifications\n\nGraduate with minimum Bachelor Degree\nMinimum 1 years of experience in managing Key Account Client in express logistics, freight forwarding or other related\nService mind and good interpersonal skills\nAble to work under pressure and logical thinking\nProficient in MS Office (Word, Excel)\nGood command in Englishundefined"
  },
  {
    "id": "300003002967921",
    "url": "https://th.jobsdb.com/th/en/job/sales-executive-copper-scrap-scg-international-300003002967921?token=0~a6ddbf7c-c1f3-48f4-94b1-98542bf7ff6a&sectionRank=8&jobId=jobsdb-th-job-300003002967921",
    "content": "Sales Executive (Copper scrap) - SCG InternationalThe Siam Cement Public Company Limited (SCG)Job Highlights\nPurchasing & Selling Non-ferrous scrap metals.\nPartnerships with International& Domestic Customer\nAble to work upcountryResponsibilities :\n\n\nResponsible for the purchasing and selling of non-ferrous scrap metals. (Copper scrap)\nDevelop and grow partnerships with international and domestic customers (Local-Export-Offshore-Import)  \nEstablish and maintain current suppliers and potential supplier relationships.\nIdentify prospective customers and contact them and also other accounts as assigned.\nDevelop knowledge and market trends of Copper scraps market\nClosely follow up supply situation\nManage account service through quality checks and others follow–up.\nAssist in developing strategic plans for generating new sources and sales \nPrepare for Sales related documents \nIdentify and resolve customer concerns.\nCoordinate company staff and manage internal systems  to accomplish the work required to close sales.\nFollow-up for collection of payment.\nCoordinate shipping schedules , delivery , services.\nQualifications :\nBachelor’s degree in Marketing, Business Administration or related field\nGood communication in both spoken and written English (required TOEIC at least 550)\nAchieved a minimum GPA of 2.7 for Undergraduate and 3.3 for Post-graduate studies.\n1 - 5 years of experience in Sales Executive (Industrial products) , Sales Import-Export  , Supply Chain \nDirect experience of Recycled / Metal -Non metal Non-Ferrous products or scraps related industry is preferable \nHaving driving license\nAble to work upcountry and rotate between each region is a must\n\n\nundefined"
  },
  {
    "id": "300003002967467",
    "url": "https://th.jobsdb.com/th/en/job/project-coordinator-300003002967467?token=0~a6ddbf7c-c1f3-48f4-94b1-98542bf7ff6a&sectionRank=9&jobId=jobsdb-th-job-300003002967467",
    "content": "Project CoordinatorITE-ACME Joint Venture Co.,LtdJob Highlights\nGreat interpersonal skills & fluent in English\nProject Coordinator\nEngineeringEmployment Type:   Permanent staff\nWork days:                Monday – Friday (08.00 am – 05.00 pm)\nWorkplace:                Italthai Tower, Huaykwang, BKK\n--------------------------------------------\nRole Objectives:   \n\nResponsibilities (in details):\n\nProject support and task tracking including contracts, proposal letters, work authorizations, creation and/or maintenance of project directories and ensure all applicable permits are in place\nSupport Construction activities to ensure efficient process workflow\nMonitor and report field progress including manpower and quantities installed against the resources loaded estimate\nSupport Construction documentation management to ensure configuration control \nCoordinate and set-up meetings with team members and stakeholders Document, distribute and follow-up on action items\nProvide support to the Start-up and Commissioning team, including providing available manufacturer documentations and coordinating with 3rd Party vendor testing\nCoordinate training of installed equipment with facilities and maintenance teams\nProject Close-Out tasks include coordination of final inspections with local officials, close-out of all permits, documenting lessons learned and transmitting actual cost and schedule data to the estimating team for use in future project development\n\nQualifications:\n-      Bachelor's Degree in Engineering or other related majors\n-      At least 1 years of field oversight or coordinator experience with a construction firm.\n-      Ability to effectively prioritize with strong time management skills in a fast-paced environment\n-      Superior verbal and written communication skills\n-      Proficiency in speaking English is a must\n-      Highly organized with a strong attention to detail and professionalism and strong sense of urgency\n\nSuccessful candidates will be remunerated:-\n-     Life and Accident Insurance\n-     Dental Claims\n-     Health Insurance\n-     Provident Fund\n-     Bonus &  Salary Increment\n-     Annual Leave \n-     Corporate Activities such as New Year party, Outing etc.\n\n\nIf you meet the qualifications and are excited about this opportunity, please submit your resume and cover letter for consideration. We look forward to hearing from you!\nContact person :   Jarukit  080-908-2504\nLinkedin : ITE-ACME Joint Venture Co.,Ltd\nwww.ite-acme.com/\nhttps://www.linkedin.com/company/ite-acme-jointventure-co-ltd/mycompany/undefined"
  },
  {
    "id": "300003002967567",
    "url": "https://th.jobsdb.com/th/en/job/supply-chain-planner-scg-distribution-300003002967567?token=0~a6ddbf7c-c1f3-48f4-94b1-98542bf7ff6a&sectionRank=10&jobId=jobsdb-th-job-300003002967567",
    "content": "Supply Chain Planner ( SCG Distribution )The Siam Cement Public Company Limited (SCG)Job Highlights\nPlanning & Design Supply Chain Model\nAnalyze & Control Supply Chain Costing Process\nExp. in Logistic Management, Supply Chain etc.หน้าที่ความรับผิดชอบ:\nวางแผน และออกแบบ Supply Chain Operation Model และ Supply Chain Distribution Network ให้สอดคล้องประเภทสินค้าและระดับการบริการ (SLA)\nวิเคราะห์ ติดตาม และวางแผนต้นทุนใน Supply Chain  เช่น ต้นทุนการบริหารจัดการคลังสินค้า ต้นทุนการจัดเก็บสินค้า ต้นทุนการจัดส่งและกระจายสินค้าให้เหมาะสมและสอดคล้องกับระดับการบริการ  \nวางแผน และเสนอแนวทางสำหรับพัฒนากระบวณการใน Supply Chain (Supply Chain Process Improvement) เพื่อตอบสนองความต้องการของลูกค้า ในแต่ละช่องทางการขาย \nวิเคราะห์ และนำเสนอแนวทางในการลดต้นทุนใน Supply Chain \nตรวจสอบและติดตาม Supply Chain Performance พร้อมเสนอแนวทางในการพัฒนาและปรับปรุงประสิทธิภาพ \nประสานงานกับหน่วยงานที่เกี่ยวข้องทั้ง Internal และ External เพื่อให้การบริหารจัดการ Supply Chain  เป็นไปอย่างมีประสิทธิภาพ\n\n\nคุณสมบัติ : \n\n\nจบปริญญาตรีในสาขา Business Administration, Logistic, Supply Chain, Industrial Engineering หรือสาขาอื่นที่เกี่ยวข้อง (GPA 2.70 ขึ้นไปในระดับปริญญาตรี และ GPA 3.30 ขึ้นไปในระดับปริญญาโท) \n\nมีทักษะภาษาอังกฤษในระดับดี (TOEIC > 550)\nมีประสบการณ์ 1-3 ปี ที่เกี่ยวข้องกับ Logistic, Supply Chain หรืออื่นๆที่เกี่ยวข้อง (ยินดีรับพิจารณานักศึกษาจบใหม่)\nมีทักษะในการใช้โปรแกรม Microsoft Office  และ Power BI ได้เป็นอย่างดี \nมีความอดทน ละเอียด รอบคอบ มีทักษะด้านการบริหารจัดการที่ดี สามารถทำงานเป็นทีม และ ทำงานภายใต้ภาวะกดดันได้\nมีทักษะติดต่อประสานงาน  และมีไหวพริบในการแก้ไขปัญหาเฉพาะหน้าได้\nundefined"
  },
  {
    "id": "300003002971557",
    "url": "https://th.jobsdb.com/th/en/job/design-engineer-300003002971557?token=0~a6ddbf7c-c1f3-48f4-94b1-98542bf7ff6a&sectionRank=11&jobId=jobsdb-th-job-300003002971557",
    "content": "Design EngineerSatys Electric (Thailand) Co., Ltd.Job Highlights\nDesign Product & Drawing\nBachelor's Degree\nSamutparkranDesign Engineer\n\nResponsibilities:\n\nMainly responsibility is Design & Design support\nSkilled in Drawing (2D, 3D)\nDesign product & drawing following specification of customer for production.\nCheck production control plan & Ensure Technical spec availability\nPre-define Process flow for production & ensure feasibility of product\nDefine production technical file and raw materials needed for Production\nFile document control for raw material & product.\nMake & Control Bill Of Material (BOM). \nMake & Follow sample product for customer approval.\nMake Document for Customer approval Record\n\nRequirement:\n\nBachelor's Degree of Electrical Engineering /Electronic Engineering. \n2-5 years up for experience in Engineering Design (Electronic / Mechanical Fields).\nExpert in AutoCAD (2D/3D)\nSkilled on Pack Office\n\nสวัสดิการ:\n\n\nโบนัส\nประกันอุบัติเหตุกลุ่ม\nเงินช่วยเหลือต่างๆ(ฌาปนกิจ,งานแต่งงาน,ค่าศึกษาบุตร)\nประกันสังคม\nสิทธิวันลาพักร้อนสูงสุด 20 วันต่อปี ฯลฯ\nตรวจสุขภาพประจำปี \n\nสถานที่ปฏิบัติงาน  :  Bangkok Free Trade Zone (บางเสาธง  สมุทรปราการ)\n\nเวลาปฏิบัติงาน  :  จ-ศ เวลา 07.30 -16.30 น. หรือ  08.30 – 17.30 น.\n\nSatys Electric (Thailand) Co., Ltd.\nNo. 55/20,77 Moo15, Tambon Bangsaothong,\nAmphur Bangsaothong, Samutprakarn 10570\nTel : (66)2182 5198-9 ext.108\nFax : (66) 2182 5200\nWebsite: www.satyselectric.comundefined"
  },
  {
    "id": "300003002967603",
    "url": "https://th.jobsdb.com/th/en/job/qa-engineer-inspection-300003002967603?token=0~a6ddbf7c-c1f3-48f4-94b1-98542bf7ff6a&sectionRank=12&jobId=jobsdb-th-job-300003002967603",
    "content": "QA Engineer (INSPECTION)Mitsubishi Electric Consumer Products (Thailand) Co., Ltd.Job Highlights\nNew graduated are welcome\nDegree in Electronics Engineering\nExperiences 0 – 4 yearsJob Scope:\n\n\nPCB Development test for New Model\nDis-continue part and VE part evaluation.\nDefected part investigation from production and customer claim.\nInvestigate defected part from Production and Testing room.\nReliability test (Electronic, Electric parts)\nResponsibility for all claim part (Local & Oversea)\nIncoming part Quality Control & Analysis job for construction part\n\nQualification\n\n\nNew graduated are welcome.\nBachelor's degree in Electronics Engineering\nExperiences 0 – 4 years\nBasic to English language for spoken and written.\nSkill Expertise in Microsoft office (Proficient: PowerPoint & Excel)\nCan use tools such as Digital oscilloscope, Scope Corders, power quality analysis.\nTOEIC score minimum 400 point.\n\n Product: Air conditioner “Mitsubishi Electric Mr. Slim”\n\nWorking Location:\n\nAmata City Chonburi Industrial Estate, Phase 4\n\n700/406 Moo7 Tambol Don Hua Roh Amphur Muang Chonburi 20000\n\nWorking conditions:\n\nWorking day – hours: Monday – Friday 07.40 – 17.00 (245 working Day/Year approximately)\nMonthly gross salary: Open for discussion or based on company policy.\n\nBenefits & Welfare: (Not limited as the below statements)\n\nVariable bonus\nProvident fund\nSaving cooperative\nMedical allowance and life insurance (including family)\nUniform and Transportation service\nDiligent allowance\nOversea training program \n\nAll position is required minimum GPA 2.50 and Proficient in English communication.\n\nThe successful candidate will receive generous remuneration package and fringe benefits. Interested persons please apply in person of send application letter with resume, Transcript and a recent photo to:\n\nHRD Section, Human Resources and Administration Department\n\nMitsubishi Electric Consumer Products (Thailand) Co., Ltd.\n\nAmata City Chonburi\n\n700 / 406 Moo 7  Tambon Don Hua Roh Amphur Muang Chonburi 2000\n\nTel : 0-3826-5800 Ext . 2233  E-mail. Recruit @ mcp.meap.com\n\nURL: www.mitsubishi-mcp.co.thundefined"
  },
  {
    "id": "300003002967890",
    "url": "https://th.jobsdb.com/th/en/job/export-sales-food-product-%3A-located-singapore-300003002967890?token=0~a6ddbf7c-c1f3-48f4-94b1-98542bf7ff6a&sectionRank=13&jobId=jobsdb-th-job-300003002967890",
    "content": "Export Sales (Food Product : Located Singapore)Betagro Public Company LimitedJob Highlights\nExport Sales / International Sales\nFood Industry / FMCG / Trade\nWork at Singapore Office (Relocation Provide)Job Purpose\nBeing the company representative as a front line contact to response to customer inquiry or needs and look for new business opportunities and expanding new customers in Singapore. Cooperate with HQ teams and departments to coordinate and drive sales to achieve the optimum profits to the company. \n\n1. Company representative and front line or initial contact with customers in Singapore\n• Provide the best services as well as quick responsive to existing customers as well as coordinate with team in HQ and factory in Thailand on customers requirements\n• Seeking and establishing a new customer, then pass the new customer to HQ sales and/or market team to follow up \n\n2. Information Gathering, generating report and look for new business opportunity\n• Conduct market survey, analyze and report back to HQ regularly\n• Generate reporting of the current state of sales performance and search for new business opportunities\n• Work with marketing, product development and production team to develop product and sales plan to meet customer requirement\n• Seeking for any new business opportunity in Singapore & Malaysia  in order to generate own income\n\nQualifications\n1. Bachelor's/Master's Degree in Marketing, Business Administration, Economics, or any related filed\n2. Experiences at least 5 years in Sales & Marketing (Export Marketing would be advantage)\n3. Having Business Knowledge in Marketing, Supply Chain, and Finance\n4. Great communication (English TOEIC 650+ / Chinese HSK 3,4)\n5. Able to use basic computer (MsOffice - Excel ,Power Point)\n6. Well inter-personal skills and organized\n7. Leadership skill, Achievement Oriented, Work under pressure \n\nundefined"
  },
  {
    "id": "300003002971369",
    "url": "https://th.jobsdb.com/th/en/job/process-engineer-300003002971369?token=0~a6ddbf7c-c1f3-48f4-94b1-98542bf7ff6a&sectionRank=14&jobId=jobsdb-th-job-300003002971369",
    "content": "Process EngineerMondi Bangkok Co., Ltd.Job Highlights\n3 years experience in Process and Manufacturing\nAnalytic and problem solving aptitude\nGood in Written & Spoken at EnglishLocation:  Petchaburi\n\nJob Scope \n\n\nAssist in production operations to drive improvement in manufacturing efficiencies by utilizing continuous improvement techniques\nWork with Quality and test to deliver a robust and cost-effective end to end process\nIdentify and implement new technologies, specification of requirements\nApply Lean Manufacturing and Sig Sigma tools and methodology / throughout the manufacturing facility and processes\nUses general data analysis skills to identify issues and use existing data sets that move projects and forward across multiple sites\nAssist Process Owners in identifying barriers to project success and helps to drive changes when needed.\nProblem solving in process an corrective action and Preventive action \nCo-ordinate with all other departments mainly production, quality and maintenance to ensure maximum utilization of machines and keep track of all key indicators.\n\nQualification\n\nBachelor Degree in Industrial Engineering or related\n3 years experience in Process and Manufacturing\nWorking in an international surrounding is a plus\nUnderstand BRC PPM for Food Packaging\nPossesses basic statistical knowledge and the ability to apply statistics to process improvement projects\nExcellent in Office Application software, Words, PowerPoint and Excel\nExcellent inter-personal skills to build relationship internally and externally\nCross-functional business team environment experience preferred\nReliable and flexible in their approach\nGood in Written & Spoken at English \nWe invite qualified candidates to submit their resume stating\npresent and expected salary via: \n\n\"Apply Now\" \n\nMondi TSP Co., Ltd.   \n110 Moo 3, Nong Chumphon Nuea , Khao Yoi , Pechaburi ,Thailand 76140\nhttps://www.mondigroup.comundefined"
  },
  {
    "id": "300003002974636",
    "url": "https://th.jobsdb.com/th/en/job/school-administrator-%E0%B9%80%E0%B8%88%E0%B9%89%E0%B8%B2%E0%B8%AB%E0%B8%99%E0%B9%89%E0%B8%B2%E0%B8%97%E0%B8%B5%E0%B9%88%E0%B8%98%E0%B8%B8%E0%B8%A3%E0%B8%81%E0%B8%B2%E0%B8%A3-300003002974636?token=0~a6ddbf7c-c1f3-48f4-94b1-98542bf7ff6a&sectionRank=15&jobId=jobsdb-th-job-300003002974636",
    "content": "School Administrator/เจ้าหน้าที่ธุรการAster International School BangkokJob Highlights\nBachelor’s degree\nGreat attention to detail.\nFlexible and adaptable approach.JOB HIGHLIGHTS\n\nBachelor’s degree\nExperience of Human Resources work and other Administrative functions within a thriving and fast paced work environment.\nFluency in English and Thai language is essential.\nStrong IT proficiency.\nGreat attention to detail.\nFlexible and adaptable approach.\nAble to work with colleagues and external agencies, with clear communication, a friendly disposition and a professional demeanor.\nKEY RESPONSIBILITIES\n\nAdministrative Support & Receptions\nIn discussion with the School Manager, Director of Business Services and Principal, coordinate and support on areas of Administration that the school requires. This could range to working alongside the academic team in running events.\nReporting to management and performing administrative duties.\nAnswering telephone calls, as well as screening and forwarding calls.\nWelcoming and assisting visitors in a friendly and professional manner.\nHandling basic inquiries and sorting mail.\nPerforming other administrative tasks, if required.\n\nPlease send resume Apply Nowundefined"
  }
]