[
  {
    "id": "300003002968216",
    "url": "https://th.jobsdb.com/th/en/job/administrative-officer-%E0%B9%80%E0%B8%88%E0%B9%89%E0%B8%B2%E0%B8%AB%E0%B8%99%E0%B9%89%E0%B8%B2%E0%B8%97%E0%B8%B5%E0%B9%88%E0%B8%9D%E0%B9%88%E0%B8%B2%E0%B8%A2%E0%B8%98%E0%B8%B8%E0%B8%A3%E0%B8%81%E0%B8%B2%E0%B8%A3%E0%B9%81%E0%B8%A5%E0%B8%B0%E0%B8%9B%E0%B8%A3%E0%B8%B0%E0%B8%AA%E0%B8%B2%E0%B8%99%E0%B8%87%E0%B8%B2%E0%B8%99%E0%B8%97%E0%B8%B1%E0%B9%88%E0%B8%A7%E0%B9%84%E0%B8%9B-300003002968216?token=0~9bd4b922-1296-4b28-b88b-7e8f8a479dd4&sectionRank=1&jobId=jobsdb-th-job-300003002968216",
    "content": "Administrative Officer/เจ้าหน้าที่ฝ่ายธุรการและประสานงานทั่วไปJBEVERAGE (THAILAND)CO.,LTD.Job Highlights\n20,000-45,000 THB, Negotiable\nNear BTS Asok, MRT Sukhumvit\nEnglish Business Level or Japanese Business LevelOffice Location: Near BTS - Asok / RSU Tower 7th Floor, Sukhumvit 31\nEmployment Type:  Permanent\nCompensation:  20,000-45,000 THB, Negotiable\nWorking Time: Mon-Fri. 08.30am-17.30pm \nWebsite: http://jbeverage.com\n\nJob descriptions\n\n\nIssue the TAX Invoice and Quotation\nActive participation in office management.\nAttend meetings with supplier , schedule meetings and appointment.\nPreparing formal letters, documents or reports as assigned.\nChecking internal daily documents such as tax invoice \nPerforming other special job as assigned.\nMaintain good relationship with current clients.\n\nQualifications\n\n\nBachelor’s Degree or Higher \nStrong communication and negotiation skills.\nGood command of written and spoken Japanese (N2,N3) or  English (TOEIC at least 650)\nFull Service mind, good interpersonal skill, able to handle confidentiality.\nAble to handle pressure and multiple tasks. Excellent time management skills, ability to prioritize.\nSelf-directed and able to work without supervision.\nGood computer skills, knowledge in Microsoft office.\n\nBenefits\n\n\nHealth/Medical Insurance\nPerfect Attendance\nInterested candidate, please submit a full detail resume in English including expected salary with a recent photograph to the e-mail address\n\nJBEVERAGE (THAILAND) CO., LTD.\n\n571 RSU Tower, 7th Floor, Sukhumvit 31, Sukhumvit Road,\nKlongton Nua, Wattana, Bangkok, 10110 Thailand\nT : +66(0)2-258-4915   F : +66(0)2-258-4918\nW : http://jbeverage.comundefined"
  },
  {
    "id": "300003002964764",
    "url": "https://th.jobsdb.com/th/en/job/production-engineer-industrial-engineer-%E0%B8%A7%E0%B8%B4%E0%B8%A8%E0%B8%A7%E0%B8%81%E0%B8%A3-%E0%B8%A7%E0%B8%B4%E0%B8%A8%E0%B8%A7%E0%B8%81%E0%B8%A3%E0%B8%9D%E0%B9%88%E0%B8%B2%E0%B8%A2%E0%B8%9C%E0%B8%A5%E0%B8%B4%E0%B8%95-%E0%B8%A7%E0%B8%B4%E0%B8%A8%E0%B8%A7%E0%B8%81%E0%B8%A3%E0%B9%82%E0%B8%A3%E0%B8%87%E0%B8%87%E0%B8%B2%E0%B8%99-300003002964764?token=0~9bd4b922-1296-4b28-b88b-7e8f8a479dd4&sectionRank=2&jobId=jobsdb-th-job-300003002964764",
    "content": "Production Engineer/Industrial Engineer/วิศวกร/ วิศวกรฝ่ายผลิต/ วิศวกรโรงงานFuture Makers Co., Ltd.Job Highlights\nCareer opportunity in an international environment\nMeeting with Team management every week\nSalary: 25,000 - 45,000More about this position:\nhttps://fb.watch/kGAQF2CcSp/\n\nสถานที่ทำงาน: โรงงานพระราม2 (ติดเซนทรัลพระราม2)\n\nคุณสมบัติ\n1. จบปริญญาตรีด้าน วิศวกรรมผลิต,อุตสาหกรรม, ซัพพลายเชน, โลจิสติก หรือคณะที่เกี่ยวข้อง\n2. เกรดเฉลี่ย2.6ขึ้นไป\n3. มีความรู้พื้นฐาน JIT, TPS, 5S, Lean เป็นอย่างดี\n4. อยากท้าทายความสามารถตัวเอง\n5. อยากเติบโตไวกว่ามาตรฐานในสายอาชีพเดียวกัน\n6. ขยันอดทนทำงานเป็นทีมได้ดี\n7. มีความเป็นผู้นำสูง\n\nสวัสดิการ\n1. ทั่วไป\n2. 20,000บาท ครอบคุมพ่อแม่50%\n3. อาหารขนมกลางวันฟรี\n4. โรงอาหารหอพักราคาถูก\n5. สิทธิ์ในการซื้อหุ้นราคาพิเศษในอนาคต\n\nแนะนำบริษัทคร่าวๆ: FM เป็นบริษัทStart Up,จำนวนพนักงาน300-400คน\n\nปัจจบันดำเนินการ โรงงานเฟอร์นิเจอร์\n\nเป้าหมายคือ Market Place4.0 หรือการควบคุมโรงงานต่างๆของในเครือในประเทศต่างๆได้ จากHQกรุงเทพ ผ่านการพัฒนาระบบการผลิต และSoftware (อาทิตโรงงานมาเลเซีย2024/Q1 และ USA 2024/Q4)\n\nบริษัทมีระบบERPที่เขียนขึ้นเองเชื่อมโยง พนักงาน ซึ่งระบบที่เขียนจะถูกพัฒนาขึ้นเรื่อยๆจากRequirements ของทีมวิศวกร\nยกตัวอย่าง ระบบบาโค๊ดในแต่ละจุด ทำให้ประเมินผลตอบแทน พนักงานไลน์ผลิตรายบุคคลได้แม่นยำและยุติธรรมขึ้น\n\nสำหรับงานของวิศวกร ทำงานวิเคราะห์ พัฒนา ออกแบบ แก้ปัญหา เท่านั้น ไม่ใช่งานRoutine\n\nบริษัทมีการแบ่งระดับพนักงานในโรงงานออกเป็น4กลุ่ม\n\n1. Power (พนักงานผลิต)\n2. Operator ( หัวหน้ากะ, พนักงานสายอาชีพ)\n3. Supervisors\n4. Managers\n\nโดยในการเก็บข้อมูลหรืองานRoutine แก้ไขปัญหาเบื้องต้นจะเป็นหน้าที่ของระดับO\n\nโดยระดับเริ่มต้นของวิศวกรจบใหม่จะเริ่มที่S1 หรือSupervisor Level1\n\nสามารถศึกษาข้อมูลเพื่อเติมเกี่บวกับงานวิศวกรรมของFM ประสบการณ์ความเห็นของวิศวกรปัจจุบันและข้อมูลบริษัทได้ที่เพจ FM career\n\nundefined"
  },
  {
    "id": "300003002968134",
    "url": "https://th.jobsdb.com/th/en/job/sports-activities-administrator-300003002968134?token=0~9bd4b922-1296-4b28-b88b-7e8f8a479dd4&sectionRank=3&jobId=jobsdb-th-job-300003002968134",
    "content": "Sports & Activities AdministratorKing's College International School BangkokJob Highlights\noverseeing and managing various activities\nstrong administrative background\nPlan, schedule, and coordinate fixturesWe are seeking a dedicated and enthusiastic Sports & Activities Administrator with a strong administrative background to join our team. The coordinator will be responsible for overseeing and managing various sports and activities within the organisation, ensuring smooth logistics, coordinating fixtures and tournaments, and maintaining administrative tasks related to sports events. The successful candidate will be detail-oriented, organised, and possess excellent communication skills to liaise with stakeholders, coaches, and participants effectively.\n\nResponsibilities and Duties:\n\nFixtures/Tournaments Management:\n\nPlan, schedule, and coordinate fixtures and tournaments for various sports and activities.\nCollaborate with teams, coaches, and other institutions to organise inter-house tournaments and external competitions.\nEnsure all logistical arrangements for tournaments are in place, including venues, equipment, and referees.\n\nHouse Tournaments:\n\nFacilitate and supervise house tournaments, fostering a competitive and enjoyable environment for participants.\nCoordinate teams, schedule matches, and maintain scores and results.\n\nSwim Galas/Sports Days/Liaise with Local Stadiums:\n\nOrganise and oversee swim galas and sports days, coordinating with relevant staff, students, and parents.\nLiaise with local stadiums or sports facilities for hosting events and securing necessary permits.\n\n Administrative Tasks:\n\nMaintain an organised and up-to-date calendar of sports events and activities.\nHandle logistics, including transportation arrangements for away games or events.\nCoordinate with referees, Thai coaches, and estates personnel to ensure smooth operations during events.\nArrange catering needs for participants and spectators during tournaments.\n\n Medical & Dietary Needs:\n\nCollaborate with relevant medical staff and coaches to address medical and dietary requirements of participants.\nEnsure necessary medical personnel are available during events, if required.\n\n Equipment Management:\n\nManage sports equipment inventory, ensuring all items are in good condition and readily available for curriculum lessons, CCAs and ECAs.\nCoordinate equipment maintenance and repairs as needed and inform Head of PE and Director of Sport of any items in need of repair.\nOrder new equipment when necessary, following budget guidelines.\n\n Lesson Set-up:\n\nAssist in setting up lessons and training sessions for various sports and activities.\nEnsure all necessary materials and equipment are ready for each session.\n\n Certificate Design/Printing - PA:\n\nDesign and print certificates for participants, winners, and achievers in various sports and activities.\nPrepare and organise presentations or announcements during award ceremonies.\n\n Requirements:\n\nBachelor's degree in Sports Management, Physical Education, or a related field (preferred).\nProven experience in sports event coordination and administration.\nExcellent organisational and time-management skills.\nStrong interpersonal and communication abilities.\nAbility to work well under pressure and manage multiple tasks simultaneously.\nProficient in using computer software for scheduling, administrative tasks, and certificate design.\nKnowledge of sports rules, regulations, and best practices is desirable.\n\nThis role presents an exciting opportunity for a proactive individual to contribute to the vibrant sports culture within our organisation. If you are passionate about sports, highly organised, and excel in administrative tasks, we encourage you to apply and become a part of our dynamic team.\n\n Professionalism:\n\nTo arrive at school punctually.\nTo follow the dress code at school.\nTo uphold the image of the school both while in and out of school.\n\nQualities, Qualifications and Skills Essential:\n\nTo demonstrate our values, especially kindness, good manners and wisdom.\nA bachelor’s degree or equivalent.\nGood English and Thai oracy and literacy.\nGood numeracy skills\nThe ability to work well as part of a team.\nA friendly, professional and approachable manner with colleagues, students and parents.\nTo understand the requirement to maintain confidentiality between colleagues, students and parents.\nCompetent ICT skills.\n\nImportant Note:\n\nKing’s College International School Bangkok is fully committed to safeguarding and promoting the welfare of children and expects all staff to share this commitment. Any offer of employment will be subject to the receipt of an enhanced DBS disclosure/ICPC, a criminal records check, suitably translated if you teach outside of the UK, satisfactory references, and medical clearance.undefined"
  },
  {
    "id": "300003002968757",
    "url": "https://th.jobsdb.com/th/en/job/recruitment-and-administration-executive-%E0%B8%95%E0%B8%B4%E0%B8%94%E0%B8%9A%E0%B8%B5%E0%B8%97%E0%B8%B5%E0%B9%80%E0%B8%AD%E0%B8%AA%E0%B8%9E%E0%B8%8D%E0%B8%B2%E0%B9%84%E0%B8%97-%E0%B9%80%E0%B8%88%E0%B9%89%E0%B8%B2%E0%B8%AB%E0%B8%99%E0%B9%89%E0%B8%B2%E0%B8%97%E0%B8%B5%E0%B9%88%E0%B8%AA%E0%B8%A3%E0%B8%A3%E0%B8%AB%E0%B8%B2%E0%B8%97%E0%B8%A3%E0%B8%B1%E0%B8%9E%E0%B8%A2%E0%B8%B2%E0%B8%81%E0%B8%A3%E0%B8%9A%E0%B8%B8%E0%B8%84%E0%B8%84%E0%B8%A5%E0%B9%81%E0%B8%A5%E0%B8%B0%E0%B8%87%E0%B8%B2%E0%B8%99%E0%B8%98%E0%B8%B8%E0%B8%A3%E0%B8%81%E0%B8%B2%E0%B8%A3-300003002968757?token=0~9bd4b922-1296-4b28-b88b-7e8f8a479dd4&sectionRank=4&jobId=jobsdb-th-job-300003002968757",
    "content": "Recruitment and Administration Executive (ติดบีทีเอสพญาไท)/เจ้าหน้าที่สรรหาทรัพยากรบุคคลและงานธุรการPhenomenon EnterpriseJob Highlights\nขยันและมีบุคลิกภาพดี\nมีทักษะการสื่อสารทางโทรศัพท์\nยินดีพิจารณานักศึกษาจบใหม่ และผู้ไม่มีประสบการณ์สถานที่ทำงาน\n\nอาคารพญาไทพลาซ่า ติดบีทีเอสพญาไท/แอร์พอร์ตลิ้งค์พญาไท\n\nหน้าที่หลัก\n- สรรหาบุคลากรเข้ามาร่วมงานกับทางบริษัท ผ่านทางช่องทาง Ads ประกาศงาน/ search ผ่าน Job Ads/ ช่องทางการสมัครงานช่องทางSocial media ที่กำลังเป็นที่นิยม\n- ออกแบบ Ads ประกาศงานและโพสต์ตำแหน่งงานในช่องทาง Social media ภายใต้บัญชีของบริษัท\n- โทรติดต่อนัดหมายผู้สัมภาษณ์งานและดำเนินขั้นตอนการรับสมัครตามกระบวนการของบริษัท\n- ดูแลเอกสารการสมัครงานของผู้สัมภาษณ์และเอกสารอื่นๆ ที่เกี่ยวข้องกับบริษัท\n- ต้อนรับฝ่ายหน้า สำหรับผู้เข้ามาติดต่อบริษัท\n- หน้าที่ฝ่ายธุรการ จัดเก็บเอกสารฝ่ายขาย สนับสนุนงานฝ่ายขาย และงานเอกสารภายในบริษัท\n- ติดต่อ ประสานงานระหว่างบริษัท สำนักงานใหญ่ภายในประเทศและต่างประเทศ\n- สามารถใช้งานคอมพิวเตอร์ได้ดี เนื่องจากต้องบันทึกข้อมูลต่างๆด้วยระบบส่วนกลางของบริษัท\n- สามารถใช้โปรแกรม Excel เบื้องต้นได้\n\nคุณสมบัติ\n- วุฒิการศึกษา ปริญญาตรี ทุกสาขา(มีสอนงานให้ก่อนเริ่มงาน)\n- ขยัน กระตือรือร้น มีทักษะในการสื่อสาร ละเอียดรอบคอบ ใจเย็น และสนใจเรียนรู้ประสบการณ์ใหม่ๆ\n- สามารถใช้ภาษาอังกฤษ สื่อสาร พูดคุย เขียน อ่าน ตอบ E-mail ภาษาอังกฤษได้ดี\n- สามารถเดินทางไป ต่างจังหวัด ต่างประเทศได้\n- สามารถเข้าร่วมกิจกรรมของบริษัทได้ เช่น งานประชุม กิจกรรมภายในบริษัทหรือกิจกรรมภายนอกบริษัท\n\n\nวันหยุดธนาคาร นักขัตฤกษ์\nทำงานจันทร์-ศุกร์ เวลา 8.30-17.30 น.\nundefined"
  },
  {
    "id": "300003002968365",
    "url": "https://th.jobsdb.com/th/en/job/admin-support-%E0%B9%80%E0%B8%88%E0%B9%89%E0%B8%B2%E0%B8%AB%E0%B8%99%E0%B9%89%E0%B8%B2%E0%B8%9B%E0%B8%A3%E0%B8%B0%E0%B8%AA%E0%B8%B2%E0%B8%99%E0%B8%87%E0%B8%B2%E0%B8%99%E0%B9%80%E0%B8%AD%E0%B8%81%E0%B8%AA%E0%B8%B2%E0%B8%A3-300003002968365?token=0~9bd4b922-1296-4b28-b88b-7e8f8a479dd4&sectionRank=5&jobId=jobsdb-th-job-300003002968365",
    "content": "Admin Support/เจ้าหน้าประสานงานเอกสารTHAI ASIA EDUCATION PLUS CO., LTD.Job Highlights\nมีความรู้ทางด้านภาษาอังกฤษจะพิจารณาเป็นพิเศษ\nสามารถใช้คอมพิวเดอร์ได้\nสามารถติดตาม ประสานงานได้Admin Support\n\nสถานที่ปฏิบัติงานสีลม\n\nเวลาทำงาน09.30 – 18.00น. ( วันจันทร์–วันศุกร์ )\n\nเงินเดือน 18,000  บาทหรือตามตกลง\n\nหน้าที่ความรับผิดชอบ\n\nสามารถติดตาม ประสานงานเอกสารได้อย่างมีประสิทธิภาพ\n ให้ข้อมูลอำนวยความสะดวกและดูแลประสานงาน\n ดูแลแก้ไขปัญหาเฉพาะหน้าที่อาจเกิดขึ้นด้วยความสุภาพและเป็นกันเอง\n ติดต่อประสานงานกับฝ่ายอื่นๆ\n.Update อัพเดทข้อมูลบนเว็บ\nทำสรุปฐานข้อมูลลูกค้าในแต่ละเดือน\n\nคุณสมบัติเพิ่มเติม\n\nรักงานบริการ มีทักษะในการพูดคุยกับลูกค้า\nสามารถใช้คอมพิวเดอร์ได้\nมีความรู้ทางด้านภาษาอังกฤษจะพิจารณาเป็นพิเศษ\n\nคุณสมบัติ\n\nระดับการศึกษา : ปริญญาตรี ขึ้นไป\n\nประสบการณ์(ปี) : 1 ขึ้นไป\n\n***สนใจสมัครงานด่วน  : ติดต่อ คุณนัน id line : @hrthaiasia ส่ง Resume  ได้ทาง  Inbox เลยค่ะundefined"
  },
  {
    "id": "300003002975093",
    "url": "https://th.jobsdb.com/th/en/job/industrial-engineer-manager-%E0%B8%9C%E0%B8%B9%E0%B9%89%E0%B8%88%E0%B8%B1%E0%B8%94%E0%B8%81%E0%B8%B2%E0%B8%A3%E0%B8%A7%E0%B8%B4%E0%B8%A8%E0%B8%A7%E0%B8%81%E0%B8%A3%E0%B8%AD%E0%B8%B8%E0%B8%95%E0%B8%AA%E0%B8%B2%E0%B8%AB%E0%B8%81%E0%B8%A3%E0%B8%A3%E0%B8%A1-300003002975093?token=0~9bd4b922-1296-4b28-b88b-7e8f8a479dd4&sectionRank=6&jobId=jobsdb-th-job-300003002975093",
    "content": "Industrial Engineer Manager/ผู้จัดการวิศวกรอุตสาหกรรมFederal Electric Corp., Ltd.Job Highlights\nProcess Improvement\nIndustrial Engineering\nMachine Designรายละเอียดงาน\n\nบริหารงาน วางแผน ติดตามงานด้าน Process Improvement และงานด้าน IE ในการปรับปรุง process ในสายการผลิต ให้มีประสิทธิภาพยิ่งขึ้น โดยการใช้หลักการทางด้าน IE มาใช้ในการปรับปรุง หรือวิเคราะห์เพื่อการปรับปรุง เพื่อนำเสนอแนวทางในการปรับปรุง และผลที่ได้จากการปรับปรุง\nศึกษาการวางผังโรงงาน ผังเครื่องจักร วาง process เพื่อสายการผลิตที่เป็นโครงการใหม่\nคุณสมบัติ\n\nวุฒิปริญญาตรีขึ้นไป วิศวกรรม สาขาอุตสาหการ\nมีประสบการณ์วางแผน,บริหารงานโครงการในระบบโรงงาน 8 ปี\nมีความรู้ด้านออกแบบเครื่องจักร,ระบบ Automation\nสามารถวิเคราะห์ปัญหา และสามารถหาแนวทางในการปรับปรุงให้มีประสิทธิภาพยิ่งขึ้น\nสามารถบริหารทีมงานได้อย่างมีประสิทธิภาพundefined"
  },
  {
    "id": "300003002972354",
    "url": "https://th.jobsdb.com/th/en/job/senior-supply-chain-coordinator-300003002972354?token=0~9bd4b922-1296-4b28-b88b-7e8f8a479dd4&sectionRank=7&jobId=jobsdb-th-job-300003002972354",
    "content": "Senior Supply Chain CoordinatorAlchemy Wines and Spirits (Thailand) Co., Ltd.Job Highlights\nSupply Chain Coordinator\nGood communication of written and spoken English\nAbility to work independentlyRESPONSIBILITIES\n\nEffective stock needs planning based on sales forecast by brands.\nMonitor and control inventory and stock movement by brands.\nWork cooperatively and cross-functionally with procurement, supply chain AAS & Finance to follow up order, keep update regarding shipment, follow up with stock movement, prepare paperwork’s, arrange sample when needed.\nReporting responsibilities: Sales report analysis as requested by management.\nCoordinating with Sales team’s members, import and export, order plans, needs & delivery of goods to customers by timeline.\nSummarize stock depletion and shipment report.\nPrepare Monthly and Quarterly Brand depletion report.\nHandle the import procedures - register the labels and submit the excise code.\n\nQualifications\n\n\nBachelor’s degree in any field.\n2 years relevant working experience (logistics is preferable)\nAbility to multi-task, prioritize and manage time effectively\nEnthusiast, passionate, creative, willing to learn and like challanging;\nGood planning, team management skills.\nGood communication of written and spoken English\nExperience Microsoft office (Excel,Word,Powepoint) Especially Photoshop.\n2 years relevant working experience (logistics is preferable)\nSelf-motivated, self-initiated, passion for actions and results oriented.\nAbility to work independently and be highly organized and withstand high pressure and tight timelines.\n\nLocation : LangSuan Road ; BTS Chitlomundefined"
  },
  {
    "id": "300003002975642",
    "url": "https://th.jobsdb.com/th/en/job/sales-coordinator-300003002975642?token=0~9bd4b922-1296-4b28-b88b-7e8f8a479dd4&sectionRank=8&jobId=jobsdb-th-job-300003002975642",
    "content": "Sales CoordinatorEnwei Group Co., Ltd.Job Highlights\nปริญญาตรีด้านบริหารธุรกิจหรือสาขาอื่นที่เกี่ยวข้อง\nประสบการณ์ 2-3 ปี ในงานที่เกี่ยวข้อง\nมีทักษะด้านการติดต่อสื่อสารที่ดีJob Purpose:\nประสานงานฝ่ายขายทั้งภายในและภายนอกองค์กร รวมถึงดำเนินการเกี่ยวกับงานด้านเอกสารต่างๆ\n\nKey Responsibilities:\n\nเข้าใจในเอกสารเกี่ยวกับยาและการจัดเตรียมเอกสารเพื่อเข้าประชุมยาของแต่ละโรงพยาบาล\nดูแลรับผิดชอบและจัดเตรียมเอกสารที่เกี่ยวกับการขายทุกชนิด เช่น ใบเสนอราคา คำสั่งซื้อ จดหมายต่างๆ\nสามารถจัดเตรียม File Presentation เพื่อใช้ประกอบข้อมูลการนำเสนอการขาย\nจัดเตรียมรายงานการขายประจำวัน ประจำสัปดาห์ และประจำเดือน\nหา Supplier ในการทำอุปกรณ์/สื่อประกอบการขายต่างๆ\nทำตารางนัดหมายการประชุม จัดทำบันทึกการประชุมและรายงานต่างๆ\nSet Zoom meeting หรือ Google meet ในการจัดประชุม Online ต่างๆ\nติดต่อประสานงานกับทีมขาย ทีมที่เกี่ยวข้อง เพื่อให้การขายและการจัดส่งสินค้าเป็นด้วยความเรียบร้อย\nงานอื่นๆ ที่ได้รับมอบหมายจากหัวหน้างาน\n\nQualifications:\n\nเข้าใจในระบบการขายในช่องทางร้านขายยาและโรงพยาบาลเป็นอย่างดี\nมีทักษะในการใช้คอมพิวเตอร์ MS-Office, Excel, Power Point ได้เป็นอย่างดี\nสามารถใช้ Pivot table ได้เป็นอย่างดี\nมีความรู้ในการใช้งาน Program SAP\nมีความกระตือรือร้น ขยัน อดทน บรรลุเป้าหมาย\nมีความรับผิดชอบ เรียนรู้เร็ว\nมีมนุษย์สัมพันธ์ที่ดี มีทักษะด้านการสื่อสาร มีความรับผิดชอบ และมีแรงจูงใจในการทำงาน\nทำงานเป็นทีม\nภาษาอังกฤษอยู่ในระดับดี จะได้รับการพิจารณาเป็นพิเศษundefined"
  },
  {
    "id": "300003002972100",
    "url": "https://th.jobsdb.com/th/en/job/quality-engineer-300003002972100?token=0~9bd4b922-1296-4b28-b88b-7e8f8a479dd4&sectionRank=9&jobId=jobsdb-th-job-300003002972100",
    "content": "Quality EngineerTriumph Motorcycles (Thailand) LimitedJob Highlights\nExperiences or new graduated in Engineering fields\nAble to work in night shift (During high build)\nGood Command in EnglishDuties & Responsibilities: \n\nSupplier Quality:\n\n1. New suppliers auditing and visiting (Local & Oversea)\n2. Product development assistance\n3. ISIR processing and GI inspection standards setting\n4. Quality concern investigation (RCAP) and follow up corrective action\n\nIn-House Quality:\n\n1. New production process auditing (ATD)\n2. Quality concern investigation (ICCR) and review corrective action\n3. Assist Quality and Production staff to understand quality minimum standards\n4. Assist with QC RFT monitoring and KPI reports as requested\n\nCustomer Quality:\n\n1. Quality concern investigation (SCAR, RCAP), review corrective action and produce closing reports\n2. Clearly communicate quality concerns to QC Manager / Section Manager and other affected staff\n3. Be open-minded for identifications and implementing improvements in a practical way\n4. Communicate clearly with UK Quality & Design staff\n5. Create and maintain a positive environment of teamwork, trust and appreciation.\n6. Monitor and initiate action for cost saving.\n7. Follow company's rules and procedures.\n8. Work safely at all times and maintain 5S requirements.\n9. Any other tasks at the discretion of QC Section Manager.\n\nQualifications: \n\n1. Bachelor's degree of engineering in Industrial or Mechanical or related fields, new graduate is welcomed. \n2. Have 1-3 years' experiences in quality field in automotive industry will be advantage. \n3. Able to read and understand GD&T from engineering drawings.\n4. Familiar with basic measuring equipment (e.g. Vernier caliper, Micrometer, Thread gauge.)\n5. Able to use Auto CAD and gear profile software.\n6. Good in problem solving skill.\n7. Good command in English both writing and speaking.\n8. Have experiences in quality field in automotive industry will be advantage. \n9. Able to work in night shift. (for Quality base at Factory 5, F3 & F4 day shift only.)\n\nWorking Day: Monday - Friday 08:00 - 17:00 \n\n The company will provide very good salary and fringe benefits to the right candidate. \nIf you would like to join a dynamic British company that is firmly established in Thailand, please send your application to:- \n\nHuman Resources Department\nTriumph Motorcycles (Thailand) Ltd.\nAmata City Chonburi Industrial Estate,\n700/801, Moo 1, Tambon Panthong,\nAmphur Panthong, Chonburi 20160 \nTel: 0-3846-9800  ext. 5446undefined"
  },
  {
    "id": "300003002964304",
    "url": "https://th.jobsdb.com/th/en/job/content-moderator-thai-speaking-300003002964304?token=0~9bd4b922-1296-4b28-b88b-7e8f8a479dd4&sectionRank=10&jobId=jobsdb-th-job-300003002964304",
    "content": "Content Moderator - Thai SpeakingTELEPERFORMANCE (THAILAND) CO., LTD.Job Highlights\nPremium Workspaces\nTraining provided with Career Development\nNearby to Public Transportob Details\n\nJob Title: Content Moderator - Thai + English\nLocation: Huai Khwang, Bangkok, Thailand\nShift: 5 working days (Rotational Shift)\n\nJob Overview:\n\nResponsible for reviewing content of a graphic nature, and enforcing policy decisions related to content, handling sensitive and complex issues faced by users to protect the platform and keep them safe; demonstrate ethics and genuine skill in restraint by applying policies correctly and ensuring quality, intellectual property, privacy, and online safety.\n\nResponsibilities:\n\nEnsure received content adheres to program community guidelines.\nMeet program-defined performance indicators.\nEvaluate and manage sensitive user-generated content according to client parameters. Handle calls, log events, and escalate as needed.\nInvestigate and escalate urgent issues following established procedures.\nUphold corporate confidentiality policies for data security.\nEngage in ongoing company training for role development.\nUse assigned tools effectively.\nFollow all relevant role-related orders, instructions, and procedures.\nStay attentive to company communications across various channels.\n\nRequirements:\n\nFluent Thai language proficiency at B2 in English (1-2 years of content moderation experience preferred).\nStrong empathy is required for handling sensitive cases.\nHigh Emotional Quotient, including empathetic skills for supporting individuals with sensitive issues.\nSkilled in investigation, information validation, and analysis across various data sources, facilitating efficient escalations and knowledge sharing.\nProficient at prioritizing tasks in a fast-paced setting, open to feedback and coaching, with a wellness-oriented mindset.\nDemonstrates continuous curiosity for learning and self-improvement, actively engages in training, team meetings, and client programs\n\n\n\nWhy join us?\n\nLooking for a company that puts the \"fun\" in \"work\"? We believe that work should be enjoyable and rewarding, which is why we strive to create a positive and supportive environment for our employees.\n\nOur team is made up of talented and enthusiastic individuals who are passionate about what they do. We're always on the lookout for more awesome people to join us, and we're committed to building a diverse and inclusive team. Whether you're just starting out in your career or you're an experienced professional, we welcome anyone with big ambitions and a great attitude.\n\nAt Teleperformance, we understand that our employees are our greatest asset, which is why we offer a range of benefits to ensure that they feel valued and supported. Our benefits package includes Medical Insurance, paid vacation and sick leave and plenty of opportunities for learning and development. We believe in investing in our employees' futures, and we're committed to helping them grow and succeed.\n\nSo if you're looking for a company where you can have fun, be yourself, and achieve your goals, Teleperformance is the place for you. Join us today and see for yourself why we're one of the best companies to work for!\n\nClick on apply now and let’s have a conversation.undefined"
  },
  {
    "id": "300003002975108",
    "url": "https://th.jobsdb.com/th/en/job/customer-science-analyst-scg-packaging-300003002975108?token=0~9bd4b922-1296-4b28-b88b-7e8f8a479dd4&sectionRank=11&jobId=jobsdb-th-job-300003002975108",
    "content": "Customer Science Analyst - SCG PackagingThe Siam Cement Public Company Limited (SCG)Job Highlights\nตรี สถิติ, ECON, บริหารธุรกิจ, การตลาด\nงานวิเคราะห์ทิศทางการตลาดและภาพอุตสากรรม\nติดตามและจัดทำสรุปรายงานResponsibility\n\nวิเคราะห์ภาพอุตสาหกรรมเชิงลึก แนวโน้ม และทิศทางตลาดในอุตสาหกรรมที่เกี่ยวข้องทั้งในประเทศและต่างประเทศ\nวิเคราะห์และประมวลผล เชื่อมโยงข้อมูลทางการตลาด, อุตสาหกรรม และพฤติกรรมลูกค้าและผู้บริโภคอย่างมีประสิทธิภาพ\nประเมินโอกาสทางธุรกิจของบริษัทฯ  รวมถึงวิเคราะห์และจัดทำข้อมูลสำหรับวางแผนกลยุทธ์ Annual Plan และ Medium Term Plan\nจัดทำประมาณการขายในระยะเวลา 18 เดือนล่วงหน้า ให้เห็นภาพของธุรกิจในระยะกลาง และ rolling sales plan ให้ใกล้เคียงการขายตามสภาวการณ์ที่เปลี่ยนแปลงไป\nติดตามและจัดทำสรุปรายงานการขาย, รายงานการตลาด, ความเคลื่อนไหวของลูกค้า คู่แข่งขัน รวมถึงข้อมูลทางการตลาดต่างๆ เพื่อให้ผู้บริหารใช้วิเคราะห์และประกอบการตัดสินใจ\n\nQualification\n\nปริญญาตรี สาขา บริหารธุรกิจ สถิติประยุกต์ เศรษฐศาสตร์ การตลาด Data Analytic หรืออื่นๆที่เกี่ยวข้อง (G.P.A. > 2.70)\nมีทักษะภาษาอังกฤษ (TOEIC > 550)\nมีทักษะการใช้งานโปรแกรม Statistic, Marketing, Database Software (e.g. Access or SQL), Data Visualization (e.g. Power BI, Tableau), Data Analysis Tool (e.g. Excel, SPSS)\nมีทักษะวิเคราะห์แก้ไขปัญหา พิจารณาและตัดสินใจในงานได้ดี\nมีทักษะการประสานงานที่ดี มนุษยสัมพันธ์ดี\nมี Positive & Can do Attitude\nทำงานภายใต้สภาวะกดดันได้ดี\nยินดีรับนักศึกษาจบใหม่undefined"
  },
  {
    "id": "300003002968808",
    "url": "https://th.jobsdb.com/th/en/job/personal-assistant-to-the-managing-director-and-ceo-300003002968808?token=0~9bd4b922-1296-4b28-b88b-7e8f8a479dd4&sectionRank=12&jobId=jobsdb-th-job-300003002968808",
    "content": "Personal Assistant to the Managing Director and CEOSawasdeeshop Co., Ltd.Job Highlights\nDetail-oriented with strong organizational.\nGood command of spoken and written English.\nmultitasking skill and good communication skill.Job Description:\nManage the day-to-day operations of the residence of Managing Director and CEO, ensuring seamless coordination among domestic staff, including housekeepers, chefs, and drivers, to uphold a comfortable and efficiently organized environment.\nCoordinate and facilitate personalized services to meet individual requirements, encompassing transportation, lodging, personal care, dining and entertainment, and leisure activities, with a commitment to delivering the utmost level of service excellence in every aspect.\nAccompany to Managing Director and CEO and/or family members where necessary to ensure their safety and security in various environments, including public appearances, work, and travels (inclusive of Business and Personal agendas)\nServe as central liaison with various stakeholders both internal and external to the organization, encompassing but not limited to Executives, Head of Business Units, and Employees\nDirect relevant service provider(s) to deliver personalized service to meet the unique preferences and needs of Managing Director and CEO and/or family members by anticipating and fulfilling requests promptly.\nJob Requirements\n\nAt least 2+ years of experience in Personal Assistant, Concierge, Guest Service, or other roles in Hospitality is preferred.\nBachelor's degree in any field. Hospitality Management or a related field is a plus.\nDetail-oriented with strong organizational and time management skills.\nGood verbal and written communication in English and Thai. undefined"
  },
  {
    "id": "300003002972345",
    "url": "https://th.jobsdb.com/th/en/job/production-engineering-300003002972345?token=0~9bd4b922-1296-4b28-b88b-7e8f8a479dd4&sectionRank=13&jobId=jobsdb-th-job-300003002972345",
    "content": "Production EngineeringThai Honda Manufacturing Co., Ltd.Job Highlights\nElectrical Engineering\nProduction Engineering\nGood command of English. (TOEIC score 500 up)Job Description:\n\nPlanning the strategy of production line to support yearly plan.\nAnalyze and summary report of problem that occur in production line.\nCreate a structure of production line to support production plan.\nDrawing and design lay-out and process management to support production line.\nAnalyze the problems of machine and modify problem machine.\nAnalyze summary report of machinery problem and planning the solution for improvement.\nQualification:\nBachelor degree in Electrical, Electronics Engineering or related fields.\nBasic communication in Japanese is an advantage.\nGood command of English. (TOEIC score 500 up)\nProficiency and expertise in using MS office Tools. (Word, Excel, PowerPoint), Auto CAD, 3D Sketchup and Solid works.\nHave experience to drawing and design production lay-out and production process management.\nHave knowledge in electrical system of industrial plant machinery\nAble to join in teams work and work under pressure.undefined"
  },
  {
    "id": "300003002964708",
    "url": "https://th.jobsdb.com/th/en/job/admin-officer-300003002964708?token=0~9bd4b922-1296-4b28-b88b-7e8f8a479dd4&sectionRank=14&jobId=jobsdb-th-job-300003002964708",
    "content": "Admin OfficerSamitivej Chonburi Co., Ltd.Job Highlights\nAt least 1 year of experience in secretary/admin\nProficient in english.\nBachelor’s degree in related fieldsQualifications:\nBachelor’s degree in related fields.\nAt least 1 year of experience in secretary or administrative.\nUnderstanding of management processes and company operations.\nGood in written and verbal communication skills.\nAbility to manage documents and prepare reports effectively.\nTeam player and able to work with diverse teams and personnel.\nProficient in english.undefined"
  },
  {
    "id": "300003002972334",
    "url": "https://th.jobsdb.com/th/en/job/purchaser-admin-purchasing-admin-fresh-graduates-are-welcome-%E0%B9%80%E0%B8%88%E0%B9%89%E0%B8%B2%E0%B8%AB%E0%B8%99%E0%B9%89%E0%B8%B2%E0%B8%97%E0%B8%B5%E0%B9%88%E0%B8%9D%E0%B9%88%E0%B8%B2%E0%B8%A2%E0%B8%88%E0%B8%B1%E0%B8%94%E0%B8%8B%E0%B8%B7%E0%B9%89%E0%B8%AD%E0%B9%81%E0%B8%A5%E0%B8%B0%E0%B8%88%E0%B8%B1%E0%B8%94%E0%B8%81%E0%B8%B2%E0%B8%A3-%E0%B8%A2%E0%B8%B4%E0%B8%99%E0%B8%94%E0%B8%B5%E0%B8%A3%E0%B8%B1%E0%B8%9A%E0%B8%99%E0%B8%B1%E0%B8%81%E0%B8%A8%E0%B8%B6%E0%B8%81%E0%B8%A9%E0%B8%B2%E0%B8%88%E0%B8%9A%E0%B9%83%E0%B8%AB%E0%B8%A1%E0%B9%88-300003002972334?token=0~9bd4b922-1296-4b28-b88b-7e8f8a479dd4&sectionRank=15&jobId=jobsdb-th-job-300003002972334",
    "content": "Purchaser Admin/ Purchasing Admin (Fresh Graduates Are Welcome)/เจ้าหน้าที่ฝ่ายจัดซื้อและจัดการ (ยินดีรับนักศึกษาจบใหม่)Bonjour Fusion Co., Ltd.Job Highlights\nร้านอาหารตั้งอยู่ระหว่าง BTS ทองหล่อและ BTS เอกมัย\nวันหยุดประจำสัปดาห์ 2 วันต่อสัปดาห์ มีลาพักร้อน\nPerformance Bonus, ค่าอาหารกลางวันJob Descriptions\n\nรับผิดชอบ การจัดซื้อและจัดจ้างสินค้าบริการต่างๆ พร้อมทำการวิเคราะห์รวบรวมข้อมูลสินค้าให้ได้คุณภาพครบถ้วน ถูกต้อง และทันเวลา รวมทั้งราคาที่เหมาะสม ให้สอดคล้องกับงบประมาณที่ตั้งไว้ของฝ่าย / แผนกที่ขอจัดซื้อ และจัดจ้างนั้น ๆ\nQualifications\n\nSkill: คอมพิวเตอร์ธุรกิจ ทักษะภาษาอังกฤษ ทักษะในการเจรจาต่อรอง ทักษะที่จำเป็น\nมีความละเอียดรอบคอบ มีมนุษยสัมพันธ์ พร้อมทั้งมีพื้นฐานความเข้าใจเกี่ยวกับการทำงานร่วมกันเป็นทีม\nวันหยุดประจำสัปดาห์ 2 วันต่อสัปดาห์ มีลาพักร้อนเพิ่มเติมให้\nยินดีรับนักศึกษาจบใหม่\nBenefits\nวันหยุดประจำสัปดาห์ 2 วันต่อสัปดาห์\nปรับเงินเดือนตาม Performance\nวันลาพักร้อน\nประกันสังคม\nค่าอาหารกลางวัน\nโบนัสตามผลประกอบการ\nสถานที่ทำงาน\nร้านอาหารตั้งอยู่ระหว่าง BTS ทองหล่อ และ BTS เอกมัย เดินทางสะดวกundefined"
  },
  {
    "id": "300003002940677",
    "url": "https://th.jobsdb.com/th/en/job/central-procurement-officer-able-to-work-in-upcountry-300003002940677?token=0~9bd4b922-1296-4b28-b88b-7e8f8a479dd4&sectionRank=16&jobId=jobsdb-th-job-300003002940677",
    "content": "Central Procurement Officer (Able to work in upcountry)Gulf Energy Development Public Company LimitedJob Highlights\nDeveloping an audit program\nReviewing the adequacy and effectiveness\nDevelop an annual audit plan by risk-basedJob Responsibilities:\n\nEvaluating and with suppliers before making purchase decisions.\nComparing supplier’s potential and use a cost-benefit analysis.\nNegotiating with suppliers to meet the company’s target.\nWorking out the logistical details with suppliers for delivery in time.\nMaintaining, monitor and update meticulous records of each purchase.\nUpdating networking and staying on top of industry trends.\nJob Qualifications:\nBachelor's degree or higher in Business Administrations, Engineering, SCM or related field.\nMinimum 2 years’ experience in purchasing, supply chain or related field. \nExperience in SAP would be an advantage.\nTo be proactive with good personality, able to work under pressure and possess good communication skill.\nAbility to use MS Office.\nMinimum 500 TOEIC score.\nGoal–Oriented, Unity, Learning, Flexible.\n\nInterested person, please submit your resume via online system: click \"APPLY NOW\"\n\nAll applications will be strictly confidential, and will be kept for at least 1 year. Only shortlist candidates will be notified.\n\nGulf Energy Development Public Company Limited\n11th Fl., M Thai Tower, All Seasons Place,\n87 Wireless Rd., Lumpini, Pathumwan, Bangkok 10330\n\nWebsite: www.gulf.co.thundefined"
  },
  {
    "id": "300003002972808",
    "url": "https://th.jobsdb.com/th/en/job/personal-assistant-300003002972808?token=0~9bd4b922-1296-4b28-b88b-7e8f8a479dd4&sectionRank=17&jobId=jobsdb-th-job-300003002972808",
    "content": "Personal AssistantSmooth E Co., Ltd.Job Highlights\nติดต่อประสานงาน, เข้าประชุม, ทำรายงาน\nมีประสบการณ์ในงาน Personal Assistant 2 ปี\nมีทักษะในการวางแผน การจัดการและการประสานงานหน้าที่ความรับผิดชอบ:\n\nติดต่อประสานงาน ภายในและภายนอกองค์กร\nเข้าประชุม ทำสรุป และทำรายงานการประชุม\nทำนัด จัดตาราง และติตตามผู้บริหาร\nช่วยเหลือสนับสนุนงานของผู้บริหาร ให้สำเร็จลุล่วงตามที่ได้รับหมอบหมาย\nส่งเสริม และรักษาภาพลักษณ์ของผู้บริหาร\n\nคุณสมบัติ:\n\nจบการศึกษาระดับปริญญาตรีขึ้นไป สาขาบริหารธุรกิจ การตลาด หรือสาขาอื่นๆ ที่เกี่ยวข้อง\nยินดีรับนักศึกษาจบใหม่\nมีประสบการณ์ในงาน Personal Assistant  ไม่น้อยกว่า 2  ปี\nสามารถใช้โปรแกรมคอมพิวเตอร์ MS Office และทำสื่อนำเสนอได้ดี (pptx), ชอบเทคโนโลยี\nมีทักษะในการวางแผน การจัดการและการประสานงาน \n\nSmooth E Co., Ltd.\nSmooth Life Tower 44 North Sathorn Rd., Silom\nBangrak, Bangkok Thailand 10500\nTel. 08-5489-0574 (ในวันและเวลาทำการ)undefined"
  },
  {
    "id": "300003002975008",
    "url": "https://th.jobsdb.com/th/en/job/receptionist-and-administrator-300003002975008?token=0~9bd4b922-1296-4b28-b88b-7e8f8a479dd4&sectionRank=18&jobId=jobsdb-th-job-300003002975008",
    "content": "Receptionist and AdministratorSerendipity Media Co., Ltd.Job Highlights\nFront desk tasks\nAdministrator and Receptionist\nCoordinatorQualifications:\n\nBachelor’s Degree in related field.\nAge not over 25 years old.\nAt least 0-1 year experience in receptionist, administration, coordination, or related field.\nThe ability to work in a fast-paced environment.\nThe ability to handle multiple projects concurrently.\nGood interpersonal skills with a service-minded nature and outgoing personality.\nGood organization skills.\nProficiency in PC (Microsoft Office, Internet, and Website)\nGood command in English.\nResponsibility;\n\nProvide front desk tasks, greet and welcome company guests, customers, and suppliers including phone calls.\nProvide basic and accurate information in-person and via phone/email.\nManaging the company’s general administrative activities (office supply, housekeeping, IT outsourcing, employee's Car, meeting room etc)\nResponsible for the management of company assets, maintaining office equipment and facilities in good working condition, and office supplies procurement.\nCoordinate with external vendors to maintain office and facility equipment such as air-conditioned, printer etc.\nProvide database for office's assets (Notebook, Stationary,etc)\nAssisting with manager and employee as needed to ensure smooth and efficient daily operation.\n\n\nEmail: hr[at sign]serendipity.co.th\nor Click Apply Now.\nImportant: Please attach your updated resume and salary expectations.\n\n\nSerendipity Media Co., Ltd.\nAddress : 4.4/5 Zen World, 12MFloor, Room No. 12M10-13, Rajadamri Road, Pathumwan, Bangkok 10330\nPhone : 0-2658-6530     Fax : 0-2658-6515\nWebsite: www.vogue.co.th     www.gqthailand.comundefined"
  },
  {
    "id": "300003002974991",
    "url": "https://th.jobsdb.com/th/en/job/sales-coordinator-%E0%B9%80%E0%B8%88%E0%B9%89%E0%B8%B2%E0%B8%AB%E0%B8%99%E0%B9%89%E0%B8%B2%E0%B8%97%E0%B8%B5%E0%B9%88%E0%B8%9B%E0%B8%A3%E0%B8%B0%E0%B8%AA%E0%B8%B2%E0%B8%99%E0%B8%87%E0%B8%B2%E0%B8%99%E0%B8%82%E0%B8%B2%E0%B8%A2-300003002974991?token=0~9bd4b922-1296-4b28-b88b-7e8f8a479dd4&sectionRank=19&jobId=jobsdb-th-job-300003002974991",
    "content": "Sales Coordinator/เจ้าหน้าที่ประสานงานขายFabric Systems Co., Ltd.Job Highlights\nA new graduate are welcome\n22K-25K\n5 days working- Deal directly with customer for gathering all information related to their orders\n\n- Support Sales Representative for all document and other issue about sales work\n\n- Deliver customer’s requirement to production team especially Graphic Team\n\n- Monitor and control the timeline of orders to hit the target\n\n- Follow up with customer for after sales service and in case of any claim issues\n\n\n\nJob Requirements:\n\nBachelor's Degree or higher in any field\nMinimum 1-2 years in sales co-ordinator in related filed, preferablyworking or selling to Advertising ,Event / Exhibition, Architectural, Printing industries is a plus. Anyway, we're also welcome the new graduate, please don't hesitate to send your CVs\nExcellent communication, interpersonal, and problem-solving skills\nGoal-oriented, highly motivated, and good under pressure\nAbility to multitask, prioritize and manage time efficiently\nPersuasive and goal-oriented\nGood command in English and Thaiundefined"
  },
  {
    "id": "300003002964264",
    "url": "https://th.jobsdb.com/th/en/job/project-coordinator-administrative-officer-%E0%B9%80%E0%B8%88%E0%B9%89%E0%B8%B2%E0%B8%AB%E0%B8%99%E0%B9%89%E0%B8%B2%E0%B8%97%E0%B8%B5%E0%B9%88%E0%B8%9B%E0%B8%A3%E0%B8%B0%E0%B8%AA%E0%B8%B2%E0%B8%99%E0%B8%87%E0%B8%B2%E0%B8%99%E0%B9%81%E0%B8%A5%E0%B8%B0%E0%B8%98%E0%B8%B8%E0%B8%A3%E0%B8%81%E0%B8%B2%E0%B8%A3%E0%B9%82%E0%B8%84%E0%B8%A3%E0%B8%87%E0%B8%81%E0%B8%B2%E0%B8%A3-300003002964264?token=0~9bd4b922-1296-4b28-b88b-7e8f8a479dd4&sectionRank=20&jobId=jobsdb-th-job-300003002964264",
    "content": "Project Coordinator / Administrative Officer/เจ้าหน้าที่ประสานงานและธุรการโครงการCenter of Excellence on Hazardous Substance ManagementJob Highlights\nปริญญาโท สาขาบริหารธุรกิจ หรือด้านสิ่งแวดล้อม\nมีทักษะในการประสานงาน และมีประสบการณ์ทำงาน 2-3 ปี\nทำงาน 5 วันต่อสัปดาห์หน้าที่ความรับผิดชอบ\n\nจัดทำเอกสารต่างๆ ของโครงการ เช่น จดหมายเชิญประชุม รายงานผลการดำเนินงาน เอกสารเผยแพร่/ประชาสัมพันธ์\nติดต่อประสานงาน จัดประชุม สัมมนา จัดทำรายงานการประชุม และอื่นๆ ที่เกี่ยวข้อง\nติดตามรายงานผลการดำเนินงานกับผู้ที่เกี่ยวข้อง\nจัดเตรียมและนำเสนอข้อมูล รายงานการประชุม แก่คณะทำงาน\nรวบรวมและจัดเก็บเอกสาร ข้อมูลทั้งหมดของโครงการอย่างเป็นระบบ\nงานด้านธุรการ การเงิน และดูแลงบประมาณและการเบิกจ่ายค่าใช้จ่ายให้เป็นไปตามแผนงาน\nปฏิบัติงานอื่นๆ ที่ได้รับมอบหมาย\nคุณสมบัติผู้สมัคร\n\nสำเร็จการศึกษาระดับปริญญาโท สาขาบริหารธุรกิจ หรือสาขาวิทยาศาสตร์/วิศวกรรมศาสตร์ ด้านสิ่งแวดล้อม หรือที่เกี่ยวข้อง\nมีทักษะในการประสานงาน และมีประสบการณ์ทำงาน 2-3 ปี หากมีความรู้เกี่ยวกับการจัดการของเสียจะได้รับการพิจารณาเป็นพิเศษ\nสามารถใช้โปรแกรมคอมพิวเตอร์พื้นฐานได้ดี เช่น MS-Excel MS-Word MS-PPT และ Canva\nสามารถ ฟัง พูด อ่าน เขียน ภาษาไทยและภาษาอังกฤษได้ดี\nมีความกระตือรือร้น สามารถบริหารจัดการเวลาในการทำงานได้ และทำงานภายใต้ภาวะกดดันได้ดี\nสามารถทำงานเป็นทีมได้ และมีความพร้อมที่จะเรียนรู้สิ่งใหม่ๆ\nหากมีประสบการณ์ในการทำงานด้านธุรการ หรือประสานงานกับหน่วยงานภาครัฐและเอกชนจะพิจารณาเป็นพิเศษundefined"
  },
  {
    "id": "300003002972671",
    "url": "https://th.jobsdb.com/th/en/job/change-management-lead-spx-express-300003002972671?token=0~9bd4b922-1296-4b28-b88b-7e8f8a479dd4&sectionRank=21&jobId=jobsdb-th-job-300003002972671",
    "content": "Change Management Lead (SPX Express)Shopee (Thailand) Co., Ltd.Job Highlights\nFP&A\nProject Management\nDevelop end-to-end SOPResponsibilities\n\n\nResponsible for the coordination and completion of projects/programs on Operational Costing Automation (incentive, billing, etc).\nOversees all aspects of projects. Work with management to assign key stakeholders / project members and ensure deliverable meets stakeholders’ expectations; Coordinate with Operations / Operations Excellence to ensure project meets business objectives\nStructural phasing of project implementation and track progression, prioritization, deliverables\nEffectively manage project resources within FP&A and peers to timely serve project tasks\nAddress pain points, manage all roadblocks, and coordinate cross-function to conclude decision on project timeline, project scope, and cost\nSuccessfully navigate the change, solve problems, and consult with cross-functional teams\nDevelop end-to-end SOP by engaging all cross functional team, facilitate SOP training & alignment to ensure SOP rollout successfully\nQualifications\n\n\nBachelor's Degree or higher in Engineering, Project Management, Finance, Accounting or related field required\nStrong attention to detail, data driven, and be able to manage project following standard tasks and timelines\nExcellent in leadership and interpersonal skills. Be able to motivate, effectively dialogue and resolve roadblocks. Having negotiating skills, leading teams, and managing projects across multiple teams\nCan-do attitude, consistent record of successfully work in a fast-paced, high-energy and -diversity environment\nExcellent presentation skills, proficient in spoken and written English\nProficient in project management methodologies. Project Management Professional (PMP) certification or formal training in project management is beneficial Logistics industry experience and/or 3 years’ project management experience. Project finances will be preferableundefined"
  },
  {
    "id": "300003002968411",
    "url": "https://th.jobsdb.com/th/en/job/inventory-control-300003002968411?token=0~9bd4b922-1296-4b28-b88b-7e8f8a479dd4&sectionRank=22&jobId=jobsdb-th-job-300003002968411",
    "content": "Inventory ControlAutoliv (Thailand) Ltd.Job Highlights\ninventory control/ data analysis/ warehousing\nMRP, inventory control system\ncycle count process and analysis, finished goodsResponsibility :-\n\nIdentify errors in accuracy of on hand inventory and finished goods\nIdentify cause of errors in accuracy\nMake inventory corrections as needed\nReceived material both of import & Local parts\nCycle counted process and analysis before adjustment in the system\nReceived all non stock items for all section to order\nSolve problem inventory missing\nEnsure transaction into the system\nAs a team for physical count\n\nCandidate Qualifications :-\n\nBachelor’s Degree or higher in Business Administration, Sciences, Accounting ,Finance or any related field\n3 years of Experience in inventory control.\nGood understanding of basic MRP fundamentals\nUnderstanding on ISO system to relate with inventory control system\nBe able to communicate in English.\n\nPlease send your applications together with a comprehensive resume ,expected salary and resent photo to:\n\nHUMAN RESOURCES DEPARTMENT AUTOLIV (THAILAND) LTD.700/415 Moo7 Tambon Donhualoh, Amphure Muang,Chonburi 20000Tel.038-456000 \nContact Us : https://lin.ee/myWuOYpInterested person please send your full resume in English in MS. Word only, not accept quick apply\"undefined"
  },
  {
    "id": "300003002972771",
    "url": "https://th.jobsdb.com/th/en/job/customer-enquiries-account-receivable-english-thai-speaking-thai-national-only-300003002972771?token=0~9bd4b922-1296-4b28-b88b-7e8f8a479dd4&sectionRank=23&jobId=jobsdb-th-job-300003002972771",
    "content": "Customer Enquiries & Account Receivable (English & Thai Speaking) - Thai National onlyHCLTechJob Highlights\nCustomer services skills\nAccount Receivable and Order to cash supports\nOffice operation with good English communication** To support Oil & Gas company **\n\n\n\nResponsibilities:\n\nAttend customer calls, emails chat\nAttend customer requests such as; checking product availability for a certain point in time, order status, request for a price quotation, request for information about account status and outstanding payments, and request an account statement, a copy of an invoice, or delivery document.\nCoordinate other departments such as Order management, collections dispute, and cash application team to resolve a customer inquiry.\nAdhere to TAT and currency and manage queues and inquiries as per agreed metrics.\nReport out daily performance and update all performance and update all performance logs abilities.\nManage Account Receivable including jobs order as required\n\nQualification :\n\nGood communication skills with good command in English\n Good analytical skills and problem-solving\n Good listening and comprehension abilities\n Multitasking and ability to coordinate with multiple stakeholders\nImmediate joiner will be strongly considered for the role\n\nundefined"
  },
  {
    "id": "300003002964676",
    "url": "https://th.jobsdb.com/th/en/job/omni-channel-executive-scg-packaging-300003002964676?token=0~9bd4b922-1296-4b28-b88b-7e8f8a479dd4&sectionRank=24&jobId=jobsdb-th-job-300003002964676",
    "content": "Omni Channel Executive - SCG PackagingThe Siam Cement Public Company Limited (SCG)Job Highlights\nฺตรี สาขา บริหารธุรกิจ เศรษฐศาสตร์ การตลาด\nTOEIC > 550\nบริหารร้านค้าออนไลน์/ คิดโปรโมชั่นส่งเสริมงานขายJob Summary:\nบริหารจัดการและดูแลรับผิดชอบการขายสินค้าผ่านร้านค้าออนไลน์บน platform eMarket place และ Social commerce ของสินค้า การดาษถ่ายเอกสารไอเดียบรรจุภัณฑ์อาหาร Fest และสินค้า consumer products ภายใต้ร้าน SCGP Healthcare\n \nResponsibilities:\nบริหารจัดการร้านค้าออนไลน์ให้น่าสนใจ สื่อสาร products benefit ให้ตรงกลุ่มเป้าหมาย กรอกรายละเอียดสินค้าและรูปภาพให้น่าสนใจ ชัดเจน พร้อมกรอกราคาขายสินค้า, Slot Flash sales และดูแลสต๊อกการขายบนร้านค้าออนไลน์ \nวิเคราะห์พฤติกรรมลูกค้า และโปรโมชั่นส่งเสริมการขาย เพื่อสร้างยอดขาย และ Online shop engagement\nคิดโปรโมชั่นส่งเสริมการขายผ่านการทำ Sales promotion และ Join platform campaign เพื่อผลักดันยอดขายสินค้า\nStock management เพื่อให้เพียงพอต่อการขายและเตรียมพร้อมสำหรับ Monthly campaign โดยการประสานงานกับหน่วยงานอื่นๆ ที่เกี่ยวข้อง\nQualifications:\nปริญญาตรี สาขา บริหารธุรกิจ เศรษฐศาสตร์ การตลาด และอื่นๆที่เกี่ยวข้อง (G.P.A. > 2.70)\nมีทักษะภาษาอังกฤษ (TOEIC > 550)\nสามารถใช้โปรแกรม MS Office ได้เป็นอย่างดี\nมีประสบการณ์ด้านการบริหารจัดการร้านค้าออนไลน์จะพิจารณาเป็นพิเศษ\nมีความรับผิดชอบ  มีทัศนคติที่ดี และมนุษย์สัมพันธ์ดี \nทำงานรวดเร็ว มีความละเอียดรอบคอบ และมี Winning Mindset\nเข้าใจระบบหลังบ้านของ eMarket place และ Social commerce, Search Engine Optimization(SEO), Paid Ads, Collaborative Performance Advertising Solution (CPAS) \n undefined"
  },
  {
    "id": "300003002972391",
    "url": "https://th.jobsdb.com/th/en/job/personal-assistant-for-ceo-%E0%B8%9C%E0%B8%B9%E0%B9%89%E0%B8%8A%E0%B9%88%E0%B8%A7%E0%B8%A2%E0%B8%9C%E0%B8%B9%E0%B9%89%E0%B8%9A%E0%B8%A3%E0%B8%B4%E0%B8%AB%E0%B8%B2%E0%B8%A3-300003002972391?token=0~9bd4b922-1296-4b28-b88b-7e8f8a479dd4&sectionRank=25&jobId=jobsdb-th-job-300003002972391",
    "content": "Personal Assistant for CEO/ผู้ช่วยผู้บริหารบริษัท รวยยั่งยืน59 จำกัดJob Highlights\nมีโอกาสในการเติบโต เลื่อนขั้นเลื่อนตำแหน่ง\nประสบการณ์การทำงานไม่ต่ำกว่า 3 ปี\nใช้ภาษาอังกฤษเบื้องต้นได้หน้าที่ความรับผิดชอบ\nจัดการงานทั้งในบริษัทและเรื่องส่วนตัวของผู้บริหาร\nจัดการ การประสานงานทั้งในและนอกบริษัท\nจัดเอกสาร เตรียมเอกสาร ทั้งเรื่องบริษัทและเรื่องส่วนตัว\nนำเสนอ และออกความคิดเห็นกับผู้บริหารในทางที่ดี\nคุณสมบัติ \nใช้ภาษาอังกฤษเบื้องต้นได้ \n ประสบการณ์การทำงานไม่ต่ำกว่า 3 ปี \nวุฒิการศึกษา ปริญญาตรี ขึ้นไป \nมีรถยนต์ส่วนตัว \nสามารถเดินทางระหว่างบ้านผู้บริหาร (พระราม 3) กับบริษัทได้\nรักษาความลับบริษัทได้อย่างดี\nบุคลิกภาพดี แต่งตัวสุภาพเรียบร้อย \nกล้างแสดงออก สามารถเจรจาได้ \nกล้าแสดงความคิดเห็น กล้าตัดสินใจในทางที่เหมาะสม \nมีความรับผิดชอบในหน้าที่ และ บทบาทที่ได้รับ \nมีความคิดสร้างสรรค์ \nอัธยาศัยดี ร่าเริงแจ่มใส เข้ากับคนได้ง่าย \nมีความอดทน ขยัน \nเรียนรู้ และ เข้าใจงานได้เป็นอย่างดี \nพร้อมเรียนรู้ และ พัฒนาอยู่เสมอ \nมีความพร้อมในงาน การเดินทางต่างจังหวัด และ ต่างประเทศ \nมีความเข้าใจในงานบริหาร \nมีความกระฉับกระเฉง \nตรงต่อเวลา \n\nสวัสดิการ:\n\nประกันสังคม \nโบนัสสิ้นปี  \nค่าเดินทาง \nวันหยุดประจำเดือน  \nวันหยุดนักขัตฤกษ์  \nพักร้อน ลาป่วย ลากิจundefined"
  }
]