[
  {
    "id": "2deew4QZteZITtr9pe7spQ",
    "url": "https://th.linkedin.com/jobs/view/country-manager-thailand-at-van-cleef-arpels-3774161196?refId=mrxTSrR0PRyWkRBTKNb3NA%3D%3D&trackingId=2deew4QZteZITtr9pe7spQ%3D%3D&position=1&pageNum=0&trk=public_jobs_jserp-result_search-card",
    "content": "Country Manager, Thailand\nVan Cleef & Arpels  กรุงเทพมหานคร\n22 ชั่วโมงก่อน  ผู้สมัคร 54 คน\n  \nดูบุคคลที่ Van Cleef & Arpels ได้ว่าจ้างสำหรับตำแหน่งนี้\nสมัคร \nบันทึกAt Van Cleef & Arpels, we are proud to employ talents from many different backgrounds, experiences and identities. We believe that when diversity and inclusion are fully embraced and empowered, creativity and knowledge emerge to deliver excellence.\n\nAre you a good match?\n\nYou have an extensive experience in the luxury retail industry.\n\nYou are a business leader with commercial skills and field knowledge.\n\nYou are self-driven and client focus.\n\nYou demonstrate exceptional people management skills, able to inspire and develop your team.\n\nYou have a passion for High Jewelry, Art & Culture.\n\nYou are fluent in English.\n\nWhat are we expecting from you?\n\n\nA key player of the Van Cleef & Arpels’ business expansion in Thailand, you will be responsible for the Maison’s awareness, image, team and retail development in this fast-developing market and acts as a Brand Ambassador towards clients, partners and press.\nYou will report to the Managing Director SEAO and will work in close collaboration with Southeast Asia office team, based in Singapore.\nYou will also be responsible for managing the local teams, as well as their quantitative and qualitative performances, proposing and implementing an ambitious action plan for the country, in line with the Maison’s long-term strategy and standard of excellence.\nWith the support of the Singapore function heads, you will ensure that Retail, Operations, Communications & Press Relations, People Development and Marketing are at the level required to grow the business in the country in a sustainable way.\n\n\nMore than a role…. We recruit for a career!\n\nIf you are interested in joining the influential growth of the Maison with care, no compromise, and the drive to succeed then do not hesitate to enter the creative universe of Van Cleef & Arpels. By joining the Maison, you will be part of a nurturing team focused on delivering excellence and development.\n\nThe recruitment process\n\nSend your application online. If your profile matches our search, you will be contacted by the HR team for an interview. Along the recruitment process you will meet with Regional TA Manager, local HR, Managing Director SEAO, HR Director & President APAC and finally HQ. Otherwise, you will receive an email to inform you that your application is unsuccessful.\n\n\nแสดงเพิ่มเติม \nระดับประสบการณ์\nผู้อำนวยการ\nประเภทการจ้างงาน\nงานเต็มเวลา\nหน้าที่งาน\nการจัดการ กลยุทธ์/การวางแผน และการให้คำปรึกษา\nอุตสาหกรรม\nการค้าปลีกสินค้าหรูและอัญมณี\n  \n\nคำรับรองเพิ่มโอกาสในการสัมภาษณ์ของคุณที่ Van Cleef & Arpels ได้ถึง 2 เท่า\n\nดูบุคคลที่คุณรู้จัก"
  },
  {
    "id": "xdY8/0k1iXosAwuSiZ2f4g",
    "url": "https://th.linkedin.com/jobs/view/director-of-regional-operations-at-execthread-3774883834?refId=mrxTSrR0PRyWkRBTKNb3NA%3D%3D&trackingId=xdY8%2F0k1iXosAwuSiZ2f4g%3D%3D&position=2&pageNum=0&trk=public_jobs_jserp-result_search-card",
    "content": "Director of Regional Operations\nExecThread  กรุงเทพมหานคร\n3 ชั่วโมงก่อน   มาเป็นหนึ่งในผู้สมัคร 25 คนแรก\n  \nดูบุคคลที่ ExecThread ได้ว่าจ้างสำหรับตำแหน่งนี้\nสมัคร \nบันทึกVice President of Operations at a Well-Established Insurance Provider\n\nIndustry: Insurance\n\nCompany Type: Privately Held\n\nAbout The Role\n\nAs the Vice President of Operations, you will play a key role in overseeing and improving the operational performance of our insurance company. You will have the opportunity to establish comprehensive operational procedures and drive efficiency across our organization.\n\nResponsibilities\n\nOperations:\n\n\nReview and direct the operational performance of our regional offices\nStreamline processes and identify areas for improvement\nImplement strategies to enhance productivity and cost-effectiveness\nCollaborate with cross-functional teams to ensure smooth operations\n\n\nGeneral Management\n\n\nProvide effective leadership and guidance to the operations team\nFoster a positive and collaborative work environment\nDevelop and implement performance metrics to evaluate team's performance\nStay updated on industry trends and best practices\n\n\nRequirements\n\n\nMore than 5 years of operational management experience\nProven track record in establishing robust operational processes\nExceptional problem-solving skills\nFluency in English and Thai\n\n\nJoin our well-established insurance company as the Vice President of Operations and make a significant impact on our operational success. Apply now to take the next step in your career.\n\n[Company Name] is a leading insurance provider with a strong presence in the local market. We are committed to delivering top-quality insurance solutions to our clients and providing a supportive and rewarding work environment for our employees.\nแสดงเพิ่มเติม \nระดับประสบการณ์\nผู้อำนวยการ\nประเภทการจ้างงาน\nงานเต็มเวลา\nหน้าที่งาน\nการจัดการและการผลิต\nอุตสาหกรรม\nการจัดหาและคัดเลือกพนักงาน\n  \n\nคำรับรองเพิ่มโอกาสในการสัมภาษณ์ของคุณที่ ExecThread ได้ถึง 2 เท่า\n\nดูบุคคลที่คุณรู้จัก"
  },
  {
    "id": "UGrmHWKluZRsbTHMRItJww",
    "url": "https://th.linkedin.com/jobs/view/administration-supervisor-at-g4s-3731059362?refId=mrxTSrR0PRyWkRBTKNb3NA%3D%3D&trackingId=UGrmHWKluZRsbTHMRItJww%3D%3D&position=5&pageNum=0&trk=public_jobs_jserp-result_search-card",
    "content": "Administration Supervisor\nG4S  เขตปริมณฑลกรุงเทพมหานคร\n3 ชั่วโมงก่อน  ผู้สมัคร 78 คน\n  \nดูบุคคลที่ G4S ได้ว่าจ้างสำหรับตำแหน่งนี้\nสมัคร\nบันทึกส่งข้อความโดยตรงถึงผู้ประกาศรับสมัครงานจาก G4S\n\nNoppakan Nopthaisong\nNoppakan Nopthaisong\nHR Recruitment/Talent Attraction\n\nBrief Roles & Responsibilities:\n\nResponsible for the expenses & payments of the internet, mobile phone, electricity, water, courier, petrol, building rental fee, vehicle rental fee, parking fee, and etc.,\nResponsible for vehicle rental and its related matters; rental fee, contract, quality, service, fleet cards, GPS, Pool Cars,\nResponsible for company assets administration at the Head Office (Chan Issara Tower II), HR & Operation Buildings, and Training Academy,\nRadio Communication including request / purchase, registration, maintenance & repair, and end of life & sale,\nResponsible for tax administration; motorcycles / vehicles, signage, and etc.,\nPreparing the Weekly and Monthly Administration Functional Reports,\nOther jobs as assigned by the manager / director.\n\n\n\n\nBasic Requirements:\n\nBachelor degree in Accounting, Finance, or Business Administration,\nAt least 5 years working experience in the same or similar role, preferable from international companies,\nExcellent with numbers & calculation, and accuracy,\nExcellent analytical, problem solving, communication, and negotiation skills,\nHigh responsibility, reliability, and service-minded,\nGood command of written and spoken English, and Computer literacy\n\n\n\n\nBase of working location:\n\nRama9, Bangkapi, Huai Khwang, Bangkok 10310\n\nThe company offers very attractive and competitive remuneration package.\n\nPlease apply in-person, or send your application, with your personal documents at the address below, or send/email your resume and recent photo via \"Apply Now\".\n\n\n\n\nHuman Resources Department\n\nG4S Security Services (Thailand) Limited.\n\n344/3 Rama 9 Soi 17, Rama 9 Road Bangkapi, Huaykwang,Bangkok 10310\n\nTelephone: 02 020 2400 Extension no. 2414\n\n\n\n\nWe thank you for your interest in our job & company.\n\nWe are looking forward to working with you\n\nแสดงเพิ่มเติม \nระดับประสบการณ์\nรองผู้จัดการ\nประเภทการจ้างงาน\nงานเต็มเวลา\nหน้าที่งาน\nทรัพยากรบุคคล การบริหาร และฝ่ายบริการลูกค้า\nอุตสาหกรรม\nการรักษาความปลอดภัยและการสอบสวน บริการจัดงาน และการค้าปลีกอุปกรณ์สำนักงาน\n  \n\nคำรับรองเพิ่มโอกาสในการสัมภาษณ์ของคุณที่ G4S ได้ถึง 2 เท่า\n\nดูบุคคลที่คุณรู้จัก"
  },
  {
    "id": "GxqwkAO/3vSFWxkNzn6ubA",
    "url": "https://th.linkedin.com/jobs/view/brand-platform-manager-emerging-platform-at-l-or%C3%A9al-3764786458?refId=mrxTSrR0PRyWkRBTKNb3NA%3D%3D&trackingId=GxqwkAO%2F3vSFWxkNzn6ubA%3D%3D&position=6&pageNum=0&trk=public_jobs_jserp-result_search-card",
    "content": "Brand Platform Manager - Emerging platform\nL'Oréal  กรุงเทพมหานคร\n21 ชั่วโมงก่อน  ผู้สมัคร 55 คน\n  \nดูบุคคลที่ L'Oréal ได้ว่าจ้างสำหรับตำแหน่งนี้\nสมัคร \nบันทึกWho are we?\n\nAt L’Oréal, there is never a dull day, the beauty lies in the freedom to go beyond with our empowering entrepreneurial culture. We take pride in developing young talents who have the passion and ambition to make an impact in the beauty industry.\n\nJoin us on our mission to: Create the beauty that moves the world.\n\nBeing part of L’Oreal, “Talent” is the core of our business. L’Oreal group’s success is built upon the collaboration of brilliant minds.\n\nYou Will\n\n\nDrive growth strategies of emerging online channels such as Social Commerce, ‘Tiktok Shop’ etc. to achieve sales target\nDefine the roadmap of the channel development with building blocks of the business\nCollaborate with brand teams to drive the platform success and achieving the business goals for luxury brands\nDrive community building of the brand and close KOL partnership on the social commerce platform\nNegotiate with platforms to gain the best resources for the brands\nInitiate productive promotion, communication, live streaming, affiliate and visibility plan to build Luxe leadership on digital to drive young and new consumers to the brands\nResponsible for managing P&L by maximizing ROI and planning effective trade budget spending aligned with the given frame\nAnalyze business performance and provide insightful data on regular basis\nClosely Collaborate with platforms and external agencies to drive seamless JBP and BAU processes\nPlan stock forecast process to secure optimal stock level with highest accuracy and ATP rate\nUpskilling internally for latest digital trends and sharing best practices\n\n\nYou Have\n\n\n6 - 10 years of ecommerce experience in platform and /or FMCG industry preferred\nStrong interests in latest digital trends and driven by consumer insights\nEntrepreneurship mindset and driven for business performance\nStrong analytical skills\nManage complexity, agile and ability to work under pressure\nThink out-of-the-box and motivate by challenges and growth mindset\nExperience in community management, livestreaming, KOL advocacy are a plus\nGood command of English both speaking and written\n\n\nWhy us?\n\nWe will support you through a tailor-made learning & development journey where you will receive constant career advice to empower you to navigate through and reach the Senior Leadership and Management role of your dreams. Progressive leadership track – opportunities for growth & development. Overseas learning opportunities for top talents in the group.\nแสดงเพิ่มเติม \nระดับประสบการณ์\nไม่เกี่ยวข้อง\nประเภทการจ้างงาน\nงานเต็มเวลา\nหน้าที่งาน\nวิศวกรรมและเทคโนโลยีสารสนเทศ\nอุตสาหกรรม\nการผลิตและการผลิตผลิตภัณฑ์ของใช้ส่วนตัว\n  \n\nคำรับรองเพิ่มโอกาสในการสัมภาษณ์ของคุณที่ L'Oréal ได้ถึง 2 เท่า\n\nดูบุคคลที่คุณรู้จัก"
  },
  {
    "id": "dkmOSUXQuLoeMiZE47YNEQ",
    "url": "https://th.linkedin.com/jobs/view/cfo-at-pasona-thailand-3773090956?refId=mrxTSrR0PRyWkRBTKNb3NA%3D%3D&trackingId=dkmOSUXQuLoeMiZE47YNEQ%3D%3D&position=7&pageNum=0&trk=public_jobs_jserp-result_search-card",
    "content": "CFO\nPasona Thailand  เขตปริมณฑลกรุงเทพมหานคร\n1 ชั่วโมงก่อน   มาเป็นหนึ่งในผู้สมัคร 25 คนแรก\n  \nดูบุคคลที่ Pasona Thailand ได้ว่าจ้างสำหรับตำแหน่งนี้\nสมัคร\nบันทึกส่งข้อความโดยตรงถึงผู้ประกาศรับสมัครงานจาก Pasona Thailand\n\nPangsama (Anne) S.\nPangsama (Anne) S.\nProfessional Recruiter | Delivering 1.1 MB Sales Revenue in 1 Year | Connect for Opportunities\n\nPosition: CFO\n\nLocation: CBD, Bangkok\n\nBusiness: Service Industry\n\n\n\n\nThe ideal candidate will be responsible for financial strategy, M&A integration investment strategies, company expansion plans, sustainable growth, risk management, capital allocation and profitability. They will collaborate with the President and the board of directors to make decisions regarding company's financial strategy and operations. The candidate will possess a strong background in finance and management.\n\nResponsibilities\n\nProviding strategic financial vision, advice and insights to the President and the board of directors to support decision-making at the company level, including investment strategies, expansion plans, sustainable growth, risk management, capital allocation and profitability.\nM&A integration of newly acquired businesses or divestitures to ensure a smooth transition and alignment with the company's financial objectives.\nEnsuring consistent financial governance practices and adherence to compliance and regulatory standards across all subsidiary businesses.\nPresenting financial and strategic updates to the President and the board of directors to keep them informed about the financial performance and strategic direction of the company as a whole.\nOverseeing the consolidation of financial data from various business units to prepare accurate and comprehensive financial reports for presentation to the President and the board of directors and others.\nSupervising and providing leadership to the CFO group across 4 functions; Finance, Investor relations, Accounting and legal ensuring alignment with the overall strategy and goals of the organization.\nPerform any duties and/or tasks assigned by the President and the board of directors.\n\n\n\n\nQualifications\n\nA bachelor’s degree in finance or MBA and related field.\nA minimum of 3-5 years of experience in CFO or senior management roles is essential.\nPrior experience in both Public Company Limited and Holding Company environments is highly desirable.\nExceptional business and financial acumen; an in-depth understanding of the Thailand & Global capital markets, and knowledge of SET/SEC regulations.\nExhibits an open mindset, allowing for innovative and adaptive approaches to financial strategies. Possesses good soft skills, team collaboration and leadership.\nAbility to effectively communicate and presentation skills with the public and investors.\nExcellent written and verbal communication skills (both Thai and English).\nแสดงเพิ่มเติม \nระดับประสบการณ์\nผู้บริหาร\nประเภทการจ้างงาน\nงานเต็มเวลา\nหน้าที่งาน\nการเงินและSales\nอุตสาหกรรม\nบริการด้านทรัพยากรบุคคล\n  \n\nคำรับรองเพิ่มโอกาสในการสัมภาษณ์ของคุณที่ Pasona Thailand ได้ถึง 2 เท่า\n\nดูบุคคลที่คุณรู้จัก"
  }
]