[
  {
    "id": "iBgFEnBm4gHv0TR/h5Mjxw",
    "url": "https://th.linkedin.com/jobs/view/director-of-regional-operations-at-execthread-3774883834?refId=ct7h3EDkbDu%2FCZzo%2BLbb%2BQ%3D%3D&trackingId=iBgFEnBm4gHv0TR%2Fh5Mjxw%3D%3D&position=1&pageNum=0&trk=public_jobs_jserp-result_search-card",
    "content": "Director of Regional Operations\nExecThread  กรุงเทพมหานคร\n2 ชั่วโมงก่อน   มาเป็นหนึ่งในผู้สมัคร 25 คนแรก\n  \nดูบุคคลที่ ExecThread ได้ว่าจ้างสำหรับตำแหน่งนี้\nสมัคร \nบันทึกVice President of Operations at a Well-Established Insurance Provider\n\nIndustry: Insurance\n\nCompany Type: Privately Held\n\nAbout The Role\n\nAs the Vice President of Operations, you will play a key role in overseeing and improving the operational performance of our insurance company. You will have the opportunity to establish comprehensive operational procedures and drive efficiency across our organization.\n\nResponsibilities\n\nOperations:\n\n\nReview and direct the operational performance of our regional offices\nStreamline processes and identify areas for improvement\nImplement strategies to enhance productivity and cost-effectiveness\nCollaborate with cross-functional teams to ensure smooth operations\n\n\nGeneral Management\n\n\nProvide effective leadership and guidance to the operations team\nFoster a positive and collaborative work environment\nDevelop and implement performance metrics to evaluate team's performance\nStay updated on industry trends and best practices\n\n\nRequirements\n\n\nMore than 5 years of operational management experience\nProven track record in establishing robust operational processes\nExceptional problem-solving skills\nFluency in English and Thai\n\n\nJoin our well-established insurance company as the Vice President of Operations and make a significant impact on our operational success. Apply now to take the next step in your career.\n\n[Company Name] is a leading insurance provider with a strong presence in the local market. We are committed to delivering top-quality insurance solutions to our clients and providing a supportive and rewarding work environment for our employees.\nแสดงเพิ่มเติม \nระดับประสบการณ์\nผู้อำนวยการ\nประเภทการจ้างงาน\nงานเต็มเวลา\nหน้าที่งาน\nการจัดการและการผลิต\nอุตสาหกรรม\nการจัดหาและคัดเลือกพนักงาน\n  \n\nคำรับรองเพิ่มโอกาสในการสัมภาษณ์ของคุณที่ ExecThread ได้ถึง 2 เท่า\n\nดูบุคคลที่คุณรู้จัก"
  },
  {
    "id": "6rZdgbCW2dBcVhoCdUJ22g",
    "url": "https://th.linkedin.com/jobs/view/country-operations-head-at-asian-development-bank-adb-3779916088?refId=ct7h3EDkbDu%2FCZzo%2BLbb%2BQ%3D%3D&trackingId=6rZdgbCW2dBcVhoCdUJ22g%3D%3D&position=2&pageNum=0&trk=public_jobs_jserp-result_search-card",
    "content": "Country Operations Head\nAsian Development Bank (ADB)  กรุงเทพมหานคร\n3 ชั่วโมงก่อน   มาเป็นหนึ่งในผู้สมัคร 25 คนแรก\n  \nดูบุคคลที่ Asian Development Bank (ADB) ได้ว่าจ้างสำหรับตำแหน่งนี้\nสมัคร \nบันทึกOverview\n\nAsian Development Bank (ADB) is an international development finance institution headquartered in Manila, Philippines and is composed of 68 members, 49 of which are from the Asia and Pacific region. ADB is committed to achieving a prosperous, inclusive, resilient, and sustainable Asia and the Pacific, while sustaining its efforts to eradicate extreme poverty. ADB combines finance, knowledge, and partnerships to fulfill its expanded vision under its Strategy 2030 .\n\nADB only hires nationals of its 68 members .\n\nThe position is assigned to the Thailand Resident Mission (TRM) within the Southeast Asia Department (SERD). SERD is responsible for maintaining client relations and delivering ADB assistance to countries in the Southeast Asian region. TRM is responsible for country partnership strategy, policy dialogue and client relationship, business development, program formulation, project processing and administration support, portfolio coordination, project quality assurance, economic work, knowledge management, and information dissemination in Thailand.\n\nTo view ADB Organizational Chart, please click here .\n\nJob Purpose\n\nThe Country Operations Head will assist the Country Director in the sound management of operations in Thailand Resident Mission. The incumbent will coordinate country programming, business planning, quality assurance and portfolio monitoring and organize the provision of operations services to project teams. The incumbent will report to the Country Dire ctor with a matrix reporting to the Regional Head, Operations Coordination of the Southeast Asia Department and will supervise International, National and Administrative staff.\n\nResponsibilities\n\nCountry portfolio management and programming\n\n\nLeads the country portfolio performance review. Responsible for management, monitoring and reporting on sovereign and non-sovereign operations (programming, pipeline and portfolio management) at country level to achieve country KPIs. Provides high-level guidance on operational issues and compliance with ADB policies. Actively takes part in operations and portfolio networks, facilitated by Regional Head, Operations Coordination and PPFD.\nGuides project teams on country-specific project and portfolio management issues and leads portfolio, programming and pipeline related missions and activities with government. Oversees project related communication and coordination with government and stakeholders. Consults with clients to swiftly resolve country-wide issues, and coordinates the resolution of project-specific issues, in collaboration with the solutions departments/offices.\nSupports CD in assuring project/TA implementation arrangements are designed to meet country context. Guides sectors in the design and processing of projects to ensure that they are effectively delivered to advance ADB’s regional and country priorities, meet DMC needs, and fit the local context.\nOversees country programming including formulation, review and implementation of the country programs and the allocation of operational resources in the country in collaboration with Sectors Group, PSOD/OMDP and SEOC. Works closely with TRM’s programming team as well as country management team (CMT) members to develop an innovative, value-adding and ADB Thailand aligned thematic priorities (e.g. green finance and PSD) lending and TA projects’ pipeline including developing strategies, project pitches and relationships with relevant government counterparts.\nMaintains pipelines and oversees progress of lending and non-lending by monitoring, supporting and facilitating the work of solutions departments for the timely delivery of the country program. Liaises with development partners on co-financing opportunities. Provides inputs into CPS and CPS reviews from a programming, pipeline and portfolio management perspective.\nAdvises the CD and backstops the quality of project-level documentation, concurrences and decisions for sovereign operations and technical assistance, as determined by SIs and PAIs. Liaises closely with Regional Head, Operations Coordination on all matters of quality assurance.\nServes as oversight for implementation of TRM’s stand-alone TAs as well as quality assurance focal point for RETAs being developed and implemented by relevant sector offices, ensuring that ADB’s strategic and cross-cutting concerns are appropriately addressed. Assists Country Director, TRM in staffing and office administration matters.\n\n\nWork planning\n\n\nSupports CD and the country management team in preparation of the Resident Mission’s work plan and alignment with regional department KPIs.\nServes as head of the secretariat to the country management team, supporting the country director to set standard operating procedures for its effective functioning.\nOrganizes and advises on the provision of certain operations services (e.g., safeguards, procurement, financial management) and thematic services (e.g., climate change, gender), to ensure adequate support to project teams delivering operations in the country.\n\n\nCapacity development\n\n\nOrganizes and provides operational capacity development to staff and external clients on sovereign operations management.\nManages the performance of teams and individuals providing clear direction and regular monitoring and feedback on performance.\nProvides coaching and mentoring to team and individuals and ensures their on-going learning and development.\nUndertakes other activities as designated by CD and Regional Head, Operations Coordination. Coordinates with Regional Heads for Operations Coordination, Regional Head, Regional Cooperation and Integration, Lead Economist and Regional Head, Private Sector Development.\n\n\nRelevant Experience & Requirements\n\n\nMaster's Degree, in engineering, finance, economics, business administration or related fields. University degree in engineering, finance, economics, business administration and related fields.\nAt least 12 years relevant professional experience in managing projects, portfolios and pipelines for development institutions. International experience working in development in several countries.\nProven management and leadership qualities.\nDemonstrated cultural sensitivities and maturity.\nPlease refer to the link for ADB Competency Framework for Level 6.\n\n\nGeneral Considerations\n\nThe selected candidate, if new to ADB, is appointed for an initial term of 3 years.\n\nADB offers competitive remuneration and a comprehensive benefits package . Actual appointment salary will be based on ADB’s standards and computation, taking into account the selected individual’s qualifications and experience.\n\nADB seeks to ensure that everyone is treated with respect and given equal opportunities to work in an inclusive environment. ADB encourages all qualified candidates to apply regardless of their racial, ethnic, religious and cultural background, gender, sexual orientation or disabilities. Women are highly encouraged to apply.\n\nPlease note that the actual level and salary will be based on qualifications of the selected candidate.\n\n\nPrimary Location: Thailand Resident Mission-Thailand-Bangkok\n\nDepartment: Southeast Asia Department\n\nStaff Category: International Staff (HQ)\n\nPosition Level: IS 6\n\nJob Posting: 06-Dec-2023, 9:17:39 AM\n\n08-Jan-2024, 11:59:00 PM\nแสดงเพิ่มเติม \nระดับประสบการณ์\nผู้อำนวยการ\nประเภทการจ้างงาน\nงานเต็มเวลา\nหน้าที่งาน\nการจัดการและการผลิต\nอุตสาหกรรม\nการค้าและการพัฒนาระหว่างประเทศ\n  \n\nคำรับรองเพิ่มโอกาสในการสัมภาษณ์ของคุณที่ Asian Development Bank (ADB) ได้ถึง 2 เท่า\n\nดูบุคคลที่คุณรู้จัก"
  },
  {
    "id": "3CqfSpZrtYpcVsERuO5JKg",
    "url": "https://th.linkedin.com/jobs/view/retail-brand-manager-brand-activation-at-l-or%C3%A9al-3764783770?refId=ct7h3EDkbDu%2FCZzo%2BLbb%2BQ%3D%3D&trackingId=3CqfSpZrtYpcVsERuO5JKg%3D%3D&position=3&pageNum=0&trk=public_jobs_jserp-result_search-card",
    "content": "Retail Brand Manager (Brand Activation)\nL'Oréal  กรุงเทพมหานคร\n20 ชั่วโมงก่อน  ผู้สมัคร 66 คน\n  \nดูบุคคลที่ L'Oréal ได้ว่าจ้างสำหรับตำแหน่งนี้\nสมัคร \nบันทึกWho are we?\n\nAt L’Oréal, there is never a dull day, the beauty lies in the freedom to go beyond with our empowering entrepreneurial culture. We take pride in developing young talents who have the passion and ambition to make an impact in the beauty industry.\n\nJoin us on our mission to: Create the beauty that moves the world.\n\nBeing part of L’Oreal, “Talent” is the core of our business. L’Oreal group’s success is built upon the collaboration of brilliant minds.\n\nYou Will\n\n\nLead brand execution in retail channels to help maximize brand growth and achieve sales target\nOwner of retail activation plan including instore visibility, promotion, and activation for each retail channel\nAchieving brand consolidated targets through building differentiated shopper-centric account strategies and lead the translation and execution of the marketing strategy into impactful retailer program, respecting and tracking budget to achieve brand target\nWork closely with product managers to lead in developing NPD Launch plan (including NPD performance tracking ) and channel activation plan to maximize brand performance\nAble to take lead on recommendations of the right assortment mix, pack size role and portfolio prioritization for each of the retail channels for commercial team\nOwn overall brand merchandising and planogram to strengthen brand image and position in retailers.\nFull Responsibility for all POSM management (planning, budgeting, design briefing & development till delivery to store)\nIn charge of GWP & Value Set management to achieve targeted KPI and ensure implement flawless in-store execution within agreed timeline\nPlan and Monitor retail activation Budget and evaluate performance of key in-store activation (Booth Animation / Mini Event / Customer Theme / Lucky Draw / Value Set)\nWork regularly and closely with Commercial team to ensure flawless execution in store in terms of shelf placement, promotion and in-store animations\nRegular tracking on brand sales performance with target and develop action plan if performance is off track\n\n\nYou Have\n\n\nBachelor’s degree in any related fields\nMinimum 5 years business experience in trade marketing function\nAble to work cross-functionally at all levels\nHas demonstrated leadership capability (not necessarily people management), strong commercial acumen in previous roles\nConsistent strong performance and results in previous roles\nStrong enthusiasm on Branding and excited by new product launches\nData driven mindset with the love of marketing execution\nGood networking skill and be able to build strong rapport and relationships with commercial stakeholders internally and externally\nThe love of working in retails/channel marketing with great eyes to spot competition and what's happening in stores\n\n\nWhy us?\n\nWe will support you through a tailor-made learning & development journey where you will receive constant career advice to empower you to navigate through and reach the Senior Leadership role of your dreams. Progressive leadership track – opportunities for growth & development.\nแสดงเพิ่มเติม \nระดับประสบการณ์\nไม่เกี่ยวข้อง\nประเภทการจ้างงาน\nงานเต็มเวลา\nหน้าที่งาน\nการโฆษณา การตลาด และอื่น ๆ\nอุตสาหกรรม\nการผลิตและการผลิตผลิตภัณฑ์ของใช้ส่วนตัว\n  \n\nคำรับรองเพิ่มโอกาสในการสัมภาษณ์ของคุณที่ L'Oréal ได้ถึง 2 เท่า\n\nดูบุคคลที่คุณรู้จัก"
  },
  {
    "id": "dQzbHMQ7YLBqDui2UvSxUg",
    "url": "https://th.linkedin.com/jobs/view/biology-teacher-at-oxbridge-international-school-3779793606?refId=ct7h3EDkbDu%2FCZzo%2BLbb%2BQ%3D%3D&trackingId=dQzbHMQ7YLBqDui2UvSxUg%3D%3D&position=5&pageNum=0&trk=public_jobs_jserp-result_search-card",
    "content": "Biology teacher\nOxbridge International School  กรุงเทพมหานคร\n6 ชั่วโมงก่อน   มาเป็นหนึ่งในผู้สมัคร 25 คนแรก\n  \nดูบุคคลที่ Oxbridge International School ได้ว่าจ้างสำหรับตำแหน่งนี้\nสมัคร\nบันทึกAn exciting opportunity to work within a vibrant and dynamic International School in Tashkent, Uzbekistan, which boasts both the International Baccalaureate and local educational systems.\n\nAbout Oxbridge International School\n\nWe have 200+ employees so far working with us and 30+ of them are expats. There is a strong commitment to the on-going professional training of all staff and for providing leadership development at all levels. You can find videos of the school on Youtube and get the idea of the school, facilities and the team. Brilliant opportunity to save money, as the cost of living in Tashkent is very cheap.\n\nVery competitive package is provided.\n\nMain duties and responsibilities of the job:\n\nCollaboratively planning, preparing and delivering differentiated lessons\n\nAssessing and reporting student progress\n\nResponsible for student welfare and pastoral development of the class group\n\nMaintaining the learning environment of the classroom and managing resources\n\nOrganizing and taking part in school events, trips, and extra-curricular activities\n\nLine management of the teaching assistant\n\nThe ideal candidate will have:\n\nAt least Bachelor's degree\n\nPrevious experience\n\nThe ability to differentiate and deliver conceptual, engaging and inquiry-based lessons\n\nFamiliarity and experience with collaborative planning and a team-teaching approach\n\nA wonderful opportunity to discover Central Asia and work in one of the most dynamic schools of Tashkent, Uzbekistan. We have over 250 people working together to provide high quality education to the students and over 40 expats.\n\nPlease note that the job requires relocation!\n\nPowered by JazzHR\n\nr6li40mjrS\nแสดงเพิ่มเติม \nระดับประสบการณ์\nกึ่งอาวุโส\nประเภทการจ้างงาน\nงานเต็มเวลา\nหน้าที่งาน\nการศึกษาและฝึกงาน\nอุตสาหกรรม\nการเผยแพร่ทางอินเทอร์เน็ต\n  \n\nคำรับรองเพิ่มโอกาสในการสัมภาษณ์ของคุณที่ Oxbridge International School ได้ถึง 2 เท่า\n\nดูบุคคลที่คุณรู้จัก"
  }
]