[
  {
    "id": "khggF2x/+MRV0mPd4WaPLA",
    "url": "https://th.linkedin.com/jobs/view/country-manager-thailand-at-van-cleef-arpels-3774161196?refId=gfcwbaOzztjPyZ%2B2lBZlNw%3D%3D&trackingId=khggF2x%2F%2BMRV0mPd4WaPLA%3D%3D&position=1&pageNum=0&trk=public_jobs_jserp-result_search-card",
    "content": "Country Manager, Thailand\nVan Cleef & Arpels  กรุงเทพมหานคร\n18 ชั่วโมงก่อน  ผู้สมัคร 40 คน\n  \nดูบุคคลที่ Van Cleef & Arpels ได้ว่าจ้างสำหรับตำแหน่งนี้\nสมัคร \nบันทึกAt Van Cleef & Arpels, we are proud to employ talents from many different backgrounds, experiences and identities. We believe that when diversity and inclusion are fully embraced and empowered, creativity and knowledge emerge to deliver excellence.\n\nAre you a good match?\n\nYou have an extensive experience in the luxury retail industry.\n\nYou are a business leader with commercial skills and field knowledge.\n\nYou are self-driven and client focus.\n\nYou demonstrate exceptional people management skills, able to inspire and develop your team.\n\nYou have a passion for High Jewelry, Art & Culture.\n\nYou are fluent in English.\n\nWhat are we expecting from you?\n\n\nA key player of the Van Cleef & Arpels’ business expansion in Thailand, you will be responsible for the Maison’s awareness, image, team and retail development in this fast-developing market and acts as a Brand Ambassador towards clients, partners and press.\nYou will report to the Managing Director SEAO and will work in close collaboration with Southeast Asia office team, based in Singapore.\nYou will also be responsible for managing the local teams, as well as their quantitative and qualitative performances, proposing and implementing an ambitious action plan for the country, in line with the Maison’s long-term strategy and standard of excellence.\nWith the support of the Singapore function heads, you will ensure that Retail, Operations, Communications & Press Relations, People Development and Marketing are at the level required to grow the business in the country in a sustainable way.\n\n\nMore than a role…. We recruit for a career!\n\nIf you are interested in joining the influential growth of the Maison with care, no compromise, and the drive to succeed then do not hesitate to enter the creative universe of Van Cleef & Arpels. By joining the Maison, you will be part of a nurturing team focused on delivering excellence and development.\n\nThe recruitment process\n\nSend your application online. If your profile matches our search, you will be contacted by the HR team for an interview. Along the recruitment process you will meet with Regional TA Manager, local HR, Managing Director SEAO, HR Director & President APAC and finally HQ. Otherwise, you will receive an email to inform you that your application is unsuccessful.\n\n\nแสดงเพิ่มเติม \nระดับประสบการณ์\nผู้อำนวยการ\nประเภทการจ้างงาน\nงานเต็มเวลา\nหน้าที่งาน\nการจัดการ กลยุทธ์/การวางแผน และการให้คำปรึกษา\nอุตสาหกรรม\nการค้าปลีกสินค้าหรูและอัญมณี\n  \n\nคำรับรองเพิ่มโอกาสในการสัมภาษณ์ของคุณที่ Van Cleef & Arpels ได้ถึง 2 เท่า\n\nดูบุคคลที่คุณรู้จัก"
  },
  {
    "id": "jikBdQYU2GhdEoY6r1df8Q",
    "url": "https://th.linkedin.com/jobs/view/sales-supply-support-manager-ikea-bangkok-at-ikea-3778974632?refId=gfcwbaOzztjPyZ%2B2lBZlNw%3D%3D&trackingId=jikBdQYU2GhdEoY6r1df8Q%3D%3D&position=2&pageNum=0&trk=public_jobs_jserp-result_search-card",
    "content": "Sales & Supply Support Manager, IKEA Bangkok\nIKEA  บางใหญ่\n1 วันก่อน   มาเป็นหนึ่งในผู้สมัคร 25 คนแรก\n  \nดูบุคคลที่ IKEA ได้ว่าจ้างสำหรับตำแหน่งนี้\nสมัคร\nบันทึกCompany Description\n\nThe IKEA vision is to create a better everyday life for the many people. We do this by offering a wide range of well-designed, functional home furnishing products at prices so low that as many people as possible can afford them. We operate in Singapore, Malaysia and Thailand – and have an ambitious expansion plan to bring a little bit of Sweden to new markets in the region. We are part of the Ikano Group of companies and the only IKEA franchisee owned by the Kamprad family that founded IKEA.\n\nWe also develop, own and operate Shopping Centres that are anchored by IKEA and create walkable communities by including residential, office and other types of real estate in our development plans.\n\nWe work towards making sustainability a natural part of our everyday work. We are active in our communities, driving and supporting social initiatives that benefit children, women and the environment.\n\nJob Description\n\nThe Sales & Supply Support Manager leads and develops the Bangkok market (MMA) sales and supply support team, setting clear direction and goals for goods availability, healthy stock structure, efficient range management and accurate forecasting – all delivered at the lowest possible cost.\n\n\nLead the market Sales and Supply Support team and work with country Selling, Supply & Availability and Store Commercial teams to secure the highest possible goods availability in all market business units (IKEA Bangna, Bang Yai and Sukhumvit) for commercial activities as well as excellent everyday customer perceived availability.\nContribute to the market/store business plan(s) and store logistics action plans.\nSecure an efficient and precise range management process for the market.\nWork actively with the store commercial teams on the range change process and ensuring the required article parameters are in place in all business units to support the timely sales start of new articles as well as the clearance of outgoing articles in the most cost effective way.\nMaximise efficient goods replenishment in all business units.\nTogether with the Store Goods Flow Inbound Managers, ensure the daily stock count is executed successfully in all stock holding units.\nIdentify, recruit and develop the talents within the market Sales and Supply Support team to secure a high level of competence and succession planning is in place.\nEnsure that the market Sales and Supply Support team works in compliance with the IKEA Code of Conduct, internal IKEA regulations and local legislation relating to health, safety & security and the environment.\n\n\nQualifications\n\n\nPassion for developing people and talent.\nPassion for logistics and working in a fast paced, constantly changing retail environment.\nYou know how to analyse sales performance vs forecast in order to identify underperforming areas.\nYou know how optimize market capacity and availability by actively balancing stock among all stock holding units.\nYou know and understand the product life cycle and how to manage the range change process.\nYou know how to support efficient goods replenishment through the effective management of forecasts and sales location parameters.\nAbility to lead based on performing, delivering through team/stakeholder engagement\nAbility to deliver, making things happen with speed, simplicity and flexibility even in unpredictable situations.\nAbility to follow up and optimize operational performance while considering tactical plans.\n\n\nAdditional Information\n\nPlease apply by 31 December 2023.\nแสดงเพิ่มเติม \nระดับประสบการณ์\nกึ่งอาวุโส\nประเภทการจ้างงาน\nงานเต็มเวลา\nหน้าที่งาน\nซัพพลายเชน\nอุตสาหกรรม\nการค้าปลีก การผลิตเฟอร์นิเจอร์และของตกแต่งบ้าน และการผลิต\n  \n\nคำรับรองเพิ่มโอกาสในการสัมภาษณ์ของคุณที่ IKEA ได้ถึง 2 เท่า\n\nดูบุคคลที่คุณรู้จัก"
  },
  {
    "id": "+YblG0lhVk+FjiAvL1oFVA",
    "url": "https://th.linkedin.com/jobs/view/country-operations-head-at-asian-development-bank-adb-3779916088?refId=gfcwbaOzztjPyZ%2B2lBZlNw%3D%3D&trackingId=%2BYblG0lhVk%2BFjiAvL1oFVA%3D%3D&position=3&pageNum=0&trk=public_jobs_jserp-result_search-card",
    "content": "Country Operations Head\nAsian Development Bank (ADB)  กรุงเทพมหานคร\n20 นาทีก่อน   มาเป็นหนึ่งในผู้สมัคร 25 คนแรก\n  \nดูบุคคลที่ Asian Development Bank (ADB) ได้ว่าจ้างสำหรับตำแหน่งนี้\nสมัคร \nบันทึกOverview\n\nAsian Development Bank (ADB) is an international development finance institution headquartered in Manila, Philippines and is composed of 68 members, 49 of which are from the Asia and Pacific region. ADB is committed to achieving a prosperous, inclusive, resilient, and sustainable Asia and the Pacific, while sustaining its efforts to eradicate extreme poverty. ADB combines finance, knowledge, and partnerships to fulfill its expanded vision under its Strategy 2030 .\n\nADB only hires nationals of its 68 members .\n\nThe position is assigned to the Thailand Resident Mission (TRM) within the Southeast Asia Department (SERD). SERD is responsible for maintaining client relations and delivering ADB assistance to countries in the Southeast Asian region. TRM is responsible for country partnership strategy, policy dialogue and client relationship, business development, program formulation, project processing and administration support, portfolio coordination, project quality assurance, economic work, knowledge management, and information dissemination in Thailand.\n\nTo view ADB Organizational Chart, please click here .\n\nJob Purpose\n\nThe Country Operations Head will assist the Country Director in the sound management of operations in Thailand Resident Mission. The incumbent will coordinate country programming, business planning, quality assurance and portfolio monitoring and organize the provision of operations services to project teams. The incumbent will report to the Country Dire ctor with a matrix reporting to the Regional Head, Operations Coordination of the Southeast Asia Department and will supervise International, National and Administrative staff.\n\nResponsibilities\n\nCountry portfolio management and programming\n\n\nLeads the country portfolio performance review. Responsible for management, monitoring and reporting on sovereign and non-sovereign operations (programming, pipeline and portfolio management) at country level to achieve country KPIs. Provides high-level guidance on operational issues and compliance with ADB policies. Actively takes part in operations and portfolio networks, facilitated by Regional Head, Operations Coordination and PPFD.\nGuides project teams on country-specific project and portfolio management issues and leads portfolio, programming and pipeline related missions and activities with government. Oversees project related communication and coordination with government and stakeholders. Consults with clients to swiftly resolve country-wide issues, and coordinates the resolution of project-specific issues, in collaboration with the solutions departments/offices.\nSupports CD in assuring project/TA implementation arrangements are designed to meet country context. Guides sectors in the design and processing of projects to ensure that they are effectively delivered to advance ADB’s regional and country priorities, meet DMC needs, and fit the local context.\nOversees country programming including formulation, review and implementation of the country programs and the allocation of operational resources in the country in collaboration with Sectors Group, PSOD/OMDP and SEOC. Works closely with TRM’s programming team as well as country management team (CMT) members to develop an innovative, value-adding and ADB Thailand aligned thematic priorities (e.g. green finance and PSD) lending and TA projects’ pipeline including developing strategies, project pitches and relationships with relevant government counterparts.\nMaintains pipelines and oversees progress of lending and non-lending by monitoring, supporting and facilitating the work of solutions departments for the timely delivery of the country program. Liaises with development partners on co-financing opportunities. Provides inputs into CPS and CPS reviews from a programming, pipeline and portfolio management perspective.\nAdvises the CD and backstops the quality of project-level documentation, concurrences and decisions for sovereign operations and technical assistance, as determined by SIs and PAIs. Liaises closely with Regional Head, Operations Coordination on all matters of quality assurance.\nServes as oversight for implementation of TRM’s stand-alone TAs as well as quality assurance focal point for RETAs being developed and implemented by relevant sector offices, ensuring that ADB’s strategic and cross-cutting concerns are appropriately addressed. Assists Country Director, TRM in staffing and office administration matters.\n\n\nWork planning\n\n\nSupports CD and the country management team in preparation of the Resident Mission’s work plan and alignment with regional department KPIs.\nServes as head of the secretariat to the country management team, supporting the country director to set standard operating procedures for its effective functioning.\nOrganizes and advises on the provision of certain operations services (e.g., safeguards, procurement, financial management) and thematic services (e.g., climate change, gender), to ensure adequate support to project teams delivering operations in the country.\n\n\nCapacity development\n\n\nOrganizes and provides operational capacity development to staff and external clients on sovereign operations management.\nManages the performance of teams and individuals providing clear direction and regular monitoring and feedback on performance.\nProvides coaching and mentoring to team and individuals and ensures their on-going learning and development.\nUndertakes other activities as designated by CD and Regional Head, Operations Coordination. Coordinates with Regional Heads for Operations Coordination, Regional Head, Regional Cooperation and Integration, Lead Economist and Regional Head, Private Sector Development.\n\n\nRelevant Experience & Requirements\n\n\nMaster's Degree, in engineering, finance, economics, business administration or related fields. University degree in engineering, finance, economics, business administration and related fields.\nAt least 12 years relevant professional experience in managing projects, portfolios and pipelines for development institutions. International experience working in development in several countries.\nProven management and leadership qualities.\nDemonstrated cultural sensitivities and maturity.\nPlease refer to the link for ADB Competency Framework for Level 6.\n\n\nGeneral Considerations\n\nThe selected candidate, if new to ADB, is appointed for an initial term of 3 years.\n\nADB offers competitive remuneration and a comprehensive benefits package . Actual appointment salary will be based on ADB’s standards and computation, taking into account the selected individual’s qualifications and experience.\n\nADB seeks to ensure that everyone is treated with respect and given equal opportunities to work in an inclusive environment. ADB encourages all qualified candidates to apply regardless of their racial, ethnic, religious and cultural background, gender, sexual orientation or disabilities. Women are highly encouraged to apply.\n\nPlease note that the actual level and salary will be based on qualifications of the selected candidate.\n\n\nPrimary Location: Thailand Resident Mission-Thailand-Bangkok\n\nDepartment: Southeast Asia Department\n\nStaff Category: International Staff (HQ)\n\nPosition Level: IS 6\n\nJob Posting: 06-Dec-2023, 9:17:39 AM\n\n08-Jan-2024, 11:59:00 PM\nแสดงเพิ่มเติม \nระดับประสบการณ์\nผู้อำนวยการ\nประเภทการจ้างงาน\nงานเต็มเวลา\nหน้าที่งาน\nการจัดการและการผลิต\nอุตสาหกรรม\nการค้าและการพัฒนาระหว่างประเทศ\n  \n\nคำรับรองเพิ่มโอกาสในการสัมภาษณ์ของคุณที่ Asian Development Bank (ADB) ได้ถึง 2 เท่า\n\nดูบุคคลที่คุณรู้จัก"
  },
  {
    "id": "90uDdd3/nzZXT2cP56o3iA",
    "url": "https://th.linkedin.com/jobs/view/retail-brand-manager-brand-activation-at-l-or%C3%A9al-3764783770?refId=gfcwbaOzztjPyZ%2B2lBZlNw%3D%3D&trackingId=90uDdd3%2FnzZXT2cP56o3iA%3D%3D&position=4&pageNum=0&trk=public_jobs_jserp-result_search-card",
    "content": "Retail Brand Manager (Brand Activation)\nL'Oréal  กรุงเทพมหานคร\n17 ชั่วโมงก่อน  ผู้สมัคร 63 คน\n  \nดูบุคคลที่ L'Oréal ได้ว่าจ้างสำหรับตำแหน่งนี้\nสมัคร \nบันทึกWho are we?\n\nAt L’Oréal, there is never a dull day, the beauty lies in the freedom to go beyond with our empowering entrepreneurial culture. We take pride in developing young talents who have the passion and ambition to make an impact in the beauty industry.\n\nJoin us on our mission to: Create the beauty that moves the world.\n\nBeing part of L’Oreal, “Talent” is the core of our business. L’Oreal group’s success is built upon the collaboration of brilliant minds.\n\nYou Will\n\n\nLead brand execution in retail channels to help maximize brand growth and achieve sales target\nOwner of retail activation plan including instore visibility, promotion, and activation for each retail channel\nAchieving brand consolidated targets through building differentiated shopper-centric account strategies and lead the translation and execution of the marketing strategy into impactful retailer program, respecting and tracking budget to achieve brand target\nWork closely with product managers to lead in developing NPD Launch plan (including NPD performance tracking ) and channel activation plan to maximize brand performance\nAble to take lead on recommendations of the right assortment mix, pack size role and portfolio prioritization for each of the retail channels for commercial team\nOwn overall brand merchandising and planogram to strengthen brand image and position in retailers.\nFull Responsibility for all POSM management (planning, budgeting, design briefing & development till delivery to store)\nIn charge of GWP & Value Set management to achieve targeted KPI and ensure implement flawless in-store execution within agreed timeline\nPlan and Monitor retail activation Budget and evaluate performance of key in-store activation (Booth Animation / Mini Event / Customer Theme / Lucky Draw / Value Set)\nWork regularly and closely with Commercial team to ensure flawless execution in store in terms of shelf placement, promotion and in-store animations\nRegular tracking on brand sales performance with target and develop action plan if performance is off track\n\n\nYou Have\n\n\nBachelor’s degree in any related fields\nMinimum 5 years business experience in trade marketing function\nAble to work cross-functionally at all levels\nHas demonstrated leadership capability (not necessarily people management), strong commercial acumen in previous roles\nConsistent strong performance and results in previous roles\nStrong enthusiasm on Branding and excited by new product launches\nData driven mindset with the love of marketing execution\nGood networking skill and be able to build strong rapport and relationships with commercial stakeholders internally and externally\nThe love of working in retails/channel marketing with great eyes to spot competition and what's happening in stores\n\n\nWhy us?\n\nWe will support you through a tailor-made learning & development journey where you will receive constant career advice to empower you to navigate through and reach the Senior Leadership role of your dreams. Progressive leadership track – opportunities for growth & development.\nแสดงเพิ่มเติม \nระดับประสบการณ์\nไม่เกี่ยวข้อง\nประเภทการจ้างงาน\nงานเต็มเวลา\nหน้าที่งาน\nการโฆษณา การตลาด และอื่น ๆ\nอุตสาหกรรม\nการผลิตและการผลิตผลิตภัณฑ์ของใช้ส่วนตัว\n  \n\nคำรับรองเพิ่มโอกาสในการสัมภาษณ์ของคุณที่ L'Oréal ได้ถึง 2 เท่า\n\nดูบุคคลที่คุณรู้จัก"
  },
  {
    "id": "cTzorhVMcWANtfFEOsD8yQ",
    "url": "https://th.linkedin.com/jobs/view/brand-platform-manager-emerging-platform-at-l-or%C3%A9al-3764786458?refId=gfcwbaOzztjPyZ%2B2lBZlNw%3D%3D&trackingId=cTzorhVMcWANtfFEOsD8yQ%3D%3D&position=7&pageNum=0&trk=public_jobs_jserp-result_search-card",
    "content": "Brand Platform Manager - Emerging platform\nL'Oréal  กรุงเทพมหานคร\n17 ชั่วโมงก่อน  ผู้สมัคร 55 คน\n  \nดูบุคคลที่ L'Oréal ได้ว่าจ้างสำหรับตำแหน่งนี้\nสมัคร \nบันทึกWho are we?\n\nAt L’Oréal, there is never a dull day, the beauty lies in the freedom to go beyond with our empowering entrepreneurial culture. We take pride in developing young talents who have the passion and ambition to make an impact in the beauty industry.\n\nJoin us on our mission to: Create the beauty that moves the world.\n\nBeing part of L’Oreal, “Talent” is the core of our business. L’Oreal group’s success is built upon the collaboration of brilliant minds.\n\nYou Will\n\n\nDrive growth strategies of emerging online channels such as Social Commerce, ‘Tiktok Shop’ etc. to achieve sales target\nDefine the roadmap of the channel development with building blocks of the business\nCollaborate with brand teams to drive the platform success and achieving the business goals for luxury brands\nDrive community building of the brand and close KOL partnership on the social commerce platform\nNegotiate with platforms to gain the best resources for the brands\nInitiate productive promotion, communication, live streaming, affiliate and visibility plan to build Luxe leadership on digital to drive young and new consumers to the brands\nResponsible for managing P&L by maximizing ROI and planning effective trade budget spending aligned with the given frame\nAnalyze business performance and provide insightful data on regular basis\nClosely Collaborate with platforms and external agencies to drive seamless JBP and BAU processes\nPlan stock forecast process to secure optimal stock level with highest accuracy and ATP rate\nUpskilling internally for latest digital trends and sharing best practices\n\n\nYou Have\n\n\n6 - 10 years of ecommerce experience in platform and /or FMCG industry preferred\nStrong interests in latest digital trends and driven by consumer insights\nEntrepreneurship mindset and driven for business performance\nStrong analytical skills\nManage complexity, agile and ability to work under pressure\nThink out-of-the-box and motivate by challenges and growth mindset\nExperience in community management, livestreaming, KOL advocacy are a plus\nGood command of English both speaking and written\n\n\nWhy us?\n\nWe will support you through a tailor-made learning & development journey where you will receive constant career advice to empower you to navigate through and reach the Senior Leadership and Management role of your dreams. Progressive leadership track – opportunities for growth & development. Overseas learning opportunities for top talents in the group.\nแสดงเพิ่มเติม \nระดับประสบการณ์\nไม่เกี่ยวข้อง\nประเภทการจ้างงาน\nงานเต็มเวลา\nหน้าที่งาน\nวิศวกรรมและเทคโนโลยีสารสนเทศ\nอุตสาหกรรม\nการผลิตและการผลิตผลิตภัณฑ์ของใช้ส่วนตัว\n  \n\nคำรับรองเพิ่มโอกาสในการสัมภาษณ์ของคุณที่ L'Oréal ได้ถึง 2 เท่า\n\nดูบุคคลที่คุณรู้จัก"
  },
  {
    "id": "CGql3xZ0b7OY+c0Jc1fUaA",
    "url": "https://th.linkedin.com/jobs/view/key-account-manager-at-teleport-3774131615?refId=gfcwbaOzztjPyZ%2B2lBZlNw%3D%3D&trackingId=CGql3xZ0b7OY%2Bc0Jc1fUaA%3D%3D&position=8&pageNum=0&trk=public_jobs_jserp-result_search-card",
    "content": "Key Account Manager\nTeleport  กรุงเทพมหานคร, ประเทศไทย\n1 วันก่อน   มาเป็นหนึ่งในผู้สมัคร 25 คนแรก\n  \nดูบุคคลที่ Teleport ได้ว่าจ้างสำหรับตำแหน่งนี้\nสมัคร\nบันทึกJob Description\n\nWe are seeking an entrepreneurial individual Key Account Manager with a passion for engaging with people and solving their problems. In this role, you will be responsible for engaging with prospects, presenting our services and solutions, and demonstrating excellent communication skills. This role is a full-time position and reports to the local Country Head.\n\n\n\n\nSalary Range: THB 45,000 - THB 65,000\n\n\n\n\nA day in the life\n\nAs a startup, your daily activities will be quite diverse. Multitasking is common, and you may find your skills and talents leveraged to support various business priorities. However, the majority of your work hours will involve:\n\nDeveloping a deep understanding of our product offerings\nGathering data and information from customers, which may entail web research or direct customer interactions\nActively seeking new sales opportunities through cold calling, networking, and social media\nRepresenting the company at exhibitions and conferences\nIdentifying the needs of prospective customers and analyzing customer data\nAnalyzing customer data and creating pitch decks proposing solutions to meet their unique business requirements\nScheduling meetings with potential clients and assessing their needs\nPreparing and delivering appropriate presentations and product/service demonstrations\nNegotiating and closing deals, as well as addressing complaints or objections\nGenerating regular reviews and reports containing sales and financial data\nSoliciting feedback from customers or prospects and sharing it with internal teams\n\n\n\n\nInitially, working at AirAsia and with the Teleport team may feel like a culture shock. To help you adapt, we'd like to share our beliefs on leadership. In essence, at Teleport, we believe that everyone is a leader, and good leaders:\n\nAre willing to roll up their sleeves when necessary and never delegate tasks they wouldn't do themselves\nDo whatever it takes to get things done, prioritizing speed as the key driver of change\nOver-communicate, especially because our team members are quite autonomous\nTake care of our staff, treating them as they would like to be treated\nAre unwavering in their pursuit of goals but flexible when it comes to the details\n\n\n\n\nSkills\n\nThese are the minimum-required skills for the role:\n\nAbility to identify product solutions for complex problems and needs\nExcellent verbal, written, and interpersonal communication skills\nProficiency in networking and negotiation\nExceptional organizational skills\nFluent in Thai and English\n\n\n\n\nQualifications & Experience\n\nA minimum of 3 years of sales experience exceeding quotas\n\n\n\n\nEqual Opportunity Employer\n\nTeleport is an Equal Opportunity Employer. We provide equal consideration for employment regardless of race, color, religion, disability, sex, age, ethnic or national origin, marital status, sexual orientation, gender identity or expression, pregnancy, or any other status protected by National Law.\nแสดงเพิ่มเติม \nระดับประสบการณ์\nรองผู้จัดการ\nประเภทการจ้างงาน\nงานเต็มเวลา\nหน้าที่งาน\nSalesและการพัฒนาธุรกิจ\nอุตสาหกรรม\nการขนส่ง โลจิสติกส์ ซัพพลายเชนและการจัดเก็บและการขนส่งสินค้าและบรรจุภัณฑ์\n  \n\nคำรับรองเพิ่มโอกาสในการสัมภาษณ์ของคุณที่ Teleport ได้ถึง 2 เท่า\n\nดูบุคคลที่คุณรู้จัก"
  },
  {
    "id": "MRBfbTA4A2S5j4pxQ73Cow",
    "url": "https://th.linkedin.com/jobs/view/senior-branding-specialist-global-operations-centre-tha-at-shein-3764387504?refId=gfcwbaOzztjPyZ%2B2lBZlNw%3D%3D&trackingId=MRBfbTA4A2S5j4pxQ73Cow%3D%3D&position=9&pageNum=0&trk=public_jobs_jserp-result_search-card",
    "content": "Senior Branding Specialist - Global Operations Centre, THA\nSHEIN  กรุงเทพมหานคร, ประเทศไทย\n13 ชั่วโมงก่อน  ผู้สมัคร 46 คน\n  \nดูบุคคลที่ SHEIN ได้ว่าจ้างสำหรับตำแหน่งนี้\nสมัคร\nบันทึกส่งข้อความโดยตรงถึงผู้ประกาศรับสมัครงานจาก SHEIN\n\nChloe Liao\nChloe Liao\nSHEIN | HRBP Manager | Bilingual\n\nAt SHEIN, the marketing team consists of various functions: e-commerce website operations, social media, key-opinion leaders’ management, branding and data analysis. Combining these functions, it allows us to implement marketing activities that are attractive and connects us with millions of customers, to achieve our mission where “everyone can enjoy the beauty of fashion” across the region.\n\nJob Responsibilities\n\nEnhance and drive brand image and positioning to market.\nGrow brand equity and drive sales growth for both online and offline channels.\nRun integrated online and offline marketing plans to enhance brand awareness.\nIn charge of the local brand campaigns (Pop-up, Fashion Week, New Product Press Conference)\nBuild strong relationships with talents, PR agency, or marketing agencies.\nWork closely with influencers to establish and maintain a long-term cooperative relationship.\n\nJob Requirements\n\nBachelor’s Degree required with 3 years relevant working experience, have a good command of English.\nFamiliar with the local market and consumer habits, able to integrate both internal and external resources to track local hot news\nProject experience in fashion week or brand campaigns\nAble to identify, analyze and solve problems, and strong resistance to pressure\nExcellent communications and interpersonal skills.\n\nแสดงเพิ่มเติม \nระดับประสบการณ์\nกึ่งอาวุโส\nประเภทการจ้างงาน\nงานเต็มเวลา\nหน้าที่งาน\nการตลาด Sales และประชาสัมพันธ์\nอุตสาหกรรม\nการค้าปลีกเครื่องแต่งกายและแฟชั่นและเทคโนโลยี สารสนเทศ และอินเทอร์เน็ต\n  \n\nคำรับรองเพิ่มโอกาสในการสัมภาษณ์ของคุณที่ SHEIN ได้ถึง 2 เท่า\n\nดูบุคคลที่คุณรู้จัก"
  },
  {
    "id": "hNd7xU/PLZLSHcuDtKw+6Q",
    "url": "https://th.linkedin.com/jobs/view/technical-support-executive-installation-support-at-upman-placements-3778715067?refId=gfcwbaOzztjPyZ%2B2lBZlNw%3D%3D&trackingId=hNd7xU%2FPLZLSHcuDtKw%2B6Q%3D%3D&position=11&pageNum=0&trk=public_jobs_jserp-result_search-card",
    "content": "Technical Support Executive (installation & support)\nUpMan Placements  กรุงเทพมหานคร\n7 ชั่วโมงก่อน   มาเป็นหนึ่งในผู้สมัคร 25 คนแรก\n  \nดูบุคคลที่ UpMan Placements ได้ว่าจ้างสำหรับตำแหน่งนี้\nสมัคร \nบันทึกช่วงรายได้ที่ให้ข้อมูลโดย UpMan Placements\n\nช่วงนี้ให้ข้อมูลโดย UpMan Placements รายได้จริงของคุณจะขึ้นอยู่กับทักษะและประสบการณ์ของคุณ — พูดคุยกับเจ้าหน้าที่สรรหาของคุณเพื่อเรียนรู้เพิ่มเติม\n\nช่วงรายได้พื้นฐาน\nUS$12,000.00/ปี - US$18,000.00/ปี\nFounded in 2010, the company was born with a vision to connect people, places and technologies. It is an in-building connectivity solutions company with an emphasis on blitzscaling, using future-ready technologies. In simple words, we come first and connectivity follows. It delivers GDPR compliant high quality, secure connectivity and provides first-party hyperlocal data intelligence. With a license from the Department of Telecommunications, is at the forefront of business innovation.\n\nIt is the largest neutral digital infrastructure player, transforming and delivering connectivity solutions in India with objective of reducing digital divide.\n\nThe Role\n\nYou Will Be Responsible For\n\n\nEscalating technical issues to the relevant parties when needed and following up till the issues are closed.\nEnsuring all standards and procedures are followed and maintained.\nAnswering queries and resolving issue relating to usage of standard applications and IT services.\nProviding monthly help desk reports.\nConducting penetration testing, simulating an attack on the system to find exploitable weaknesses.\nDeveloping and implementing security framework, policies, processes/procedures and guidelines.\nMaintaining security subject-matter expertise and keep abreast of best practices & trends.\nManaging vulnerability assessment.\nOversight & resolution of security incidents.\n\n\nIdeal Profile\n\n\nReady to travel within Thailand for customer engagement regularly. Ready to travel out of Thailand for sales support activity if required.\nOverall a good team player and aspiring to grow within the company\nExperience : 3+ years installation and support of Networking products / solutions and other IT\nServices in the Hospitality / premium Hotel segment.\nOthers : Ability to read, write and converse in English and fluency in Thai Language in order to effectively liaise with the Stakeholders of the region.\nGood technical knowledge on Networking solutions and products\nAbility to discuss technical solution with local IT Managers in Thai language and also in English\nWorking knowledge on Wireless LAN components preferable\nKnowledge on Access points, Switches, Gateway installation, replacement and management preferable\nSupport internal teams for delivery and customer support related activities\nAbility to coordinate with backend GNOC and product team to address customer issues\nClosely support Business Delivery Manager in engaging new opportunities and during order closure as required\nPost-delivery, support Business Delivery Manager in collection activities as required\nAny administrative support for branch office as and when required\n\n\nWhat's on Offer?\n\n\nWork within a company with a solid track record of success\nAttractive salary & benefits\nOpportunity to make a positive impact\nแสดงเพิ่มเติม \nระดับประสบการณ์\nกึ่งอาวุโส\nประเภทการจ้างงาน\nงานเต็มเวลา\nหน้าที่งาน\nการพัฒนาธุรกิจและSales\nอุตสาหกรรม\nบริการ IT และการให้คำปรึกษาด้าน IT\n  \n\nคำรับรองเพิ่มโอกาสในการสัมภาษณ์ของคุณที่ UpMan Placements ได้ถึง 2 เท่า\n\nดูบุคคลที่คุณรู้จัก"
  },
  {
    "id": "nN2lwS2fCtzAUUwSglcINQ",
    "url": "https://th.linkedin.com/jobs/view/director-%E2%80%93-product-management-marketing-at-american-express-3758169181?refId=gfcwbaOzztjPyZ%2B2lBZlNw%3D%3D&trackingId=nN2lwS2fCtzAUUwSglcINQ%3D%3D&position=12&pageNum=0&trk=public_jobs_jserp-result_search-card",
    "content": "Director – Product Management & Marketing\nAmerican Express  กรุงเทพมหานคร\n16 ชั่วโมงก่อน  ผู้สมัคร 199 คน\n  \nดูบุคคลที่ American Express ได้ว่าจ้างสำหรับตำแหน่งนี้\nสมัคร \nบันทึกYou Lead the Way. We’ve Got Your Back.\n\nWith the right backing, people and businesses have the power to progress in incredible ways. When you join Team Amex, you become part of a global and diverse community of colleagues with an unwavering commitment to back our customers, communities and each other. Here, you’ll learn and grow as we help you create a career journey that’s unique and meaningful to you with benefits, programs, and flexibility that support you personally and professionally.\n\nAt American Express, you’ll be recognized for your contributions, leadership, and impact—every colleague has the opportunity to share in the company’s success. Together, we’ll win as a team, striving to uphold our company values and powerful backing promise to provide the world’s best customer experience every day. And we’ll do it with the utmost integrity, and in an environment where everyone is seen, heard and feels like they belong.\n\nJoin Team Amex and let's lead the way together.\n\nHow will you make an impact in this role?\n\nAs part of the American Express International Card Services team, the Director – Product Management & Marketing will lead the Product Management and Marketing team and drive the evolution of our strategic agenda passionate about on how we develop and market elite payment products for the global consumer business.\n\nThe main responsibility of this role is the management the product P&L by crafting and marketing card product features, driving investment optimization and dedicated program management with the aim of driving Card Member usage and engagement through strategizing, planning, driving, monitoring of product and marketing initiatives.\n\nKey responsibilities include:\n\n\nMember of Country Executive Team (CET)\nDeliver Revenue, Marginal Contribution and bottom-line objectives.\nAdvise strategic decisions, address opportunities for card feature improvements and help craft the overall product roadmap and P&L strength through analysis of customer performance and portfolio dynamics.\nLeading and developing the marketing team of highly engaged colleagues, encouraging a culture of inclusivity, empowerment, growth, and innovation to conceptualize, develop and implement marketing plans and project life cycle programs from strategic planning to implementation while ensuring marketing operational excellence.\nLead and run existing partners relationship by establishing a robust contact strategy between organizations for efficient engagement between management teams and regular performance review with the partners.\nSupervise product performance and lead the design & development effectively differentiated value propositions for both new and existing products under management to win in the target market segment.\nDrive engagement and loyalty through ownership of the loyalty rewards platform including the end-to-end customer journey and providing strategic insights and ideas to improve the program based on data analytics.\nStrategic management of the team’s overall investment and budgeting process to deliver on all marketing activities within the agreed budget and timeframe. Crafting and driving comprehensive marketing plan, budget and marketing calendar to drive ongoing optimization and effective use of resources as well as assume the forecasting, and profit and loss (P&L) responsibilities.\nResponsible for running the strategic relationships at a senior level with key external brands or partners and be the internal partner lead with cross-functional teams, including but not limited to Product teams, Acquisitions, Analytics, Risk, Pricing, Finance, Operational Excellence, Technology\nDevelop a detailed understanding of country customer portfolio and identify new dynamic targeting capabilities to grow spend. This may include crafting segmentation, cost/benefit analysis, developing cases to assist in campaign development.\n\n\nQualifications:\n\nTo be successful, the incumbent is a highly motivated, strategic problem solver and displays excellent Marketing and Project Management skills with the ability to work closely with key business partners at appropriate Local, Regional and Global levels to deliver new initiatives to success:\n\n\nAt least 10-15 years working experience. Prior experience and knowledge of the Cards product development or marketing in financial services industry will be an added advantage.\nA strong teammate player who is flexible and maintains a positive attitude during changing work priorities.\nExperience in Card Member end-to-end life cycle marketing and engagement programs, operation managements, deployment and monitoring including understanding of digital marketing and capabilities.\nStrong financial analysis and insight discovery experience with a committed outlook\nConsistent track record to adjust quickly to shifting priorities, support multiple work-streams, and lead through ambiguity.\nStrong customer focus with the ability to combine data analysis with competitive insight.\nAbility to work and collaborate in a sophisticated environment, with a diverse group of internal collaborators and external partners across multiple markets.\nStrong project management experience with a high comfort level for technical complexity with attention to details and ability to multi-task.\nPrior experience in analytics and knowledge of the marketing operations environment with the ability to understand sophisticated end to end processes.\nStrong analytical abilities with a creative flair.\nStrong eye for business and partnership management.\nAbility to take ownership and get results in areas outside of direct control.\nStrong communication skills (written & oral) with ability to articulate effectively at multiple levels.\nMeticulous attention to details and believe that anything worth doing, is worth doing right – every single time.\n\n\nOffer of employment with American Express is conditioned upon the successful completion of a background verification check, subject to applicable laws and regulations.\nแสดงเพิ่มเติม \nระดับประสบการณ์\nผู้อำนวยการ\nประเภทการจ้างงาน\nงานเต็มเวลา\nหน้าที่งาน\nการตลาดและSales\nอุตสาหกรรม\nบริการด้านการเงิน\n  \n\nคำรับรองเพิ่มโอกาสในการสัมภาษณ์ของคุณที่ American Express ได้ถึง 2 เท่า\n\nดูบุคคลที่คุณรู้จัก"
  },
  {
    "id": "mE3CbuB0PEhFDGcc3Ad9MQ",
    "url": "https://th.linkedin.com/jobs/view/economics-teacher-at-oxbridge-international-school-3779793584?refId=gfcwbaOzztjPyZ%2B2lBZlNw%3D%3D&trackingId=mE3CbuB0PEhFDGcc3Ad9MQ%3D%3D&position=13&pageNum=0&trk=public_jobs_jserp-result_search-card",
    "content": "Economics Teacher\nOxbridge International School  กรุงเทพมหานคร\n3 ชั่วโมงก่อน   มาเป็นหนึ่งในผู้สมัคร 25 คนแรก\n  \nดูบุคคลที่ Oxbridge International School ได้ว่าจ้างสำหรับตำแหน่งนี้\nสมัคร\nบันทึกAn exciting opportunity to work within a vibrant and dynamic International School in Tashkent, Uzbekistan, which boasts both the International Baccalaureate and local educational systems.\n\nAbout Oxbridge International School\n\nWe have 200+ employees so far working with us and 30+ of them are expats. There is a strong commitment to the on-going professional training of all staff and for providing leadership development at all levels. You can find videos of the school on Youtube and get the idea of the school, facilities and the team. Brilliant opportunity to save money, as the cost of living in Tashkent is very cheap.\n\nVery competitive package is provided.\n\nMain duties and responsibilities of the job:\n\nCollaboratively planning, preparing and delivering differentiated lessons\n\nAssessing and reporting student progress\n\nResponsible for student welfare and pastoral development of the class group\n\nMaintaining the learning environment of the classroom and managing resources\n\nOrganizing and taking part in school events, trips, and extra-curricular activities\n\nLine management of the teaching assistant\n\nThe ideal candidate will have:\n\nAt least Bachelor's degree\n\nPrevious experience\n\nThe ability to differentiate and deliver conceptual, engaging and inquiry-based lessons\n\nFamiliarity and experience with collaborative planning and a team-teaching approach\n\nA wonderful opportunity to discover Central Asia and work in one of the most dynamic schools of Tashkent, Uzbekistan. We have over 250 people working together to provide high quality education to the students and over 40 expats.\n\nPlease note that the job requires relocation!\n\nPowered by JazzHR\n\n7mhYwXXQrq\nแสดงเพิ่มเติม \nระดับประสบการณ์\nกึ่งอาวุโส\nประเภทการจ้างงาน\nงานเต็มเวลา\nหน้าที่งาน\nการศึกษาและฝึกงาน\nอุตสาหกรรม\nการเผยแพร่ทางอินเทอร์เน็ต\n  \n\nคำรับรองเพิ่มโอกาสในการสัมภาษณ์ของคุณที่ Oxbridge International School ได้ถึง 2 เท่า\n\nดูบุคคลที่คุณรู้จัก"
  },
  {
    "id": "ZzDYXiJ8pMm5pPX1nQdEaA",
    "url": "https://th.linkedin.com/jobs/view/sr-manager-apac-services-at-pall-corporation-3747221588?refId=gfcwbaOzztjPyZ%2B2lBZlNw%3D%3D&trackingId=ZzDYXiJ8pMm5pPX1nQdEaA%3D%3D&position=15&pageNum=0&trk=public_jobs_jserp-result_search-card",
    "content": "Sr. Manager, APAC Services\nPall Corporation  กรุงเทพมหานคร\n16 ชั่วโมงก่อน  ผู้สมัคร 114 คน\n  \nดูบุคคลที่ Pall Corporation ได้ว่าจ้างสำหรับตำแหน่งนี้\nสมัคร \nบันทึกThe Sr. Manager, APAC Services has a leadership role in the Pall Industrial (PI) Service organization, reporting to the Global PI Service leader.\n\nThe SM is expected to drive a culture of exceeding customer expectations to deliver outstanding customer service, thus accelerating Pall hardware placements and service revenues.\n\nSM will build cohesive relationships with FTAP and F&B Engineering, Product Support, Inside and Outside Sales, and Customer Service.\n\nCore duties include direct management responsibilities, ownership of customer satisfaction initiatives, employee development, and financial management responsibilities driving Service revenue and profit growth. The SM does not need to become a technical expert on Pall equipment. Developing a high-level understanding of the equipment and its capabilities will be sufficient.\n\nPosition Purpose:\n\nThis position is responsible for providing strategic direction, tactical leadership, and operational process improvements to create a sustainable competitive advantage through the effective leveraging of APAC’s service and field service resources. Achieve consistently high levels of customer satisfaction and loyalty through operational excellence in all after-market activities.\n\nPrimary Responsibilities:\n\nCustomer Satisfaction\n\n\nDrives a sense of urgency to ensure customer needs are addressed promptly\nExcellent follow-up skills to ensure we exceed customer expectations and close all outstanding issues\nStrong communication and listening skills\nAdvocate for the customer (internal and external) and a steward for the company\nUnderstands customer perception and the associated business impacts and is commercially capable of resolving customer issues in a rapid fashion\nExperienced with managing and resolving high-pressure customer issues, including product performance issues and technical escalations\nTaking over responsibility in all after-sales activities\n\n\nFinancial Management & Growth\n\n\nExcellent sales ability: both direct engagement in proposing and selling service agreements to customers and development of technicians to independently offer and sell service agreements (value selling principles)\nBasic understanding of or capacity to learn high-level financial statements and the quote to cash cycle of order processing - essentially understanding the impacts that key decisions have on the Pall Field Service and OpCo P&L.\nManage region expenses and investments to achieve annual operating profit target\nAble to effectively price and position Service agreements on both existing and new equipment, considering expected costs to proactively manage profit margin\n\n\nService Product Line Core Growth\n\n\nProduct Leadership: Partners with the Business Units to lead and ensure superior market analysis, needs-based segmentation, and competitive analysis. Specifically, provide segmentation for service product sales with new instruments/systems AND in the after-market. Segment, analyze, and develop strategies to penetrate off-brand service, parts, and consumable customers with service and consumable contracts. Drive product attractiveness and migration from self-maintenance to Pall service via high-value service contract offerings.\nService Sales Support – works with Service leadership team, BU Management, and Sales to help ensure the product line is optimally supported (e.g., resourced to win and high ROI) and results in the highest possible level of product line penetration and share gain.\nProduct Line Promotion – work with Marketing to ensure superior product line branding and architecture\n\n\nPeople Management & Leadership\n\n\nHighly skilled at employee development, including coaching, mentoring, and identifying opportunities for improvement\nCreates a culture of ownership and accountability – ensures associates understand their objectives and are provided the tools and guidance to be successful\nConstantly works to build the best team via detailed employee development plans and by recruiting the best internal and external talent\nCreates followership via action and integrity – builds a winning team culture and participates in driving the success\nMotivates employees and drives a cohesive cross-functional work atmosphere with a positive attitude. Increase field morale and expectations\n\n\nContinuous Improvement\n\n\nLeads by example to develop a robust continuous improvement culture\nAble to quickly identify systemic business issues and leverage team expertise and Danaher Business System (DBS) problem-solving tools to drive to the root cause – must be able to effectively manage and implement permanent countermeasures to drive a sustainable business advantage\nEnsures all processes are documented and improved via the use of kaizen (VSM, TPI, etc.)\nActs as a primary customer of DBS and leverages internal and external DBS expertise to map improvement plans and drive sustainable improvements\nDevelops and drives accountability around daily management and monthly KPI's\n\n\nSales Support\n\n\nFacilitate the installation of all-new equipment via the team of Field Service Engineers\nAble to fully comprehend the scope of commercial opportunities and support new installations and critical equipment trials by assigning optimal resources and deploying effective action plans\nPartners with Regional Sales Managers and Sales Engineers to price-competitive Service offerings to package with new equipment proposals\nDrive service business with direct communication and negotiation with end customers and distributors\nSupport Sales team in driving and managing the demonstrations with FSE's at customer sides\n\n\nField Service Organizational Leadership and Talent\n\n\nProvides leadership in a cross-functional environment, with the ability to lead, influence, and create followership amongst a large and highly diverse team of resources in EMEA\nProven ability to relentlessly recruit, hire, and develop top performers and develop and drive accountability across the organization. Adept at motivating, coaching, and inspiring the team toward a common set of goals and a vision that improves overall business performance and customer loyalty.\nDriven to realize results; does what it takes to accomplish business objectives.\nGeneral management experience and proven ability to work with all functions to deliver strong P&L performance and growth.\nPossesses maturity, sound business judgment, and the ability to constructively interact with key internal and external leaders to address complex business issues/opportunities successfully.\nProven ability to successfully deliver results while quickly adapting to changing priorities and unforeseen challenges.\nAbility to successfully manage multiple (and sometimes competing) priorities\n\n\nQualifications:\n\n\nInclination and ability to listen to various stakeholders (e.g., Customers, Sales) and generate actionable insights + provide leadership/direction\nSuccessfully deliver results while quickly adapting to changing priorities and unforeseen challenges\nCommunicate expectations regarding performance and hold people accountable for results\nAble to travel 25% - 50% of the time within the region\n\n\nEducation and Experience:\n\n\nBachelors (ideally in a technical, business, or engineering discipline)\nMaster's in Business a plus\n5+ years of prior field service management experience, technical management, or management in a field that requires regular customer interaction\nOrganization/talent development and daily management experience in a business-to-business capital goods environment where excellence in after-market support at the customer's place of business is a strategically important part of the overall value proposition\nCommercial experience, including direct selling of products or services and leading teams selling products and services.\nProven ability to drive strategic plans into tactical execution across a complex and multi-geo customer base.\nHighly computer literate (especially in Excel and PowerPoint; CRM, SAP and Service Management Software a plus)\nStrong deductive reasoning and problem-solving skills\n\n\nRelationships:\n\n\nReports to: Global Service Leader\nKey Relationships: Customer Service, Field Sales, Inside Sales, and Technical Support\nSupport to Quality Team, Marketing, and R&D\nDirect reports: 5\n\n\nWhen you join us, you’ll also be joining Danaher’s global organization, where 80,000 people wake up every day determined to help our customers win. As an associate, you’ll try new things, work hard, and advance your skills with guidance from dedicated leaders, all with the support of powerful Danaher Business System tools and the stability of a tested organization.\n\nAt Danaher, we value diversity and the existence of similarities and differences, both visible and not, found in our workforce, workplace and throughout the markets we serve. Our associates, customers and shareholders contribute unique and different perspectives as a result of these diverse attributes.\n\nIf you’ve ever wondered what’s within you, there’s no better time to find out.\nแสดงเพิ่มเติม \nระดับประสบการณ์\nไม่เกี่ยวข้อง\nประเภทการจ้างงาน\nงานเต็มเวลา\nหน้าที่งาน\nอื่น ๆ\nอุตสาหกรรม\nการวิจัยเทคโนโลยีชีวภาพ\n  \n\nคำรับรองเพิ่มโอกาสในการสัมภาษณ์ของคุณที่ Pall Corporation ได้ถึง 2 เท่า\n\nดูบุคคลที่คุณรู้จัก"
  },
  {
    "id": "SwpJM9Sw3WXTmgZG5VLgRQ",
    "url": "https://th.linkedin.com/jobs/view/business-development-and-sales-manager-at-genea-3774870149?refId=gfcwbaOzztjPyZ%2B2lBZlNw%3D%3D&trackingId=SwpJM9Sw3WXTmgZG5VLgRQ%3D%3D&position=16&pageNum=0&trk=public_jobs_jserp-result_search-card",
    "content": "Business Development and Sales Manager\nGenea  วาปีปทุม\n3 ชั่วโมงก่อน   มาเป็นหนึ่งในผู้สมัคร 25 คนแรก\n  \nดูบุคคลที่ Genea ได้ว่าจ้างสำหรับตำแหน่งนี้\nสมัคร\nบันทึกGenea is a eading provider of treatment for patients experiencing infertility problems, with more than 30 years of experience in the field. We have long been a fertility pioneer, with research and technologies developed in-house virtually doubling IVF success rates in the mid-nineties and continuing to improve outcomes today.\n\n\n\nJob Description\n\n\n\nWe currently have an opportunity for an experiencedBusiness Development and Sales managerto join Genea Thailand. In this role youwill work closely with our Managing Director and General Manager of Genea Thailand to identify new business opportunities and partnerships, as well as manage and develop existing partnerships.\n\n\n\nIn addition to this, you will oversee various marketing projects, working collaboratively with the marketing team to develop and implement effective strategies for promoting our fertility services to potential clinics and patients.\n\n\n\nQualifications\n\n\n\nTo be successful in this role will have astrong background in business development and relationship management, with experience in the healthcare industry,pharmaceuticals, and/or medical devices\n\n\n\nYou will have excellent communication and relationship-building skills, the ability to work independently and as part of a team, and a proven track record of driving business growth and building successful partnerships.\n\n\n\nIf you have a passion for healthcare and marketing, and a desire to make a positive impact in people's lives, we invite you to apply for this exciting opportunity with Genea\n\nแสดงเพิ่มเติม \nระดับประสบการณ์\nไม่เกี่ยวข้อง\nประเภทการจ้างงาน\nงานเต็มเวลา\nหน้าที่งาน\nการตลาด\nอุตสาหกรรม\nการผลิตอุปกรณ์ทางการแพทย์\n  \n\nคำรับรองเพิ่มโอกาสในการสัมภาษณ์ของคุณที่ Genea ได้ถึง 2 เท่า\n\nดูบุคคลที่คุณรู้จัก"
  },
  {
    "id": "zMPd7KAXb3f8IYs78aYKAQ",
    "url": "https://th.linkedin.com/jobs/view/sales-director-at-waas-asia-2910851825?refId=gfcwbaOzztjPyZ%2B2lBZlNw%3D%3D&trackingId=zMPd7KAXb3f8IYs78aYKAQ%3D%3D&position=17&pageNum=0&trk=public_jobs_jserp-result_search-card",
    "content": "Sales Director\nWaaS Asia  กรุงเทพมหานคร\n16 ชั่วโมงก่อน   มาเป็นหนึ่งในผู้สมัคร 25 คนแรก\n  \nดูบุคคลที่ WaaS Asia ได้ว่าจ้างสำหรับตำแหน่งนี้\nสมัคร\nบันทึกส่งข้อความโดยตรงถึงผู้ประกาศรับสมัครงานจาก WaaS Asia\n\nMelissa Vanhoecke\nMelissa Vanhoecke\nMarketing Manager at Ekopak Sustainable Water\n\nWaaS Asia is a part of European listed company, Ekopak Sustainable Water. Waas Asia provides sustainable water to its clients and assists them in reaching their global water reuse and recycling commitments. The business is currently active in Europe and Asia, and will later on expand to other markets. The business model is Water-as-a-Service (or BOO). WaaS Asia provides technology, financing, operation and maintenance and sells recycled process water to industrial customers. Find more information about: https://ekopak.be/en/\n\n\n\n\nJob Description\n\nThe sales director is responsible for selling industrial process water contracts. The position holder ensures that leads can be successfully turned into Water-as-a-Service contracts with multinational corporations and top local companies. The sales director is responsible for sales process from first contact with the clients up to contract signing. This position reports to the CEO of WaaS Asia.\n\n\n\n\nKey Responsibilities\n\n· Collect market and client information and share that with your colleagues.\n\n· Analyse the demand and identify market opportunities in SE-Asia. Contribute to the business strategy as a member\n\nof the Asian management team.\n\n· Initiate contacts and build close relationship with a wide range of prospective and current clients.\n\n· Assess customers industrial water process and translate the needs with the internal organisation, working closely\n\nwith the engineering teams in Europe and Asia.\n\n· Prepare the proposal together with the technical tender engineer and present the proposal to the client.\n\n· Lead the contract negotiations (long-term multi-million-dollar contracts) and agree commercial and legal terms.\n\n· Assess customers decision making process and engage with the stakeholders independently and together with the\n\nglobal sales organisation to acquire required approvals for contract signing.\n\n· Prepare accurate sales forecast and high-quality sales reporting.\n\n· Work with the internal teams (finance, technical, legal) on feasibility studies, preparation of proposals and closing\n\nsales contracts.\n\n\n\n\nThe candidate will occasionally be involved in various duties outside of their usual scope of work, such as project and business development work and admin tasks.\n\n\n\n\nExperience:\n\n· At least 10 years of experience in sales or business development ideally to manufacturing sector in SE-Asia.\n\n· Proven ability to manage long and complex sales cycle with multinational corporations, with a track record of\n\nsuccessful revenue attainment.\n\n· Good command of contract structures including legal and commercial terms.\n\n· Successful track record in contract negotiations ideally in F&B, FMCG, chemical or pharmaceutical industries.\n\n· A good network of contacts with the manufacturing, engineering, and/or purchasing functions in multinational\n\ncorporations operating in SE-Asia.\n\n· Understanding of wastewater and process water treatment technologies including ultra-filtration and reverse\n\nosmosis is a plus.\n\n\n\n\nCompetences:\n\n· Relevant university degree (Master or Bachelor), e.g. water treatment, engineering or business-related studies.\n\n· Advanced level of English, both written and spoken. Day-to-day language in the company is English.\n\n· Candidates must be computer literate. Advanced level in Outlook, Power Point and Excel is required.\n\n· Good commercial knowledge and proficiency in financial statements to understand profit drivers in the business.\n\n· Good communication, interpersonal skills and ability to read people.\n\n· Problem solving & decision making.\n\n· Willingness to travel as and when required.\n\n· Ability to work in a multicultural team.\n\n\n\n\nInterested in this job offer? Contact us at hello@waasasia.com\n\nแสดงเพิ่มเติม \nระดับประสบการณ์\nผู้อำนวยการ\nประเภทการจ้างงาน\nงานเต็มเวลา\nหน้าที่งาน\nSalesและการพัฒนาธุรกิจ\nอุตสาหกรรม\nบริการด้านสิ่งแวดล้อม\n  \n\nคำรับรองเพิ่มโอกาสในการสัมภาษณ์ของคุณที่ WaaS Asia ได้ถึง 2 เท่า\n\nดูบุคคลที่คุณรู้จัก"
  },
  {
    "id": "+HEJlWtqqw4z2Lg89u6Aew",
    "url": "https://th.linkedin.com/jobs/view/biology-teacher-at-oxbridge-international-school-3779524464?refId=gfcwbaOzztjPyZ%2B2lBZlNw%3D%3D&trackingId=%2BHEJlWtqqw4z2Lg89u6Aew%3D%3D&position=19&pageNum=0&trk=public_jobs_jserp-result_search-card",
    "content": "Biology teacher\nOxbridge International School  กรุงเทพมหานคร\n9 ชั่วโมงก่อน   มาเป็นหนึ่งในผู้สมัคร 25 คนแรก\n  \nดูบุคคลที่ Oxbridge International School ได้ว่าจ้างสำหรับตำแหน่งนี้\nสมัคร\nบันทึกAn exciting opportunity to work within a vibrant and dynamic International School in Tashkent, Uzbekistan, which boasts both the International Baccalaureate and local educational systems.\n\nAbout Oxbridge International School\n\nWe have 200+ employees so far working with us and 30+ of them are expats. There is a strong commitment to the on-going professional training of all staff and for providing leadership development at all levels. You can find videos of the school on Youtube and get the idea of the school, facilities and the team. Brilliant opportunity to save money, as the cost of living in Tashkent is very cheap.\n\nVery competitive package is provided.\n\nMain duties and responsibilities of the job:\n\nCollaboratively planning, preparing and delivering differentiated lessons\n\nAssessing and reporting student progress\n\nResponsible for student welfare and pastoral development of the class group\n\nMaintaining the learning environment of the classroom and managing resources\n\nOrganizing and taking part in school events, trips, and extra-curricular activities\n\nLine management of the teaching assistant\n\nThe ideal candidate will have:\n\nAt least Bachelor's degree\n\nPrevious experience\n\nThe ability to differentiate and deliver conceptual, engaging and inquiry-based lessons\n\nFamiliarity and experience with collaborative planning and a team-teaching approach\n\nA wonderful opportunity to discover Central Asia and work in one of the most dynamic schools of Tashkent, Uzbekistan. We have over 250 people working together to provide high quality education to the students and over 40 expats.\n\nPlease note that the job requires relocation!\n\nPowered by JazzHR\n\nWAzcMwYMX3\nแสดงเพิ่มเติม \nระดับประสบการณ์\nกึ่งอาวุโส\nประเภทการจ้างงาน\nงานเต็มเวลา\nหน้าที่งาน\nการศึกษาและฝึกงาน\nอุตสาหกรรม\nการเผยแพร่ทางอินเทอร์เน็ต\n  \n\nคำรับรองเพิ่มโอกาสในการสัมภาษณ์ของคุณที่ Oxbridge International School ได้ถึง 2 เท่า\n\nดูบุคคลที่คุณรู้จัก"
  },
  {
    "id": "HPM7P/ArAP8zbI8ROtWKwQ",
    "url": "https://th.linkedin.com/jobs/view/customer-success-manager-at-salient-3774153406?refId=gfcwbaOzztjPyZ%2B2lBZlNw%3D%3D&trackingId=HPM7P%2FArAP8zbI8ROtWKwQ%3D%3D&position=20&pageNum=0&trk=public_jobs_jserp-result_search-card",
    "content": "Customer Success Manager\nSalient  กรุงเทพมหานคร\n20 ชั่วโมงก่อน  ผู้สมัคร 47 คน\n  \nดูบุคคลที่ Salient ได้ว่าจ้างสำหรับตำแหน่งนี้\nสมัคร\nบันทึกส่งข้อความโดยตรงถึงผู้ประกาศรับสมัครงานจาก Salient\n\nRich Farrell\nRich Farrell\nSenior Talent Advocate @ Salient | Building High-Performing Sales Teams\n\nCustomer Success Manager\n\n\n\n\nClient Story\n\nThis fast-growth SaaS company founded 11 years ago has a world-class team spanning across 17 offices globally with 650+ employees.\n\n\n\n\nThey are leading the way with their full set of digital marketing solutions for their clients with the power of AI boasting over 1,000 brands.\n\n\n\n\nThis is an opportunity to be part of the growing team for Thailand and manage the customer success function of key accounts within the enterprise solutions business unit. For FY23, they reported over $14M in revenue and are continuing to expand across the APAC region.\n\n\n\n\nResponsibilities\n\nMaintain high levels of customer satisfaction to ensure client retention and account renewals\nDriving new customer onboarding and ongoing adoption through the development of use cases and feature usage\nDrive business value with customers using our Enterprise solutions\nRespond quickly and effectively to customers’ challenges and issues with the product\nCollaborate closely with internal Product and Tech Support teams\nWork cross-functionally across the organisation and different regions\n\n\n\n\nQualifications\n\nAt least 5 years of customer success or account management experience at a high-growth SaaS company (Ideally MarTech)\nStrategic thinker with deep analytical skills;\nStrong communicator and confident in engaging with stakeholders.\nAbility to speak to a technical audience (SaaS technical concepts, implementation guidelines) is deeply advantageous\nFast learner, ability to strive in a fast-paced environment\nIdeally experienced within a Start-up environment\nBilingual - Thai and English\n\nแสดงเพิ่มเติม \nระดับประสบการณ์\nกึ่งอาวุโส\nประเภทการจ้างงาน\nงานเต็มเวลา\nหน้าที่งาน\nSales การพัฒนาธุรกิจ และฝ่ายบริการลูกค้า\nอุตสาหกรรม\nการพัฒนาซอฟต์แวร์ บริการโฆษณา และบริการ IT และการให้คำปรึกษาด้าน IT\n  \n\nคำรับรองเพิ่มโอกาสในการสัมภาษณ์ของคุณที่ Salient ได้ถึง 2 เท่า\n\nดูบุคคลที่คุณรู้จัก"
  },
  {
    "id": "bT+J6pCuQqoPJX1PF8y77A",
    "url": "https://th.linkedin.com/jobs/view/mathematics-teacher-at-oxbridge-international-school-3779796461?refId=gfcwbaOzztjPyZ%2B2lBZlNw%3D%3D&trackingId=bT%2BJ6pCuQqoPJX1PF8y77A%3D%3D&position=23&pageNum=0&trk=public_jobs_jserp-result_search-card",
    "content": "Mathematics teacher\nOxbridge International School  กรุงเทพมหานคร\n3 ชั่วโมงก่อน   มาเป็นหนึ่งในผู้สมัคร 25 คนแรก\n  \nดูบุคคลที่ Oxbridge International School ได้ว่าจ้างสำหรับตำแหน่งนี้\nสมัคร\nบันทึกAn exciting opportunity to work within a vibrant and dynamic International School in Tashkent, Uzbekistan, which boasts both the International Baccalaureate and local educational systems.\n\nAbout Oxbridge International School\n\nWe have 200+ employees so far working with us and 30+ of them are expats. There is a strong commitment to the on-going professional training of all staff and for providing leadership development at all levels. You can find videos of the school on Youtube and get the idea of the school, facilities and the team. Brilliant opportunity to save money, as the cost of living in Tashkent is very cheap.\n\nVery competitive package is provided.\n\nMain duties and responsibilities of the job:\n\nCollaboratively planning, preparing and delivering differentiated lessons\n\nAssessing and reporting student progress\n\nResponsible for student welfare and pastoral development of the class group\n\nMaintaining the learning environment of the classroom and managing resources\n\nOrganizing and taking part in school events, trips, and extra-curricular activities\n\nLine management of the teaching assistant\n\nThe ideal candidate will have:\n\nAt least Bachelor's degree\n\nPrevious experience\n\nThe ability to differentiate and deliver conceptual, engaging and inquiry-based lessons\n\nFamiliarity and experience with collaborative planning and a team-teaching approach\n\nA wonderful opportunity to discover Central Asia and work in one of the most dynamic schools of Tashkent, Uzbekistan. We have over 250 people working together to provide high quality education to the students and over 40 expats.\n\nPlease note that the job requires relocation!\n\nPowered by JazzHR\n\nV2tXKZUZMt\nแสดงเพิ่มเติม \nระดับประสบการณ์\nกึ่งอาวุโส\nประเภทการจ้างงาน\nงานเต็มเวลา\nหน้าที่งาน\nการศึกษาและฝึกงาน\nอุตสาหกรรม\nการเผยแพร่ทางอินเทอร์เน็ต\n  \n\nคำรับรองเพิ่มโอกาสในการสัมภาษณ์ของคุณที่ Oxbridge International School ได้ถึง 2 เท่า\n\nดูบุคคลที่คุณรู้จัก"
  },
  {
    "id": "hqlGHtGHmGXWZYQQWcLLaw",
    "url": "https://th.linkedin.com/jobs/view/contract-manager-at-asian-trails-3778338248?refId=gfcwbaOzztjPyZ%2B2lBZlNw%3D%3D&trackingId=hqlGHtGHmGXWZYQQWcLLaw%3D%3D&position=24&pageNum=0&trk=public_jobs_jserp-result_search-card",
    "content": "Contract Manager\nAsian Trails  กรุงเทพมหานคร, ประเทศไทย\n23 ชั่วโมงก่อน  ผู้สมัคร 27 คน\n  \nดูบุคคลที่ Asian Trails ได้ว่าจ้างสำหรับตำแหน่งนี้\nสมัคร\nบันทึกส่งข้อความโดยตรงถึงผู้ประกาศรับสมัครงานจาก Asian Trails\n\nArnau Pons\nArnau Pons\nRegional Sourcing Manager\n\nThe key objective of this role is to establish, manage and optimise relationships with hotels. The successful candidate will improve the current portfolio by focusing on key hotels and local chains to consolidate and strengthen the Asian Trails brand as the top DMC in the online/offline business environment. The role will focus on performance, market opportunities and industry trends. Daily activities include efficient and proactive yielding as well as establishing and developing valued long-term partnerships with strategic planning and contracting of the assigned portfolio.\n\nแสดงเพิ่มเติม \nระดับประสบการณ์\nกึ่งอาวุโส\nประเภทการจ้างงาน\nงานเต็มเวลา\nหน้าที่งาน\nการจัดการและการผลิต\nอุตสาหกรรม\nการจัดการท่องเที่ยว\n  \n\nคำรับรองเพิ่มโอกาสในการสัมภาษณ์ของคุณที่ Asian Trails ได้ถึง 2 เท่า\n\nดูบุคคลที่คุณรู้จัก"
  },
  {
    "id": "5P8vOq1ZkdybyCnVVR2QEA",
    "url": "https://th.linkedin.com/jobs/view/regional-development-manager-thailand-at-pearson-3769090087?refId=gfcwbaOzztjPyZ%2B2lBZlNw%3D%3D&trackingId=5P8vOq1ZkdybyCnVVR2QEA%3D%3D&position=25&pageNum=0&trk=public_jobs_jserp-result_search-card",
    "content": "Regional Development Manager (Thailand)\nPearson  ประเทศไทย\n23 ชั่วโมงก่อน  ผู้สมัคร 73 คน\n  \nดูบุคคลที่ Pearson ได้ว่าจ้างสำหรับตำแหน่งนี้\nสมัคร \nบันทึกKey Accountabilities\n\n\nPromote Pearson’s Work Force Skills Vocational Qualifications and its services to all private schools in the assigned countries of APAC territory.\nProvide customers with a range of support, advisory, training and development services to support sales growth.\nSecure targeted growth against agreed targets, through maintaining existing business, developing opportunities within existing customer base for upselling or cross selling Pearson products.\nCollaborate with other account managers within the Line of Business or with others to upsell/cross-sell Pearson products and services.\nUse Sales Force on daily basis to build an effective sales pipeline through entering sales opportunities and analyzing data on a variety of critical business drivers.\nDevelop relationships at all levels of the customers’ organization to identify sales opportunities, networking and fact-finding to drive achievement of plans and objectives\nDevelop trusted advisor relationships to influence key stakeholders of vocational qualifications in the assigned territory including government, non-government organizations and vocational institutions to position Pearson as the preferred education solutions provider\nMaintain regular communication and conduct annual business review with the assigned key accounts\nProactively keep up to date on industry and customer specific issues\n\n\nPersonal Style and Behaviour  \n\nYou will be accurate, flexible and responsive; hard working, organised, enthusiastic and able to juggle multiple priorities. You will feel confident working alone as well as part of wider teams and be capable of learning quickly and tackling any challenge with energy and commitment. You will be able to communicate effectively with a range of stakeholders. \n\nSkills / Capabilities\n\nEssential \n\n\nA natural sales person. A rational, assertive and confident individual who can persuade customers and articulate business needs to management\nExcellent relationships management and interpersonal skills\nStrong analytical skills, including historical sales analysis, pricing, and forecasting.\nStrong communication, problem-solving, negotiation and influencing skills plus an ability to operate in a matrix-reporting environment.\nAble to operate effectively alone, and to work through challenges independently, as well as part of a multi-country team\nExcellent spoken and written command of English (and a Thai native speaker).\n\n\nDesirable \n\n\nExperience in using Sales Force\nExperience of working within the education sector  \n\n\nWork setup\n\nThis is a remote-working role.\n\nWhat To Expect From Pearson\n\nDid you know Pearson is one of the 10 most innovative education companies of 2022?\n\nAt Pearson, we add life to a lifetime of learning so everyone can realize the life they imagine. We do this by creating vibrant and enriching learning experiences designed for real-life impact. We are on a journey to be 100 percent digital to meet the changing needs of the global population by developing a new strategy with ambitious targets. To deliver on our strategic vision, we have five business divisions that are the foundation for the long-term growth of the company: Assessment & Qualifications, Virtual Learning, English Language Learning, Workforce Skills and Higher Education. Alongside these, we have our corporate divisions: Digital & Technology, Finance, Global Corporate Marketing & Communications, Human Resources, Legal, Strategy and Direct to Consumer. Learn more at We are Pearson.\n\nWe value the power of an inclusive culture and also a strong sense of belonging. We promote a culture where differences are embraced, opportunities are accessible, consideration and respect are the norm and all individuals are supported in reaching their full potential. Through our talent, we believe that diversity, equity and inclusion make us a more innovative and vibrant place to work. People are at the center, and we are committed to building a workplace where talent can learn, grow and thrive.\n\nPearson is an Affirmative Action and Equal Opportunity Employer and a member of E-Verify. We want a team that represents a variety of backgrounds, perspectives and skills. The more inclusive we are, the better our work will be. All employment decisions are based on qualifications, merit and business need. All qualified applicants will receive consideration for employment without regard to race, ethnicity, color, religion, sex, sexual orientation, gender identity, gender expression, age, national origin, protected veteran status, disability status or any other group protected by law. We strive for a workforce that reflects the diversity of our communities.\n\nTo learn more about Pearson’s commitment to a diverse and inclusive workforce, navigate to: Diversity, Equity & Inclusion at Pearson.\n\nIf you are an individual with a disability and are unable or limited in your ability to use or access our career site as a result of your disability, you may request reasonable accommodations by emailing ppsmhr@pearson.com.\n\nNote that the information you provide will stay confidential and will be stored securely. It will not be seen by those involved in making decisions as part of the recruitment process.\n\nJob: SALES\n\nOrganization: Workforce Skills\n\nSchedule: FULLTIME\n\nReq ID: 13871\n\n\nแสดงเพิ่มเติม \nระดับประสบการณ์\nไม่เกี่ยวข้อง\nประเภทการจ้างงาน\nงานเต็มเวลา\nหน้าที่งาน\nวิศวกรรมและเทคโนโลยีสารสนเทศ\nอุตสาหกรรม\nโปรแกรมบริหารการศึกษาและผู้ให้บริการ E-Learning\n  \n\nคำรับรองเพิ่มโอกาสในการสัมภาษณ์ของคุณที่ Pearson ได้ถึง 2 เท่า\n\nดูบุคคลที่คุณรู้จัก"
  }
]