[
  {
    "id": "aqepS3N6cr+/HbSI2ejPag",
    "url": "https://th.linkedin.com/jobs/view/customer-contact-centre-agent-at-ikea-3783489250?refId=V9FpIr73Mtl4I5%2Fdxmk0Yw%3D%3D&trackingId=aqepS3N6cr%2B%2FHbSI2ejPag%3D%3D&position=1&pageNum=0&trk=public_jobs_jserp-result_search-card",
    "content": "Customer Contact Centre Agent\nIKEA  ประเทศไทย\n19 ชั่วโมงก่อน   มาเป็นหนึ่งในผู้สมัคร 25 คนแรก\n  \nดูบุคคลที่ IKEA ได้ว่าจ้างสำหรับตำแหน่งนี้\nสมัคร\nบันทึกCompany Description\n\nIKEA is the world's largest home furnishing retailer with 460 stores across more than 60 countries. IKEA Thailand is part of Ikano Retail, one of 12 IKEA franchisees and the only one owned by the family of Ingvar Kamprad, who founded IKEA in 1943.\n\nIKEA Thailand creates a better everyday life by offering a wide range of well-designed, functional home furnishing products at prices so low, that as many people as possible can afford them. Ikano (Thailand) Ltd. owns and operates three omnichannel stores in Thailand, including IKEA Bangna, IKEA Bang Yai and IKEA Phuket. To learn more, visit IKEA.co.th\n\nJob Description\n\nAbout the job\n\nWe want to fill this position with a customer-focused enthusiast who can support us in securing the IKEA brand and our overall vision of “creating a better everyday life for the many people”.\n\nYour assignment\n\n\nYou will report to the Customer Contact Centre Team Leader, and will be responsible for providing an exceptional level of service to customers to support the IKEA stores in Thailand.\nYou will be expected to perform to the basic expectation of meeting your given metrics. In addition, you will be expected to adhere to your schedules where applicable.\nYour major mode of work will include answering inbound calls, making outbound calls, replying to emails and following up on cases.\n\n\nQualifications\n\nYour profile\n\n\nYou have at least 1 year of experience in a customer support role, preferably in a call centre, in a fast paced service/retail industry.\nYou share our belief that customer loyalty is a key to business success, and are passionate about home furnishings and customer service.\nYou enjoy interacting with people, communicate well, and have the desire to improve the experience of our customers. Possess a good command of English. Problem-solving, negotiation, and building trustful relationships come naturally to you.\nYou are also self-motivated, calm, empathetic, and customer focused. You know your business processes and how the customers perceive their situation, have the ability to prioritise, resolve, and make customers’ needs known.\nAs a contact centre agent, you are expected to contribute positively to your individual development, as well as your fellow co-workers by engaging in best practice sharing, process improvements and customer focused solutions sharing.\n\n\nAdditional Information\n\nPlease apply by 15 January 2024.\nแสดงเพิ่มเติม \nระดับประสบการณ์\nรองผู้จัดการ\nประเภทการจ้างงาน\nงานเต็มเวลา\nหน้าที่งาน\nฝ่ายบริการลูกค้า\nอุตสาหกรรม\nการค้าปลีก การผลิตเฟอร์นิเจอร์และของตกแต่งบ้าน และการผลิต\n  \n\nคำรับรองเพิ่มโอกาสในการสัมภาษณ์ของคุณที่ IKEA ได้ถึง 2 เท่า\n\nดูบุคคลที่คุณรู้จัก"
  },
  {
    "id": "ijgNgwGtaqIRAH713kl18A",
    "url": "https://th.linkedin.com/jobs/view/talent-management-leadership-development-manager-at-cpf-group-3777054651?refId=V9FpIr73Mtl4I5%2Fdxmk0Yw%3D%3D&trackingId=ijgNgwGtaqIRAH713kl18A%3D%3D&position=2&pageNum=0&trk=public_jobs_jserp-result_search-card",
    "content": "Talent Management & Leadership Development Manager\nCPF Group  กรุงเทพมหานคร, ประเทศไทย\n2 ชั่วโมงก่อน  ผู้สมัคร 38 คน\n  \nดูบุคคลที่ CPF Group ได้ว่าจ้างสำหรับตำแหน่งนี้\nสมัคร\nบันทึกJOB Opening: Talent Management & Leadership Development Manager\n\n\n\n\nRESPONSIBILITIES:\n\n\n\n\nResponsible for succession planning, early talent identification, pipelining and working in conjunction with talent acquisition to build or buy critical capabilities the business needs.\nUnderstands leadership talent development needs across the organization and leverages available programs, best practices, and solutions across the organization partnering and collaborating throughout with HRBP\nPartner with Head of Business Unit and HRBP for annual talent review and succession planning process including organizational talent assessment\nActs as an internal executive coach to senior leaders and key developing leaders, and assisting in key leadership development plans\nIn partnership with Learning & Development team, participate in and drive our learning & development strategy and tools, ensuring associates have opportunities to grow their capabilities\nDevelop and enhance the leadership capabilities and cascade these capabilities throughout the organization\n\n\n\n\nEDUCATION & EXPERIENCE:\n\nBachelor or Master Degree in HR, business administration, psychology or organization development or related field.\n5 Years related experience. Human Resources, Organization Development, Talent Management, and Development or similar experience with a minimum of 2 years’ experience dealing with senior executives\nDemonstrated track record of success in strategy creation, adoption and then building out the systems and processes to support their execution\nแสดงเพิ่มเติม \nระดับประสบการณ์\nกึ่งอาวุโส\nประเภทการจ้างงาน\nงานเต็มเวลา\nหน้าที่งาน\nทรัพยากรบุคคล การให้คำปรึกษา และฝึกงาน\nอุตสาหกรรม\nบริการอาหารและเครื่องดื่ม การค้าปลีก และบริการด้านทรัพยากรบุคคล\n  \n\nคำรับรองเพิ่มโอกาสในการสัมภาษณ์ของคุณที่ CPF Group ได้ถึง 2 เท่า\n\nดูบุคคลที่คุณรู้จัก"
  },
  {
    "id": "YEC0Gb9tStFleRDdHMpbNg",
    "url": "https://th.linkedin.com/jobs/view/head-of-hr-general-affairs-t%C3%BCrkiye-vietnam-based-at-cpf-group-3783884785?refId=V9FpIr73Mtl4I5%2Fdxmk0Yw%3D%3D&trackingId=YEC0Gb9tStFleRDdHMpbNg%3D%3D&position=3&pageNum=0&trk=public_jobs_jserp-result_search-card",
    "content": "Head of HR & General Affairs (Türkiye/Vietnam Based)\nCPF Group  กรุงเทพมหานคร, ประเทศไทย\n54 นาทีก่อน   มาเป็นหนึ่งในผู้สมัคร 25 คนแรก\n  \nดูบุคคลที่ CPF Group ได้ว่าจ้างสำหรับตำแหน่งนี้\nสมัคร\nบันทึกCompany Overview:\n\n\n\n\nThe CP Group, an international organization, which is the biggest animal food producer in the world, with an annual production of 1,100,000 tons, established its first animal food factory in Turkey, at Inegol in 1986.\n\nCP Turkey plays an important role in both animal food and poultry using its international technology and quality and it continues to contribute to the Country's economy. The CP Group is an international organization with great investments in broiler chick, poultry and cattle food, poultry, and processed meat products in many parts of the world and has been growing in Turkey steadily in the last 35 years with an investment of over 100 million dollars.\n\n\n\n\nCompany size: More than 1,000 employees\n\n\n\n\nJob Summary:\n\n\n\n\nAs a Head of HR & GA, you will be a key member of the management team, with the responsibility of implementing human resources initiatives, managing general administrative operations, and providing strategic leadership aligned with the organization's goals, policies, and compliance.\n\n\n\n\nKey Responsibilities\n\n\n\n\nManage overall HR functions execution and General affairs operations.\nPartner with business leaders to develop & execute HR & GA strategies to enhance the overall business success\nLead and guide the HR & GA teams in order to develop and implement policies and practices in compliance with local labor laws and regulations.\nOversee general administrative functions, including office supplies, facility management, and vendor relationships.\nEnsure the high service level of human resources and general affairs services to all functions in the Company.\n\n\n\n\nRequirements:\n\n\n\n\n8-10 years’ experience in human resource management.\nMinimum of 3 years' experience leading overall HR & General Affairs functions\nHighly motivated, adaptable, change-embraced, and strong interpersonal skills\nAbility to handle the pressure, work collaboratively in a dynamic and cross-cultural environment.\nAbility and willingness to learn Vietnamese and Vietnam labor laws and regulations.\nHaving flexibility in terms of time of work, work location, work environment and willingness to work aboard.\nแสดงเพิ่มเติม \nระดับประสบการณ์\nกึ่งอาวุโส\nประเภทการจ้างงาน\nงานเต็มเวลา\nหน้าที่งาน\nทรัพยากรบุคคล ฝึกงาน และการให้คำปรึกษา\nอุตสาหกรรม\nบริการอาหารและเครื่องดื่ม\n  \n\nคำรับรองเพิ่มโอกาสในการสัมภาษณ์ของคุณที่ CPF Group ได้ถึง 2 เท่า\n\nดูบุคคลที่คุณรู้จัก"
  },
  {
    "id": "h1wRRFhIBGLiqWkRRkKJdw",
    "url": "https://th.linkedin.com/jobs/view/people-strategic-project-management-shopee-at-shopee-3783827011?refId=V9FpIr73Mtl4I5%2Fdxmk0Yw%3D%3D&trackingId=h1wRRFhIBGLiqWkRRkKJdw%3D%3D&position=4&pageNum=0&trk=public_jobs_jserp-result_search-card",
    "content": "People Strategic Project Management (Shopee)\nShopee  กรุงเทพมหานคร\n6 ชั่วโมงก่อน   มาเป็นหนึ่งในผู้สมัคร 25 คนแรก\n  \nดูบุคคลที่ Shopee ได้ว่าจ้างสำหรับตำแหน่งนี้\nสมัคร \nบันทึกJob Description\n\n\nDevelop people strategies using framework, tools and methodology for related organizational development initiatives based on company goals and ambition, including corporate structure design, firmwide performance management, and career development initiatives. Conduct strategic review & analysis of overall People experience and key challenges, define root cause, and recommend solutions\nDevelop continuous process improvements to enhance organizational effectiveness and promote meaningful change for the organization\nPlan and lead end-to-end implementation of the recommended people solutions. Actively liaise and collaborate with cross-functional and cross-business stakeholders to develop and influence the execution of people strategies to drive growth and optimize people-related processes\nIn charge of overall PMO and presentations to management on People initiatives and updates\n\n\nRequirements\n\n\nBachelor degree in human resources management, business administration or related field;\nMinimum 5 years working experience\nPreferred consulting background with strong analytical skills and project management experience\nStrong stakeholder management skills, well-organized and able to manage multiple tasks efficiently\nFluent in English (written and spoken)\nProficient in Excel and Powerpoint\nแสดงเพิ่มเติม \nระดับประสบการณ์\nกึ่งอาวุโส\nประเภทการจ้างงาน\nงานเต็มเวลา\nหน้าที่งาน\nการบริหารโปรเจคและเทคโนโลยีสารสนเทศ\nอุตสาหกรรม\nเทคโนโลยี สารสนเทศ และอินเทอร์เน็ต\n  \n\nคำรับรองเพิ่มโอกาสในการสัมภาษณ์ของคุณที่ Shopee ได้ถึง 2 เท่า\n\nดูบุคคลที่คุณรู้จัก"
  },
  {
    "id": "hvBHtKlZ5sIVgxl2lP4pew",
    "url": "https://th.linkedin.com/jobs/view/project-manager-at-shopee-3735861539?refId=V9FpIr73Mtl4I5%2Fdxmk0Yw%3D%3D&trackingId=hvBHtKlZ5sIVgxl2lP4pew%3D%3D&position=7&pageNum=0&trk=public_jobs_jserp-result_search-card",
    "content": "Project Manager\nShopee  กรุงเทพมหานคร\n14 ชั่วโมงก่อน   ผู้สมัครมากกว่า 200 คน\n  \nดูบุคคลที่ Shopee ได้ว่าจ้างสำหรับตำแหน่งนี้\nสมัคร \nบันทึกJob Description\nDevelop detailed project plans to execute, monitor and track progress of initiatives (with priority of defining initiative success factors and showing impact in them)\nStudy and identify user pain points, evaluate gaps/ opportunities, and develop insightful recommendations on strategic direction to improve experiences\nPerform the related analysis and research of technical and business issues:\nLeverage a customer advisory board in order to conduct interview/focus group/survey to deep dive insights\nDesign user experience immersion trips (with support from insights team) and be able to synthesize findings and insights into sharings / workshops for relevant business stakeholders\nBuild consensus among cross-functional teams and influence decision-making within executive-level audiences\n\n\n\n\nRequirements\n\n\n\n\nProven ability and passion to empathize with users; we are looking for colleagues who are eager and willing to fight to make changes to bring smiles to users’ faces\n1-2 years of experience in project management/operations, and market research\nExperience leading complex operational and strategic initiatives\nBonus: expereince in one or more data analysis packages or databases, e.g., SQL, SAS, R, SPSS, Python, VBA and visualization tools, e.g. Tableau, Power BI, etc.\nStrong analytical skill and problem-solving skill with a solution-oriented mindset\nFlexible and adaptable; able to work under pressure\nHigh proficiency in Excel or data is a plus\nแสดงเพิ่มเติม \nระดับประสบการณ์\nกึ่งอาวุโส\nประเภทการจ้างงาน\nงานเต็มเวลา\nหน้าที่งาน\nการบริหารโปรเจคและเทคโนโลยีสารสนเทศ\nอุตสาหกรรม\nเทคโนโลยี สารสนเทศ และอินเทอร์เน็ต\n  \n\nคำรับรองเพิ่มโอกาสในการสัมภาษณ์ของคุณที่ Shopee ได้ถึง 2 เท่า\n\nดูบุคคลที่คุณรู้จัก"
  },
  {
    "id": "I9OJU5ipFMyySNuhiZTmtQ",
    "url": "https://th.linkedin.com/jobs/view/junior-web-developer-at-liss-solutions-3781898988?refId=V9FpIr73Mtl4I5%2Fdxmk0Yw%3D%3D&trackingId=I9OJU5ipFMyySNuhiZTmtQ%3D%3D&position=8&pageNum=0&trk=public_jobs_jserp-result_search-card",
    "content": "Junior Web Developer\nLiss Solutions  ประเทศไทย\n14 ชั่วโมงก่อน   มาเป็นหนึ่งในผู้สมัคร 25 คนแรก\n  \nดูบุคคลที่ Liss Solutions ได้ว่าจ้างสำหรับตำแหน่งนี้\nสมัคร \nบันทึกช่วงรายได้ที่ให้ข้อมูลโดย Liss Solutions\n\nช่วงนี้ให้ข้อมูลโดย Liss Solutions รายได้จริงของคุณจะขึ้นอยู่กับทักษะและประสบการณ์ของคุณ — พูดคุยกับเจ้าหน้าที่สรรหาของคุณเพื่อเรียนรู้เพิ่มเติม\n\nช่วงรายได้พื้นฐาน\nUS$14,400.00/ปี - US$21,600.00/ปี\nAre you passionate about web development and eager to kickstart your career in a dynamic and remote-friendly environment? Look no further than Liss Solutions, where we're on the lookout for a talented Junior Web Developer to join our team. If you have a knack for coding, a hunger for learning, and a desire to make your mark in the world of web development, we want to hear from you!\n\nThe Role\n\nYou Will Be Responsible For\n\n\nWriting well-designed, testable and efficient code.\nGathering and evaluating user feedback.\nWorking as a part of a dynamic team to deliver winning products.\nProviding code documentation and other inputs to technical documents.\nSupporting continuous improvement by investigating alternatives and new technologies and presenting these for architectural review.\nTroubleshooting and debugging to optimise performance.\n\n\nIdeal Profile\n\n\nYou possess a Degree/Diploma in Computer Science, Engineering or related field.\nYou have at least 1 year experience, ideally within a Software Engineer role.\nYou possess strong knowledge of HTML, HTML5 / CSS, Javascript and WordPress.\nYou are adaptable and thrive in changing environments\nYou are a self-starter and demonstrate a high level of resilience\nYou are a strong networker & relationship builder\n\n\nWhat's on Offer?\n\n\nLeadership Role\nOpportunity within company with a solid track record of success\nWork alongside & learn from best in class talent\nแสดงเพิ่มเติม \nระดับประสบการณ์\nประสบการณ์น้อย\nประเภทการจ้างงาน\nงานเต็มเวลา\nหน้าที่งาน\nวิศวกรรมและเทคโนโลยีสารสนเทศ\nอุตสาหกรรม\nการพัฒนาซอฟต์แวร์\n  \n\nคำรับรองเพิ่มโอกาสในการสัมภาษณ์ของคุณที่ Liss Solutions ได้ถึง 2 เท่า\n\nดูบุคคลที่คุณรู้จัก"
  },
  {
    "id": "cYiITSjrfqKzKamL09q9uw",
    "url": "https://th.linkedin.com/jobs/view/chief-financial-officer-cfo-at-major-development-pcl-3777895540?refId=V9FpIr73Mtl4I5%2Fdxmk0Yw%3D%3D&trackingId=cYiITSjrfqKzKamL09q9uw%3D%3D&position=12&pageNum=0&trk=public_jobs_jserp-result_search-card",
    "content": "Chief Financial Officer (CFO)\nMAJOR DEVELOPMENT PCL  เขตปริมณฑลกรุงเทพมหานคร\n19 ชั่วโมงก่อน   มาเป็นหนึ่งในผู้สมัคร 25 คนแรก\n  \nดูบุคคลที่ MAJOR DEVELOPMENT PCL ได้ว่าจ้างสำหรับตำแหน่งนี้\nสมัคร\nบันทึกRoles and Responsibilities\n\nSet financial strategies and goals. and investment of the company By coordinating work with the management team and the Board of Directors. Both annual goals and 3-5 year goals to create business growth\nSet strategies and be responsible for supervising accounting, finance and budget work to be systematic and efficient. and consistent with the company's financial strategic plan To comply with financial laws and regulations. Including the regulations of the stock exchange\nManage and prepare Financial Forecast and Budgeting Report and Analysis, including preparing various reports. In the responsibility of the company for use in management In order for the company to reach its financial goals according to its business plan. and is continuously developed and in accordance with the requirements of the law and the Stock Exchange\nTake responsibility for participating in decision making. and give advice in investment and financial to executives and company directors Including reviewing the company's investment budget. To be appropriate and achieve the objectives and strategies set\nResponsible for overseeing and managing the company's tax work. By planning and setting operational guidelines for maximum efficiency.\nOversee financial management of affiliated companies. and businesses in which the company has invested Monitor cash status and future cash projections Including preparing the company's capital plan. Both sources of funds are debt and equity. Including various investments\nDevelop work methods and teams to be more efficient\n\n\n\n\nQualifications\n\nHave an understanding of TFRS for PAEs, TFRS for NPAEs and tax laws related to real estate business.\nHave an understanding of the rules and regulations related to companies listed on the Stock Exchange of Thailand.\nHave an understanding of annual budget preparation. and project budgets for real estate businesses\nCan use Microsoft Excel well.\nCan use Microsoft Word/Power point well.\nHave good English communication skills (listening, speaking, reading, and writing).\nGraduated with a master's degree or higher in accounting, finance, business administration, economics or other related fields.\nCPA, CFA or other finance certificate is a plus.\nAt least 18 years of experience in accounting, finance, taxes, budgeting, and investment.\nPreviously held a management position in a large company listed on the stock exchange is a plus\nAt least 5 years of experience in financial accounting and real estate related businesses.\nHave high leadership and have skills in management, analysis, planning, and communication\n\n\n\n\nแสดงเพิ่มเติม \nระดับประสบการณ์\nผู้บริหาร\nประเภทการจ้างงาน\nงานเต็มเวลา\nอุตสาหกรรม\nอสังหาริมทรัพย์\n  \n\nคำรับรองเพิ่มโอกาสในการสัมภาษณ์ของคุณที่ MAJOR DEVELOPMENT PCL ได้ถึง 2 เท่า\n\nดูบุคคลที่คุณรู้จัก"
  },
  {
    "id": "tNRiud8kI8MD+7RKP+zI+A",
    "url": "https://th.linkedin.com/jobs/view/inside-sales-representative-thailand-future-opportunity-at-oracle-3783887586?refId=V9FpIr73Mtl4I5%2Fdxmk0Yw%3D%3D&trackingId=tNRiud8kI8MD%2B7RKP%2BzI%2BA%3D%3D&position=13&pageNum=0&trk=public_jobs_jserp-result_search-card",
    "content": "Inside Sales Representative - Thailand (Future Opportunity)\nOracle  กรุงเทพมหานคร\n55 นาทีก่อน   มาเป็นหนึ่งในผู้สมัคร 25 คนแรก\n  \nดูบุคคลที่ Oracle ได้ว่าจ้างสำหรับตำแหน่งนี้\nสมัคร\nบันทึกAre you passionate about sales and eager to excel in the dynamic world of Cloud Technology? If so, Oracle Cloud Inside Sales might be the perfect fit for you. Oracle is fully committed to the Cloud, leading the way in innovative Cloud solutions. With the #1 autonomous database, Oracle Cloud platform, and a suite of cutting-edge SaaS applications, we serve over 80,000 customers in the APAC region, solidifying our position as THE Cloud Company. If you're ready to advance your career by delivering effective, efficient, and commercially viable SaaS solutions to clients, consider joining our Cloud sales team for this pipeline job opportunity.\n\n\n\n\nWe have exciting opportunities within our team for dynamic individuals who are passionate, entrepreneurial, innovative, consultative, and believe in having fun while they work. In a high-pressure environment, a sense of humor is a plus, and we recognize your contributions with a competitive compensation and benefits package, alongside a world-class continuous training program in a structured environment.\n\n\n\n\nIn addition to generating pipelines, this role is pivotal in actively contributing to the closure of SaaS deals valued at under $50,000 USD, encompassing both volume selling (top-ups) and acquisition of new customers.\n\n\n\n\nWhat You Will Be Doing:\n\nAs an Inside Sales Representative, your primary focus is to generate demand for Oracle Cloud SaaS solutions and services within an assigned territory or vertical. You will also play a crucial role in closing SaaS deals valued at under $50,000 USD, including volume selling (top-ups) and acquiring new customers. You will:\n\n\n\n\nAct as the first point of contact for prospects, qualifying them and generating strong customer demand for Cloud SaaS solutions\nHunt for new SaaS business through various channels, leveraging your knowledge of Oracle products and services (training provided) and customer business priorities\nUtilize superior communication skills, both individually and in a team environment\nDemonstrate the ability to communicate using technical concepts\nWork towards achieving individual goals while contributing to the team's success\nPossess a working knowledge of Cloud technology and database solutions (an advantage)\nDisplay a strong desire for a long-term career in SaaS sales\n\n\n\n\nKey Responsibilities:\n\nSell Oracle SaaS solutions via phone and digital means, leveraging social media platforms\nSupport programmatic and inbound campaigns to build a healthy funnel of SaaS prospects/leads\nApply a consultative approach to understand and analyze clients' SaaS needs\nEffectively communicate the Oracle SaaS Value Proposition\nParticipate in 3-way solutioning calls with Sales, Pre-Sales, and Customers to advance SaaS leads\nSystematically qualify, generate, nurture, and progress an active SaaS sales pipeline that can be readily won\n\n\n\n\nWhat We Are Looking For:\n\nMinimum of 3-5 years of experience in tele-sales or a sales environment, preferably in dynamic IT or software sales\nGoal-oriented individual with a strong focus on achieving SaaS targets and numbers\nConfident and effective communicator\nCreative with strong SaaS solution selling skills\nFamiliarity with social media tools and technologies\nExperience in managing a high-volume sales pipeline\nExperience in selling or positioning SaaS cloud solutions in SaaS, IaaS & PaaS would be an advantage\nแสดงเพิ่มเติม \nระดับประสบการณ์\nรองผู้จัดการ\nประเภทการจ้างงาน\nงานเต็มเวลา\nหน้าที่งาน\nเทคโนโลยีสารสนเทศ Sales และการพัฒนาธุรกิจ\nอุตสาหกรรม\nบริการ IT และการให้คำปรึกษาด้าน ITและการพัฒนาซอฟต์แวร์\n  \n\nคำรับรองเพิ่มโอกาสในการสัมภาษณ์ของคุณที่ Oracle ได้ถึง 2 เท่า\n\nดูบุคคลที่คุณรู้จัก"
  },
  {
    "id": "2HIm5H4Yw7iijdQn4IkeOw",
    "url": "https://th.linkedin.com/jobs/view/project-management-officer-at-plan-b-media-public-company-limited-3783876219?refId=V9FpIr73Mtl4I5%2Fdxmk0Yw%3D%3D&trackingId=2HIm5H4Yw7iijdQn4IkeOw%3D%3D&position=14&pageNum=0&trk=public_jobs_jserp-result_search-card",
    "content": "Project Management Officer\nPlan B Media Public Company Limited  กรุงเทพมหานคร\n2 ชั่วโมงก่อน  ผู้สมัคร 37 คน\n  \nดูบุคคลที่ Plan B Media Public Company Limited ได้ว่าจ้างสำหรับตำแหน่งนี้\nสมัคร\nบันทึกส่งข้อความโดยตรงถึงผู้ประกาศรับสมัครงานจาก Plan B Media Public Company Limited\n\nApirak Sribavorntada\nApirak Sribavorntada\nManager - Talent Acquisition. Hiring for Account Director (Sport Business) and Account Executive\n\nWe are looking for experienced Project Management Officer (PMO) who will responsible for facilitating and optimizing project management processes across the organization. The position will need to collaborate with project managers, stakeholders, and related teams to ensure projects are executed efficiently, meet qualified standards, and achieve their objectives.\n\n\n\n\nBeing our PMO is to monitor project performance against key performance indicators (KPIs) and benchmarks. Identify project risks, assess their potential impact, and develop mitigation strategies. Facilitate risk management discussions and decisions with project teams. Coordinate regular communication between project teams, stakeholders, and leadership. Collaborate with stakeholders to gather project requirements, clarify expectations, and manage feedback. This role involves the project contract/documents issuing and make sure all the information is legal and yield benefits to the firm, monitoring progress, and implementing best practices to enhance project delivery.\n\n\n\n\n\n\n\nMoreover, you will be challenged to work directly with top management by joining business activities with CEO and tier 1 clients then support them to accomplish their requirements as smooth as it can be. And, surely, this position needs you to demonstrate problem-solving skills and the ability to address issues proactively and overcome all the obstacles unexpectedly arise anywhere anytime to ensure overall efficiency of the project management processes.\n\nแสดงเพิ่มเติม \nระดับประสบการณ์\nประสบการณ์น้อย\nประเภทการจ้างงาน\nงานเต็มเวลา\nหน้าที่งาน\nการบริหารโปรเจคและเทคโนโลยีสารสนเทศ\nอุตสาหกรรม\nการผลิตสื่อ\n  \n\nคำรับรองเพิ่มโอกาสในการสัมภาษณ์ของคุณที่ Plan B Media Public Company Limited ได้ถึง 2 เท่า\n\nดูบุคคลที่คุณรู้จัก"
  },
  {
    "id": "B+0kg/UHvAYTGAlEonzMPw",
    "url": "https://th.linkedin.com/jobs/view/marketing-manager-thailand-at-coins-ph-3778833587?refId=V9FpIr73Mtl4I5%2Fdxmk0Yw%3D%3D&trackingId=B%2B0kg%2FUHvAYTGAlEonzMPw%3D%3D&position=15&pageNum=0&trk=public_jobs_jserp-result_search-card",
    "content": "Marketing Manager (Thailand)\nCoins.ph  กรุงเทพมหานคร\n13 ชั่วโมงก่อน   มาเป็นหนึ่งในผู้สมัคร 25 คนแรก\n  \nดูบุคคลที่ Coins.ph ได้ว่าจ้างสำหรับตำแหน่งนี้\nสมัคร \nบันทึกJoin the Pioneer Crypto Brand in the Philippines!\n\nCoins is the most established crypto brand in The Philippines and has gained the trust of more than 18 million users. Through the easy-to-use mobile app, users can buy and sell a variety of different cryptocurrencies and access a wide range of financial services.\n\nCoins is fully regulated by the Bangko Sentral ng Pilipinas (BSP) and is the first ever crypto-based company in Asia to hold both Virtual Currency and Electronic Money Issuer licenses from a central bank.\n\nWhat you will do\n\n\nIdeates, strategizes, plans and executes marketing campaigns and initiatives to drive user acquisition, adoption and increase CLTV of Coins users\nManages social media, CRM, paid ads and community channels\nConceptualizes and executes promos to grow user base and drive CLTV\nMeasure and report on the performance of marketing campaigns, gain insight and assess against goals\nRecommends optimization strategies to improve performance\nAnalyzes customer behavior, user sentiments and competitor campaigns to inform marketing strategies\nDrives public relations initiatives to grow awareness and share of voice of Coins\nLiaises with compliance team to ensure that campaigns are align with SEC requirements\n\n\n\nWhat we required from you\n\n\nProven success in developing marketing plans and campaigns\nExperience with the relevant marketing channels and tools (digital, social media, and CRM among others)\nExcellent written and verbal communication skills in Thai and English\nStrong project management, multitasking, and decision-making skills\nMetrics-driven marketing mind with eye for creativity\nKnowledgeable in fintech, web3 and cryptocurrency\n\n\n\nJoin the Coins Team Now!\n\nMeaningful Collaborations - The successful candidate will work cross-functionally with other relevant teams to carry out implementations that will improve and create an impact on customer experience.\n\nScalable Growth - Be part of a fast-growing organization with the vision to expand its territories outside APAC which will provide opportunities for career advancement.\n\nA Space For Bright Ideas - Let your bright ideas be converted into meaningful changes! Coins culture welcomes new ideas backed up by data to create an impact.\nแสดงเพิ่มเติม \nระดับประสบการณ์\nไม่เกี่ยวข้อง\nประเภทการจ้างงาน\nงานเต็มเวลา\nหน้าที่งาน\nการตลาดและSales\nอุตสาหกรรม\nการขนส่ง โลจิสติกส์ ซัพพลายเชนและการจัดเก็บและการเผยแพร่ทางอินเทอร์เน็ต\n  \n\nคำรับรองเพิ่มโอกาสในการสัมภาษณ์ของคุณที่ Coins.ph ได้ถึง 2 เท่า\n\nดูบุคคลที่คุณรู้จัก"
  },
  {
    "id": "T8RsDlyNJAE4Zo0q+kI1dQ",
    "url": "https://th.linkedin.com/jobs/view/account-manager-electronic-components-at-interine-components-co-ltd-3782000352?refId=V9FpIr73Mtl4I5%2Fdxmk0Yw%3D%3D&trackingId=T8RsDlyNJAE4Zo0q%2BkI1dQ%3D%3D&position=16&pageNum=0&trk=public_jobs_jserp-result_search-card",
    "content": "Account Manager- Electronic Components\nInterine Components Co., Ltd.  ประเทศไทย\n14 ชั่วโมงก่อน   มาเป็นหนึ่งในผู้สมัคร 25 คนแรก\n  \nดูบุคคลที่ Interine Components Co., Ltd. ได้ว่าจ้างสำหรับตำแหน่งนี้\nสมัคร \nบันทึกช่วงรายได้ที่ให้ข้อมูลโดย Interine Components Co., Ltd.\n\nช่วงนี้ให้ข้อมูลโดย Interine Components Co., Ltd. รายได้จริงของคุณจะขึ้นอยู่กับทักษะและประสบการณ์ของคุณ — พูดคุยกับเจ้าหน้าที่สรรหาของคุณเพื่อเรียนรู้เพิ่มเติม\n\nช่วงรายได้พื้นฐาน\nUS$30,000.00/ปี - US$60,000.00/ปี\nInterine is a top-level electronic components distributor in the Global with seven business areas in Singapore, Shenzhen, Suzhou, Hongkong, Taipei, Malaysia, Thailand, Philippines and Vietnam. We are committed to investing in our people, maintaining the highest safety standards, and creating a culture of growth and innovation. We offer competitive compensation and benefits packages to full-time, permanent associates.\n\nThe Role\n\nYour Responsibilities Will Include\n\n\nFocus on Electronics OEM/ODM/EMS.\nSetting sales goals and developing sales strategies.\nDevelop and execute strategies to drive business in new and existing markets.\nResearching prospects and generating leads.\nContacting potential and existing customers on the phone, email, and in person.\nHandling customer questions, inquiries, and complaints.\nPreparing and sending quotes and proposals.\nManaging the sales process through specific software programs.\nMeeting daily, weekly, and monthly sales targets.\nMeeting planned sales goals.\nParticipating in sales team meetings.\n\n\nIdeal Profile\n\n\nExperience in planning and implementing sales strategies.\nExperience in customer relationship management.\nExcellent written and verbal communication skills (English/Mandarin/Local Language).\nDedication to providing great customer service.\nTracking sales goals and reporting results as necessary.\nPromoting the organization and products.\nBachelor's degree or equivalent experience in Business\n2 years of sales experience in Electronic Components.\nExcellent written and verbal communication skills in English\n\n\nWhat's on Offer?\n\n\nRegional Role\nFlexible working options\nOpportunity to make a positive impact\nOpportunity within a company with a solid track record of performance\nแสดงเพิ่มเติม \nระดับประสบการณ์\nประสบการณ์น้อย\nประเภทการจ้างงาน\nงานเต็มเวลา\nหน้าที่งาน\nSalesและการพัฒนาธุรกิจ\nอุตสาหกรรม\nการผลิตเซมิคอนดัคเตอร์\n  \n\nคำรับรองเพิ่มโอกาสในการสัมภาษณ์ของคุณที่ Interine Components Co., Ltd. ได้ถึง 2 เท่า\n\nดูบุคคลที่คุณรู้จัก"
  },
  {
    "id": "jvHbZnojdzJqGg4cqSwkxg",
    "url": "https://th.linkedin.com/jobs/view/consumer-insights-manager-at-cpf-group-3765709193?refId=V9FpIr73Mtl4I5%2Fdxmk0Yw%3D%3D&trackingId=jvHbZnojdzJqGg4cqSwkxg%3D%3D&position=19&pageNum=0&trk=public_jobs_jserp-result_search-card",
    "content": "Consumer Insights Manager\nCPF Group  กรุงเทพมหานคร\n2 ชั่วโมงก่อน  ผู้สมัคร 107 คน\n  \nดูบุคคลที่ CPF Group ได้ว่าจ้างสำหรับตำแหน่งนี้\nสมัคร\nบันทึกPosition: Manager - Consumer Market Insight (CP-Meiji)\n\n\n\n\nResponsibilities\n\nResponsible for Domestic B2C on Shopper Panel, Brand Tracking, New Product Development Research, or ad-hoc research focusing in Thailand market.\nDeliver meaningful insight and foresight of Thailand market analysis synthesizing trend, market, consumer and shopper data by identifying issue and opportunity to commercial team action plan.\nBe a part of Domestic CMI B2C team to drive “Data driven culture” by optimizing cross function knowledge and utilization of Shopper Panel, Brand Health Tracking, and Domestic Consumer data insight.\n\n\n\n\nKNOWLEDGE AND SKILLS:\n\nResearch and analytical thinking skill\n\n-Able to analyze market and category understanding using Syndicated Data & Brand Tracking\n\n-Able to manage quantitative and/or qualitative research methodologies with minimal supervision\n\n-Ability to utilize and integrate all data sources and translate into relevant business insight and opportunity\n\nCritical thinking\nBusiness analysis & strategy\nKnowledge on Syndicated Tools e.g. Kantar World Panel, NielsenIQ, EGG data\n\n\n\n\nQualifications\n\nBachelor degree or above in marketing, economics, or statistics\nMinimum 3-5 years in research with solid background in:\n\nFirst Priority: Consumer & Shopper Insight quantitative & qualitative research and Brand Health Tracking.\n\nSecond Priority: Syndicated data: Kantar World Panel, NielsenIQ, POS data, Loyalty Card data.\n\nExperience in market analysis by using Syndicated data and turn in to actionable insights.\nExperience in developing, executing, and leading analysis both consumer research and shopper research.\nFluent in English language with good communication skill and presentation skill.\nDetail oriented, but with ability to look at the bigger picture and story telling.\nAbility to work individually (end-to-end) and cross-functional team environment.\n\n\n\n\nInterested candidate please submit your full English resume with your current and expected remuneration package directly to: karun.k@cpf.co.th\n\nแสดงเพิ่มเติม \nระดับประสบการณ์\nกึ่งอาวุโส\nประเภทการจ้างงาน\nงานเต็มเวลา\nหน้าที่งาน\nการตลาด การวิจัย และการให้คำปรึกษา\nอุตสาหกรรม\nการผลิต บริการอาหารและเครื่องดื่ม และบริการวิจัย\n  \n\nคำรับรองเพิ่มโอกาสในการสัมภาษณ์ของคุณที่ CPF Group ได้ถึง 2 เท่า\n\nดูบุคคลที่คุณรู้จัก"
  },
  {
    "id": "5OndLbi+H36sBsLQQm1ikg",
    "url": "https://th.linkedin.com/jobs/view/global-operations-esh-director-at-hoya-vision-care-3783495375?refId=V9FpIr73Mtl4I5%2Fdxmk0Yw%3D%3D&trackingId=5OndLbi%2BH36sBsLQQm1ikg%3D%3D&position=20&pageNum=0&trk=public_jobs_jserp-result_search-card",
    "content": "Global Operations ESH Director\nHoya Vision Care  กรุงเทพมหานคร, ประเทศไทย\n18 ชั่วโมงก่อน  ผู้สมัคร 37 คน\n  \nดูบุคคลที่ Hoya Vision Care ได้ว่าจ้างสำหรับตำแหน่งนี้\nสมัคร\nบันทึกส่งข้อความโดยตรงถึงผู้ประกาศรับสมัครงานจาก Hoya Vision Care\n\nGloria Fang\nGloria Fang\nAssociate Director, Executive Recruiting & Talent Acquisitions\n\nPosition Title: Global Operation ESH Director\n\nReporting to: Chief Operating Officer - HVC\n\nTotal team size: approx.10\n\nLocation: Bangkok, Thailand\n\n\n\n\nThe Company\n\nHoya Group: The Hoya Group is a diversified multinational company and leading supplier of innovative high-tech and healthcare products. HOYA constantly strives to create new value through innovation based on its advanced optics technologies. Our 36,000 employees in more than 80 countries and regions strive to provide indispensable products and services to contribute to create a healthy and prosperous society.\n\nHOYA Vision Care: For over 80 years, the HOYA Vision Care division, which is a part of the HOYA Group, has been a global leader in optical technology innovation. As a manufacturer of high-quality eyeglass lenses, HOYA continuously strives towards finding the best vision solutions designed to optimally equip eyecare professionals to change the way people see the world every day. Founded in Japan in 1941, HOYA Vision Care has a presence in over 80 countries across the globe today.\n\n\n\n\nThe position\n\nHVC business has 3 regions: APAC, EMEA, and U.S. As Global Operation ESH Director, you will be taking care of overall ESH business activity in order to ensure the effective policy, implementation, and engage of related stakeholders.\n\nThis position is to influence site, regional, and global business partners to drive prioritization of regulatory compliance, continuous performance improvement, and integration of ESH performance objectives into standard work processes. Have a strong compliance mind set, draws on direct manufacturing and Commercial experience and develop strategies to achieve these goals in alignment with company business objectives and values. Self-motivated, reliable, and persistent as well as energized and motivated by identifying and developing talent.\n\nMust be collaborative and enthusiastic with a focus on the global ESH business activity.\n\n\n\n\nBelow is primary Activities:\n\nDemonstrate accountability and responsibility for Environment, Health, Safety and performance and compliance through active participation and promotion of our Company's ESH Program. Assure compliance objectives and team goals are achieved per requirements.\nProvide expert advice and technical guidance for ESH programs and projects. Serve as a key person accountable for implementing and maintaining the effectiveness of the ESH management system.\nIdentify and develop talent at all levels of the organization.\nInterface with Corporate, Division, plant and external community organizations/agencies regarding ESH issues and strategy. Serve as single ESH point of contact for HVC.\nDevelop solutions that are progressive, innovative, compliant, and scalable. Demonstrate robust portfolio and project management and rapid disciplined decision-making.\nDrive continuous improvement, innovation, and sustainable results across ESH projects/programs, ESH assessments and resulting action plans; ensure identified actions are completed in accordance with identified target dates.\nReview and/or approve regulatory permits, inspection outcomes and audit report findings to assure appropriate submission, impact, and/or action. Develops/oversees solutions and reports status readily to executive management.\nAnticipate, recognize, and respond to changing internal and external trends, market conditions, regulatory legislation, etc., and evaluate and integrate the information to define the potential effect on the company/network.\nFacilitate leadership team cohesion, assure rapid communication, and best practice sharing with peers/management. Prospectively function as a conduit of information between the operating facilities and ESH management for overall HVC. Own decisions and be accountable for outcomes.\n\n\n\n\nKey Stakeholders\n\no Reporting manager: Chief Operating Officer\n\no Global Operation Management Team (Global Mass, Global RX, Global Engineering, Global QA, and Global SCM), and also Reginal, country leadership team.\n\n• Local and global functions the role will closely work with HR, Compliance, Finance, and others\n\n\n\n\nRequired candidate attributes.\n\nBachelor ’s Degree required (should have a concentration in Engineering, Environmental Science or related technical discipline).\nMasters/MBA; Relevant professional certification (preferred).\nSkills to be successful:\nHas direct experience in leading multiple geographically dispersed sites, matrixed functions, or manufacturing operations within the pharmaceutical, chemical or other like industry.\nClear and recognizable appreciation of the processes, equipment and methods associated with manufacturing.\nMust be willing to tackle tough issues with tact and diplomacy in a timely fashion.\nProven experience leading a site program such as Manufacturing, Research, Tech Ops function, Quality, or ESH Plant Leadership in the pharmaceutical or chemical industry.\nRobust skills in interpreting and applying regulatory frameworks such OSHA , OHSAS 18000, EPA, ISO, NFPA,GMP\nStrong leadership, talent management, change execution, and financial management skills. Readily and actively contributes to the success of the global team.\nAbility to simultaneously balance and adjust to multiple changing priorities and make decisions with speed, discipline, and accuracy.\nRobust interpersonal, written, and verbal communication; visible proclivity for collaboration and driving improved outcomes.\nDemonstrated ability to successfully negotiate with regulatory agencies and senior operations leaders; escalates issues rapidly to point of resolution.\nVision and sound judgment with a willingness to influence and offer new ideas; ability to develop strategy and execute tactically.\nExcellent coaching & development experience, development of people, and succession planning. Builds and cultivates strong collaborative relationships with stakeholders.\nAbility to distill complex issues and concepts into frameable and relevant communications or escalations.\nDeclarative and provides strong sponsorship of own, line, or executive management decisions.\nUp to 25% international travel is required\nแสดงเพิ่มเติม \nระดับประสบการณ์\nผู้อำนวยการ\nประเภทการจ้างงาน\nงานเต็มเวลา\nหน้าที่งาน\nอื่น ๆ\nอุตสาหกรรม\nการผลิตอุปกรณ์ทางการแพทย์ การผลิตผลิตภัณฑ์ของใช้ส่วนตัว และการผลิตยา\n  \n\nคำรับรองเพิ่มโอกาสในการสัมภาษณ์ของคุณที่ Hoya Vision Care ได้ถึง 2 เท่า\n\nดูบุคคลที่คุณรู้จัก"
  },
  {
    "id": "AKpwflbInVWWWCvzqqo+6A",
    "url": "https://th.linkedin.com/jobs/view/hrd-culture-staff-at-lg-electronics-3782445556?refId=V9FpIr73Mtl4I5%2Fdxmk0Yw%3D%3D&trackingId=AKpwflbInVWWWCvzqqo%2B6A%3D%3D&position=23&pageNum=0&trk=public_jobs_jserp-result_search-card",
    "content": "HRD & Culture - Staff\nLG Electronics  เขตมหานครพัทยา\n55 นาทีก่อน   มาเป็นหนึ่งในผู้สมัคร 25 คนแรก\n  \nดูบุคคลที่ LG Electronics ได้ว่าจ้างสำหรับตำแหน่งนี้\nสมัคร\nบันทึกส่งข้อความโดยตรงถึงผู้ประกาศรับสมัครงานจาก LG Electronics\n\nRuchakorn Sabaidee\nRuchakorn Sabaidee\nHRD & Culture Staff at LG Electronics\n\nResponsibilities\n\n• Identify and analyze training needs to prepare training plan.\n\n• Organize and arrange both the In-house and Public training classes based on the Training year plan.\n\n• Prepare, Coordinate and submit all documents to the Department of Skill Development required by government organization\n\n• Manage the training budget and ensure its efficiency.\n\n• Become an internal instructor and develop a training course .\n\n• Share information with employees by designing and creating an internal newsletter.\n\n• Support current and future business needs through employee development, engagement, motivation, and retention\n\n\n\n\nQualifications\n\n• GPA of 2.70 and Above (TOEIC score of 500 is a plus)\n\n• Bachelor’s degree of Human Resources Management, Political Science, Social Science, Psychology or other related fields.\n\n• 0-2 years of working experience (New grads are welcome)\n\n• A strong desire to help people grow and develop their skills.\n\n• Creative thinking, Can-do attitude, Interpersonal skills, Service-minded and Team working.\n\n• Strong ability to communicate and present in both Thai and English.\n\n• Proficiency in Microsoft Office Excel, PowerPoint, or related software.\n\n\n\n\nLocation\n\n192 Moo 1 , Pluakdaeng Road, Tambon Tasith, Ampur Pluakdaeng, Rayong 21140\n\n\n\n\nContact person\n\nMr. Ruchakorn S. (Pond) / email : ruchakorn.sabaidee@lge.com\n\nแสดงเพิ่มเติม \nระดับประสบการณ์\nประสบการณ์น้อย\nประเภทการจ้างงาน\nงานเต็มเวลา\nอุตสาหกรรม\nการผลิตคอมพิวเตอร์และเครื่องใช้ไฟฟ้า\n  \n\nคำรับรองเพิ่มโอกาสในการสัมภาษณ์ของคุณที่ LG Electronics ได้ถึง 2 เท่า\n\nดูบุคคลที่คุณรู้จัก"
  },
  {
    "id": "MlSSciGOHlCa0ICntFqroA",
    "url": "https://th.linkedin.com/jobs/view/business-transformation-manager-at-betagro-group-3783486289?refId=V9FpIr73Mtl4I5%2Fdxmk0Yw%3D%3D&trackingId=MlSSciGOHlCa0ICntFqroA%3D%3D&position=25&pageNum=0&trk=public_jobs_jserp-result_search-card",
    "content": "Business Transformation Manager\nBetagro Group  กรุงเทพมหานคร\n19 ชั่วโมงก่อน  ผู้สมัคร 73 คน\n  \nดูบุคคลที่ Betagro Group ได้ว่าจ้างสำหรับตำแหน่งนี้\nสมัคร\nบันทึกOverview: The Transformation Office (TO) is the heart of our transformation – setting the pace and direction of the program, overseeing execution across functions, and debottlenecking challenges. TO performance manages through executing TO cadence, maintaining a single source of truth, and cultivating a transformation mindset\n\nBusiness Transformation Manager has the unique opportunity, to see the business end-to-end through driving a rigorous process, managing program transparency, and mobilizing senior leadership.\n\n\n\n\nMain Account abilities:\n\nSupport TO cadence (i.e., key transformation meetings)\n\nOperationally support TO meetings (e.g., prepare meeting invitations, take / send / and close-loop on meeting actions, issue/print meeting materials, produce high quality presentation material)\n\nTogether with TO manager, set priorities for the program (e.g., update TO meeting template - include participant list, agenda, and targeted deep dives)\n\nProvide ad-hoc problem solving and work with key stakeholders to drive issues to resolution in (e.g., develop targets, transformation rules of engagement, reconcile actual financials with other sources, develop communications drafts (including workshop materials))\n\nBrief CTO on issues/update (in structured top-down manner, as needed), facilitate discussion / present in meetings(as needed), and serve as thought partner in probing initiative rationale (e.g., questions to push problem solving, clarifications)\n\nMaintain TO tools and process\n\nCreate / manage users on initiative performance management tool, update dashboards and configuration based on evolving business need, and support workstreams in data quality (i.e., valuation and workplan)\n\nSupport executive communication, reporting, change management\n\nCoordinate with stakeholders to create communications content (e.g., lessons learned, transformation sharing / celebrations, change stories, program guidance documents, etc.)\n\nUnderstand business need and data sources to provide answers to the relevant questions, structure dashboards and automate reports to minimize the time required to repeat the analysis\n\nModify and reconcile reports when underlying data structures change, use judgement\n\nIdeal candidate profile\n\nHave a can-do attitude\nAbility to work effectively in a fast-paced environment\nHas a growth mindset, and is open-minded and willing to try new things\nAbility to collaborate cross-functionally and communicate well with roles of all levels\nPassion for/ attention to detail\nInsatiable curiosity for impact (how do I create more impact, faster)\nPragmatic problem-solver (80/20)\n\nRequired skills:\n\nExpertise in Microsoft Office applications (i.e., Excel, PowerPoint)\nFluent oral and communication skills in local language and English\n\nPreferred Qualifications\n\nBasic understanding of the agricultural food/ consumer industry\nExperience in dashboard design and management\nSharp problem-solving\nExperience in project management role involving senior executives is a plus\n\nแสดงเพิ่มเติม \nระดับประสบการณ์\nผู้อำนวยการ\nประเภทการจ้างงาน\nงานเต็มเวลา\nหน้าที่งาน\nการพัฒนาธุรกิจ\nอุตสาหกรรม\nบริการอาหารและเครื่องดื่ม\n  \n\nคำรับรองเพิ่มโอกาสในการสัมภาษณ์ของคุณที่ Betagro Group ได้ถึง 2 เท่า\n\nดูบุคคลที่คุณรู้จัก"
  },
  {
    "id": "Lo2ymTTZXn9oJyc/6L8kfA",
    "url": "https://th.linkedin.com/jobs/view/strategic-and-bi-shopeefood-at-shopee-3705171590?refId=SFmX%2F%2FjdCI5wya3R73zPRQ%3D%3D&trackingId=Lo2ymTTZXn9oJyc%2F6L8kfA%3D%3D&position=1&pageNum=1&trk=public_jobs_jserp-result_search-card",
    "content": "Strategic and BI (ShopeeFood)\nShopee  กรุงเทพมหานคร\n14 ชั่วโมงก่อน  ผู้สมัคร 70 คน\n  \nดูบุคคลที่ Shopee ได้ว่าจ้างสำหรับตำแหน่งนี้\nสมัคร \nบันทึกJob Description\n\n\n\n\nStrategically design and improve monthly KPI to drive the organization to reach the target\nAnalyze complex data to find valuable insight in order to drive performance\nDemonstrate leadership to guide the overall project requirements in initiation, planning, execution, monitoring, evaluation and closure\nOrganize and optimize project resources (budget, timeline, workforce)\nCoordinate with internal teams and external partners to solve errors\n\n\n\n\nRequirements\n\n\n\n\nMinimum Bachelor's degree in management, business or any related field\nMinimum 3 years of work experience in related fields\nStrong Excel skill is required\nBasic SQL skill is required\nGood communication and presentation skills, both speaking and written in Thai and English\nStrong analytical skill and able to make judgment based on logical reasons\nGood team players and leadership skills with growth mindset\nDemonstrated ability to learn fast, handle multiple tasks, to prioritize those tasks and meet deadlines\nFlexible in working hours (issues that require attention can occur outside normal working hours)\nแสดงเพิ่มเติม \nระดับประสบการณ์\nกึ่งอาวุโส\nประเภทการจ้างงาน\nงานเต็มเวลา\nหน้าที่งาน\nการพัฒนาธุรกิจและSales\nอุตสาหกรรม\nเทคโนโลยี สารสนเทศ และอินเทอร์เน็ต\n  \n\nคำรับรองเพิ่มโอกาสในการสัมภาษณ์ของคุณที่ Shopee ได้ถึง 2 เท่า\n\nดูบุคคลที่คุณรู้จัก"
  },
  {
    "id": "X9YakfanM6jzDvxJfzwTyQ",
    "url": "https://th.linkedin.com/jobs/view/vice-president-%E2%80%93-finance-%E2%80%93-southeast-asia-at-dp-world-3781830531?refId=SFmX%2F%2FjdCI5wya3R73zPRQ%3D%3D&trackingId=X9YakfanM6jzDvxJfzwTyQ%3D%3D&position=2&pageNum=1&trk=public_jobs_jserp-result_search-card",
    "content": "Vice President – Finance – Southeast Asia\nDP World  เขตปริมณฑลกรุงเทพมหานคร\n22 ชั่วโมงก่อน  ผู้สมัคร 31 คน\n  \nดูบุคคลที่ DP World ได้ว่าจ้างสำหรับตำแหน่งนี้\nสมัคร\nบันทึกVice President (VP) – Finance is a newly created position to support our Southeast Asia (SEA) cluster freight-forwarding growth. As our VP Finance leader, you'll wield the power of numbers, transforming data into strategic insights and financial alchemy. You'll be the financial storyteller, painting a compelling narrative of growth and stability to captivate stakeholders and investors alike. Your financial acumen will be the compass guiding us, steering the SEA cluster towards prosperous horizons. Join us in shaping the financial chronicles of tomorrow, where your leadership will be the cornerstone of our triumphs, illuminating the path to enduring success.\n\n\n\n\n\n\n\nKey Accountabilities\n\nA strategic finance business partner to senior leadership, contributing to the overall success of the SEA cluster. Overseeing the financial, audit, tax and accounting function and teams, you will be partnering with leadership teams to provide financial insights, guidance, integrating finance into the strategic decision-making process. This can include profitability analysis, cost-benefit analysis, and performance metrics.\nDevelop business models, as necessary, to assist with strategic initiatives and drive financial stability, growth, and compliance.\nOversee financial reporting, ensuring that accurate and timely financial statements, reports, and disclosures are prepared for management and/or global/regional offices, and regulatory authorities.\nPartner with senior leadership team to align financial strategies with overall business objectives. This involves long-term financial planning and budgeting.\nDevelop and implement standards, procedures, internal controls, and processes in accordance with relevant accounting standards, legal regulatory and company policies and procedures.\nPreparation of budgets and forecasting and statutory and internal audits; and tax reporting and compliance.\nProvide leadership and create a rewarding team-based culture, including mentorship and development of staff.\nSupport the setup of new business operations. Positively drive agreed initiatives, propose new initiatives, and adopt a sense of continuous improvement.\nAdoption of new finance technologies/systems and oversee the implementation of Oracle Financials in the Region/Head Offices.\n\n\n\n\n\n\n\nQualifications, Skills and Experience\n\nBachelor’s degree in finance or accounting.\nQualified Chartered Accountant with minimum 15 years’ experience from multinational companies and/or familiarity with Logistics/Supply Chain industries.\nProven experience and knowledge of financial accounting standards and local regulatory requirements.\nExperience in Accounts Finalizations, MIS Reporting, Tax Compliance and Accounts supervision.\nSound judgement and analytical thinking that enables decision making, ability to manage projects and prioritize and manage timelines.\nExceptional communications, relationship-building and organizational skills.\nDriven, analytical, hands-on, and detailed-oriented.\nProven leadership skills to develop and motivate a team.\nAdvanced proficiency with MS Excel and familiarity with Oracle Fusion would be an asset.\n\n\n\n\nAbout DP World\n\nTrade is the lifeblood of the global economy, creating opportunities and improving the quality of life for people around the world. DP World exists to make the world’s trade flow better, changing what’s possible for the customers and communities we serve globally.\n\n\n\n\n\n\n\nWith a dedicated, diverse and professional team of more than 106,500 employees from 158 nationalities, spanning 73 countries on six continents, DP World is pushing trade further and faster towards a seamless supply chain that’s fit for the future. In Asia Pacific, DP World employs more than 7,000 people, and has ports and terminals in 18 locations.\n\n\n\n\n\n\n\nWe’re rapidly transforming and integrating our businesses -- Ports and Terminals, Marine Services, Logistics and Technology – and uniting our global infrastructure with local expertise to create stronger, more efficient end-to-end supply chain solutions that can change the way the world trades.\n\n\n\n\n\n\n\nWhat's more, we're reshaping the future by investing in innovation. From intelligent delivery systems to automated warehouse stacking, we’re at the cutting edge of disruptive technology, pushing the sector towards better ways to trade, minimising disruptions from the factory floor to the customer’s door.\n\n\n\n\n\n\n\nWE MAKE TRADE FLOW\n\nTO CHANGE WHAT'S POSSIBLE FOR EVERYONE\n\nแสดงเพิ่มเติม \nระดับประสบการณ์\nผู้บริหาร\nประเภทการจ้างงาน\nงานเต็มเวลา\nหน้าที่งาน\nSalesและการพัฒนาธุรกิจ\nอุตสาหกรรม\nการขนส่ง โลจิสติกส์ ซัพพลายเชนและการจัดเก็บ\n  \n\nคำรับรองเพิ่มโอกาสในการสัมภาษณ์ของคุณที่ DP World ได้ถึง 2 เท่า\n\nดูบุคคลที่คุณรู้จัก"
  },
  {
    "id": "OM21gYUMAQqqzdbCEEeVdw",
    "url": "https://th.linkedin.com/jobs/view/sales-representive-ecommerce-saas-software-at-chat%2B%2B-leyan-technology-3781899455?refId=SFmX%2F%2FjdCI5wya3R73zPRQ%3D%3D&trackingId=OM21gYUMAQqqzdbCEEeVdw%3D%3D&position=3&pageNum=1&trk=public_jobs_jserp-result_search-card",
    "content": "Sales Representive (eCommerce SaaS software)\nCHAT++ (Leyan Technology)  กรุงเทพมหานคร\n14 ชั่วโมงก่อน   มาเป็นหนึ่งในผู้สมัคร 25 คนแรก\n  \nดูบุคคลที่ CHAT++ (Leyan Technology) ได้ว่าจ้างสำหรับตำแหน่งนี้\nสมัคร \nบันทึกช่วงรายได้ที่ให้ข้อมูลโดย CHAT++ (Leyan Technology)\n\nช่วงนี้ให้ข้อมูลโดย CHAT++ (Leyan Technology) รายได้จริงของคุณจะขึ้นอยู่กับทักษะและประสบการณ์ของคุณ — พูดคุยกับเจ้าหน้าที่สรรหาของคุณเพื่อเรียนรู้เพิ่มเติม\n\nช่วงรายได้พื้นฐาน\n฿362,520.00/ปี - ฿725,040.00/ปี\nChat++is an artificial intelligence chat robot software that provides services for thousands of sellers/brands in Southeast Asia's popular e-commerce market, such as Shopee, Lazada, Tiktok, Tokopedia, etc. With our leading AIGC technology, Chat++has significantly improved sales conversion rates, reduced returns/refunds, increased return rates, and received more positive feedback, saving labor costs. Help our customers make their business healthier and stronger.\n\nOur company Leyan Technology is a leading provider of artificial intelligence technology in the world. We have more than 50000 top sellers in China on Taobao, Tiktok and PDD.\n\nThe Role\n\nWe are seeking an enthusiastic and results-driven Sales Representative to champion the sales of our innovative AI chatbot solutions tailored for e-commerce customer service. With our highly attractive compensation structure consisting of a competitive base pay combined with a generous commission, the potential for earnings is exceptional. This is a golden opportunity for the right candidate to thrive in a rapidly evolving market while reaping the financial benefits of their hard work.\n\nKey Responsibilities\n\n\nLead Generation & Sales Conversion: Identify, engage, and convert potential leads in the e-commerce industry.\nProduct Presentation: Showcase the unique features, benefits, and potential ROI of our AI chatbot solution to potential clients.\nClient Relationships: Cultivate and maintain relationships with new and existing clients, ensuring their needs are consistently met and surpassed.\nSales Targets: Achieve and exceed monthly and quarterly sales targets, leveraging our competitive compensation package.\nFeedback Loop: Collaborate with product development and technical teams, relaying valuable client and prospect feedback.\nSales Documentation: Prepare and maintain essential sales documentation, including proposals, contracts, and sales reports.\n\n\nIdeal Profile\n\n\nBachelor's degree or above\nStrong self-motivation and result orientation\nSoftware sales experience preferred, eCommerce software sales experience is a big plus\nNative Mandarin speaking, fluent Thai speaking in order to effectively liaise with the Stakeholders of the region\n[Location] Bangkok, Thailand\n\n\nWhat's on Offer?\n\n\nOpportunity to make a positive impact\nWork alongside & learn from best in class talent\nA role that offers a breadth of learning opportunities\nแสดงเพิ่มเติม \nระดับประสบการณ์\nกึ่งอาวุโส\nประเภทการจ้างงาน\nงานเต็มเวลา\nหน้าที่งาน\nSalesและการพัฒนาธุรกิจ\nอุตสาหกรรม\nเทคโนโลยี สารสนเทศ และอินเทอร์เน็ตและการพัฒนาซอฟต์แวร์\n  \n\nคำรับรองเพิ่มโอกาสในการสัมภาษณ์ของคุณที่ CHAT++ (Leyan Technology) ได้ถึง 2 เท่า\n\nดูบุคคลที่คุณรู้จัก"
  },
  {
    "id": "fmSmgiOSSeaHGHxSOGNm9g",
    "url": "https://th.linkedin.com/jobs/view/graphic-designer-and-social-media-executive-at-pls-3782002109?refId=SFmX%2F%2FjdCI5wya3R73zPRQ%3D%3D&trackingId=fmSmgiOSSeaHGHxSOGNm9g%3D%3D&position=5&pageNum=1&trk=public_jobs_jserp-result_search-card",
    "content": "Graphic Designer and Social Media Executive\nPLS  ประเทศไทย\n14 ชั่วโมงก่อน   มาเป็นหนึ่งในผู้สมัคร 25 คนแรก\n  \nดูบุคคลที่ PLS ได้ว่าจ้างสำหรับตำแหน่งนี้\nสมัคร \nบันทึกPLS Pte Ltd, a Singapore-based company, was established in 2012, driven by a team of software veterans providing software solutions in intralogistics, infrastructure, and industrial automation.\n\nThe Role\n\nYour Responsibilities Will Include\n\n\nTaking brand ownership and devising the brand strategy, including setting style guides, brand guidelines, brand vision, and value proposition for the short and long term in a B2B company.\nTranslating brand strategy into the brand plan and go-to-market strategy.\nPlanning and execution of communications and media actions across offline, online, and social media.\nConceptualizing and developing design concepts, graphics, and layouts.\nDesigning and producing collateral in accordance with brand guidelines.\nDeveloping and implementing comprehensive digital marketing programs in line with brand plans and business priorities.\nWorking with content marketing experts to create suitable content for each stage of a customer’s digital journey.\nReviewing and optimizing the design and content of all online assets, including the company website and social media pages.\nTaking a \"design brief\" to understand requirements.\nPresenting ideas, concepts, and design solutions to various stakeholders.\nIdentifying design problems and devising elegant solutions.\nPlanning and executing viral marketing campaigns across a range of social media platforms.\nRegularly monitoring user analytics and using these insights to drive strategies to secure downloads and improve customer engagement.\n\n\nIdeal Profile\n\nSkills Required\n\n\nYou have at least 5 years of experience ideally in Design, Brand / Product Management, or Digital Marketing within the IT industry.\nYou are a good multi-tasker who can work within tight deadlines.\nYou possess excellent communication and interpersonal skills and can articulate your ideas to different stakeholders.\nYou have experience in Social Media / Viral Marketing, App Marketing, and Graphic Design, which would be a strong advantage.\nYou are a strong team player who can manage multiple stakeholders\nYou enjoy finding creative solutions to problems\nYou pay strong attention to detail and deliver work that is of a high standard\n\n\nWhat's on Offer?\n\n\nA chance to accelerate your career\nWork from Home\nแสดงเพิ่มเติม \nระดับประสบการณ์\nประสบการณ์น้อย\nประเภทการจ้างงาน\nงานเต็มเวลา\nหน้าที่งาน\nการออกแบบ ศิลปะ/งานสร้างสรรค์ และเทคโนโลยีสารสนเทศ\nอุตสาหกรรม\nการพัฒนาซอฟต์แวร์และการขนส่ง โลจิสติกส์ ซัพพลายเชนและการจัดเก็บ\n  \n\nคำรับรองเพิ่มโอกาสในการสัมภาษณ์ของคุณที่ PLS ได้ถึง 2 เท่า\n\nดูบุคคลที่คุณรู้จัก"
  },
  {
    "id": "Oo+QR53EzENmfpVpskasJw",
    "url": "https://th.linkedin.com/jobs/view/assistant-grab-support-operations-manager-at-grab-3783608134?refId=SFmX%2F%2FjdCI5wya3R73zPRQ%3D%3D&trackingId=Oo%2BQR53EzENmfpVpskasJw%3D%3D&position=7&pageNum=1&trk=public_jobs_jserp-result_search-card",
    "content": "Assistant Grab Support Operations Manager\nGrab  เชียงใหม่\n18 ชั่วโมงก่อน   มาเป็นหนึ่งในผู้สมัคร 25 คนแรก\n  \nดูบุคคลที่ Grab ได้ว่าจ้างสำหรับตำแหน่งนี้\nสมัคร\nบันทึกJob Description\n\nLife at Grab\n\nAt Grab, every Grabber is guided by The Grab Way, which spells out our mission, how we believe we can achieve it, and our operating principles - the 4Hs: Heart, Hunger, Honour and Humility. These principles guide and help us make decisions as we work to create economic empowerment for the people of Southeast Asia.\n\nGet to know the Team\n\nThe incumbent is responsible for the smooth operational processes that our customer experience, when they interact with the Grab platform across the contact center touch-points. He/She is required to have the ability to manage a team of high-performing customer experience agents across voice/digital platforms, while meeting the expectations of stakeholders from various verticals like GrabFood, GrabCar, GrabTaxi, GrabExpress, etc.\n\nGet to know the Role\n\nYou will help the organization to identify and prioritize customer feedback and create/ensure smooth processes that support operations.\n\nThe Day-to-Day Activities\n\n\nLead the way in processing smooth customer support transactions across various programs and platforms in order to meet the performance metrics of the contact centers.\nCreate positive customer experience via the voice, and non-voice channels (email).\nTrain and develop a team of customer experience agents to ensure the team is meeting both productivity and quality in delivering the best customer experience to Grab customers and partners.\nPerform daily briefing sessions in communicating and ensuring understanding to all team members for existing and new product launch.\nMonitor agent's tardiness and work closely with planner to ensure optimum working schedule which include leaves and overtime.\nAuthorized to approve all cancellation, refund and reimbursement within the approved limitation.\nPerform manager call back whenever deemed necessary for escalated cases.\nNotification/escalate problems or issues to related departments in order to reduce the impact on customer satisfaction.\nPerform monthly audits and coaching derives from audits outcome in order to ensure all Grab customer experience's processes and standard are adhered at all times\nManage all disciplinary issues that arise within the team and work closely with HR and agency personnel to ensure prompt action is taken in a fairly and timely manner.\nPrepare monthly reports to be submitted to management related to team productivity, quality, feedback or any other reports required for continuous improvement.\nWork closely with other team managers from various verticals to ensure pending cases are solved within a timely manner.\nManage agent performance evaluation and feedback session.\nInvolved in any performance improvements project assigned by management in order to achieve better processes to strive for excellent customer experience.\n\n\nThe Must-Haves\n\n\nMinimum 1-5 years of contact center/customer service management experience\nMinimum of Bachelor’s degree in Tourism, Hospitality, or related\n5 working days a week\nAble to work on shift timing (shifts rotating schedule 24/7) and public holiday\nAble to work on Fluent at English OR Chinese competencies\nProven people management skills\nProven customer support experience or Live Chat experience\nLeadership Flair with the skill to motivate others to perform and exceed expectations\nProfessional, proactive, positive and \"can-do\" attitude\nStrong analytical skills with logical thinking\nAbility to multi-task, prioritize and manage time effectively\nAbility to handle stressful situation appropriately\nExcellence in MS Excel; able to use Pivot, Vlookup, Quick Analysis\n\n\nOur Commitment\n\nWe are committed to building diverse teams and creating an inclusive workplace that enables all Grabbers to perform at their best, regardless of nationality, ethnicity, religion, age, gender identity or sexual orientation and other attributes that make each Grabber unique.\nแสดงเพิ่มเติม \nระดับประสบการณ์\nกึ่งอาวุโส\nประเภทการจ้างงาน\nงานเต็มเวลา\nหน้าที่งาน\nการจัดการและการผลิต\nอุตสาหกรรม\nเทคโนโลยี สารสนเทศ และอินเทอร์เน็ต\n  \n\nคำรับรองเพิ่มโอกาสในการสัมภาษณ์ของคุณที่ Grab ได้ถึง 2 เท่า\n\nดูบุคคลที่คุณรู้จัก"
  },
  {
    "id": "kF8hzLX0eu+0bpqKqV9J0w",
    "url": "https://th.linkedin.com/jobs/view/president-chief-sales-officer-m-f-d-apac-at-k%C3%B6rber-pharma-3783841827?refId=SFmX%2F%2FjdCI5wya3R73zPRQ%3D%3D&trackingId=kF8hzLX0eu%2B0bpqKqV9J0w%3D%3D&position=8&pageNum=1&trk=public_jobs_jserp-result_search-card",
    "content": "President / Chief Sales Officer (m/f/d) APAC\nKörber Pharma  กรุงเทพมหานคร\n6 ชั่วโมงก่อน   มาเป็นหนึ่งในผู้สมัคร 25 คนแรก\n  \nดูบุคคลที่ Körber Pharma ได้ว่าจ้างสำหรับตำแหน่งนี้\nสมัคร \nบันทึกThe President & CSO Körber Pharma APAC is responsible for managing and developing Körbers Business Area (BA) Pharma business in APAC according to the strategic plan of the BA. This role reports directly into the CSO of Körber Pharma.\n\nThe President & CSO is fully responsible for all Sales- and Service Hubs in the regionas well as for all regional sales managers. He additionally manages all agents in this region.\n\nYour role in our team\n\n\n\nExpand market share and drive sales activities in the APAC region for Körber Pharma Machinery, Consulting and Digital with all customer groups such as Pharma, CMOs, Med Tech, Biotech\nP & L responsibility together with our sales & service hub leaders\nWork closely with our Affiliates' technical sales, as well as BA's global key account management\nTake the ownership and responsibility for order intake in the APAC region including annual budget planning together with our affiliates and agrees prices with those\nMaintain excellent relationships with multinational customers headquartered in APAC and coordinate all activities globally with these customers\nTogether with the team, ensure holistic customer understanding and is responsible for the exploitation of customer potential, i.e. new customer acquisition, as well as development of existing customers with a close customer proximity (local for local)\nEnsure that your sales staff, as well as sales representatives, have sufficient product knowledge\nSelect, manage and further develop our sales representatives in the region\nSole responsibility for the budget planning with the sales representatives in the region\nEnsure cross-BA exchange amongst the Körber Group within his region, in particular to promote Körber Ecosystem Selling\nDrive innovation (such as Market intelligence) in alignment with our global strategies in the business area and business units and monitor the market for strategic related opportunities\nWorking with our CRM system; lost and won order reporting\n\n\n\nYour profile\n\n\n\nA Master’s degree in science or business is required.\nA minimum 10 years of experience and knowledge in technical sales and a minimum of 5 years of management experience is preferred\nExperience and a strong network in the pharma market or other regulated industries, as well as experience with FDA or similar regulated businesses, and with GMP\nProven track record in executive, especially market facing, roles in pharma businesses with P&L responsibility\nExperience in growing and leading a regional sales organization including C-Level customer interaction, high leadership and people management skills, in-depth experience in strategic planning and execution of sales strategy\nUnderstanding of digitization efforts in the process industry\nStrong sales pipeline creator and strategic thinker\nHigh accountability and strong sense of ownership\nStrong leadership with people management skills and “winning” personality with excellent communication skills and relationship building skills\nHands-on mentality with strong customer and result orientation\nStrong business orientation and execution focus\nExperience in a corporate context as well as with small and medium sized enterprises, and the ability to work both in a corporate as well as SME environment - internationally\nStrong inter-cultural awareness, promoting diversity in every aspect\nLanguage proficiency: excellent English level. Knowledge of at least one additional language is preferable\nแสดงเพิ่มเติม \nระดับประสบการณ์\nผู้บริหาร\nประเภทการจ้างงาน\nงานเต็มเวลา\nหน้าที่งาน\nSalesและการพัฒนาธุรกิจ\nอุตสาหกรรม\nการผลิตยา\n  \n\nคำรับรองเพิ่มโอกาสในการสัมภาษณ์ของคุณที่ Körber Pharma ได้ถึง 2 เท่า\n\nดูบุคคลที่คุณรู้จัก"
  }
]