[
  {
    "id": "U4MP8KX/T5cKCqA0Bm7GeA",
    "url": "https://th.linkedin.com/jobs/view/events-manager-sea-at-netflix-3765589209?refId=I6rrr%2B%2FU0zf%2FLdCEBn8IjQ%3D%3D&trackingId=U4MP8KX%2FT5cKCqA0Bm7GeA%3D%3D&position=1&pageNum=0&trk=public_jobs_jserp-result_search-card",
    "content": "Events Manager, SEA\nNetflix  กรุงเทพมหานคร\n19 ชั่วโมงก่อน   ผู้สมัครมากกว่า 200 คน\n  \nดูบุคคลที่ Netflix ได้ว่าจ้างสำหรับตำแหน่งนี้\nสมัคร \nบันทึกNetflix aspires to provide great entertainment for people everywhere from the world's best creators across movies, TV series, documentaries, comedy and more. Our members have control over what they watch, when and where. It's an amazing time to join the Netflix team as we continue to transform entertainment. If you are a talented public relations executive with a passion for content and entertainment, keep reading!\n\n\nAbout The Role\n\nWe are looking to hire a go-getter, creative events manager who can lead the development and delivery of world class events from in-person to virtual and everything in between across South East Asia (SEA) for external and internal audiences. From external-facing events to internal employee-facing events; you should be able to blend strategic thinking with execution at scale. You should not be afraid to push the envelope and bring new ideas to the table, as well as experiment with the latest tools and technologies to elevate our events into unique-to-Netflix experiences. You will have amazing attention to detail, the ability to see the big picture and clearly articulate your vision to internal and external stakeholders, as well as the ability to partner seamlessly, and execute flawlessly in countries across SEA for local and global titles. In bringing titles to life, you will partner seamlessly with a regional team of seasoned event professionals while collaborating with local PR, Content, Marketing teams.\n\nThe role combines project management with partnerships, strategic thinking, execution and the smart use of resources for maximum impact. You will need to have strong cross-functional relationships to create, shape, execute and manage events for Netflix content. The successful candidate will be curious about promotional efforts - paying attention to creativity, concept, quality, and time constraints - and will seek to add value and improve campaigns with new and innovative event ideas.\n\n\nThe Work\n\n\n\nCreative conceptualization, crafting of creative proposals and quotations\nInformed captain on all things events, proactively collating feedback and perspectives from cross-functional partners, including title and market publicists, Photo & AV Studio, Editorial & Publishing, to deliver impactful event campaign strategies\nPartner with key stakeholders across multiple disciplines to align on the narratives to build through events\nProduce creative and well-executed experiences that are consumer-centric and unique to Netflix\nAdaptable to hybrid or virtual events, with knowledge of what it takes online and off, including the latest tools, platforms and technologies to bring our vision to life\nExternal vendor and agency management and supervision\nProvide team with strategic direction on sourcing of venues, vendors, entertainment and event related requirements\nSuperior project, budget and time management skills, within tight deadlines\n\n\n\n\nThe Candidate Must\n\n\n\nMinimum 10 yrs of events experience preferably from the entertainment industry that includes managing, executing, planning and staffing events at an agency, studio, network or with a brand (experience in film or television awards campaigns is a bonus)\nA self starter who is able to work independently, and under pressure, while consistently exercising sound judgment even when faced with ambiguity\nResourceful strategic thinker and creative problem solver\nAbility to pivot quickly and maintain a positive attitude and sense of humor\nArticulate what is and is not required to deliver a successful campaign\nBe transparent and unafraid to challenge, ask questions or call out obstacles\nAgile with meticulous attention to details\nExcellent organizational skills and ability to roll up your sleeves to get things done\nExcellent communication in Thai and English fluency is a plus\nExperience working in the Asia-Pacific region is a plus\n\n\n\nThe Netflix culture attracts talents who exhibit good judgment, innovation, selflessness, courage, impact, candid communication, passion, and curiosity. Read our culture memo. If it resonates with you, maybe you’re the right person to join our team.\n\nWe are an equal opportunity employer and celebrate diversity, recognizing that diversity of thought and background builds stronger teams. We approach diversity and inclusion seriously and thoughtfully. We do not discriminate on the basis of race, ethnicity, religion, color, place of birth, sex, gender identity or expression, sexual orientation, age, marital status, military service status or disability status.\nแสดงเพิ่มเติม \nระดับประสบการณ์\nไม่เกี่ยวข้อง\nประเภทการจ้างงาน\nงานเต็มเวลา\nหน้าที่งาน\nการจัดการและการผลิต\nอุตสาหกรรม\nผู้ให้บริการด้านความบันเทิง เทคโนโลยี สารสนเทศ และอินเทอร์เน็ต และภาพยนตร์ วิดีโอ และเสียง\n  \n\nคำรับรองเพิ่มโอกาสในการสัมภาษณ์ของคุณที่ Netflix ได้ถึง 2 เท่า\n\nดูบุคคลที่คุณรู้จัก"
  },
  {
    "id": "LS1ReqLHyEekvCEiUiU85g",
    "url": "https://th.linkedin.com/jobs/view/head-of-product-200k-at-routekey-3779625308?refId=I6rrr%2B%2FU0zf%2FLdCEBn8IjQ%3D%3D&trackingId=LS1ReqLHyEekvCEiUiU85g%3D%3D&position=2&pageNum=0&trk=public_jobs_jserp-result_search-card",
    "content": "Head of Product (200k)\nRoutekey  กรุงเทพมหานคร, ประเทศไทย\n3 ชั่วโมงก่อน   มาเป็นหนึ่งในผู้สมัคร 25 คนแรก\n  \nดูบุคคลที่ Routekey ได้ว่าจ้างสำหรับตำแหน่งนี้\nสมัคร\nบันทึกAt Routekey, we're working with a dynamic and innovative tech company that pioneers cutting-edge solutions in e-commerce. We are seeking a visionary and strategic thinker to lead our product team as the Head of Product. The ideal candidate will be responsible for overseeing the entire product lifecycle, from conceptualization to launch and iteration, while aligning with the company's business objectives and user needs.\n\n\n\n\nResponsibilities:\n\nDevelop and execute the product strategy, roadmap, and vision, ensuring alignment with business goals and market demands.\nLead and inspire a high-performing product team, fostering a culture of innovation, collaboration, and continuous improvement.\nCollaborate cross-functionally with engineering, design, marketing, and other departments to deliver exceptional products that meet user needs and drive business growth.\nConduct market research, gather user feedback, and analyze data to identify trends and opportunities, guiding product decisions and improvements.\nDrive product development through agile methodologies, prioritizing features, and delivering timely releases.\nDefine and monitor KPIs to assess product performance and iterate based on insights and feedback.\n\n\n\n\nQualifications:\n\nProven experience in product management, with at least 3 years in a leadership role within the tech industry.\nDemonstrated success in delivering innovative products to market, preferably in e-commerce\nStrong analytical skills with the ability to interpret data and trends to drive product strategy and decision-making.\nExcellent leadership, communication, and stakeholder management skills.\nแสดงเพิ่มเติม \nระดับประสบการณ์\nกึ่งอาวุโส\nประเภทการจ้างงาน\nงานเต็มเวลา\nหน้าที่งาน\nเทคโนโลยีสารสนเทศ การจัดการสินค้า และกลยุทธ์/การวางแผน\nอุตสาหกรรม\nบริการข้อมูล เทคโนโลยี สารสนเทศ และอินเทอร์เน็ต และการค้าปลีก\n  \n\nคำรับรองเพิ่มโอกาสในการสัมภาษณ์ของคุณที่ Routekey ได้ถึง 2 เท่า\n\nดูบุคคลที่คุณรู้จัก"
  },
  {
    "id": "gfarilbnbT5a5kjmwQzvQA",
    "url": "https://th.linkedin.com/jobs/view/director-strategic-marketing-b2b-at-vinarco-group-of-companies-3779186374?refId=I6rrr%2B%2FU0zf%2FLdCEBn8IjQ%3D%3D&trackingId=gfarilbnbT5a5kjmwQzvQA%3D%3D&position=3&pageNum=0&trk=public_jobs_jserp-result_search-card",
    "content": "Director, Strategic Marketing (B2B)\nVinarco Group of Companies  กรุงเทพมหานคร\n13 ชั่วโมงก่อน   มาเป็นหนึ่งในผู้สมัคร 25 คนแรก\n  \nดูบุคคลที่ Vinarco Group of Companies ได้ว่าจ้างสำหรับตำแหน่งนี้\nสมัคร \nบันทึกClient: A reputable developer and operator of decentralised solar photovoltaic and energy efficiency projects.\n\nLocation: Sathon, Bangkok\n\nType of Hiring: Permanent\n\nJob Description:\n\n\nOptimize existing sales channels through the implementation of loyalty programs with current business introducers (EPC, Telesales, or others).\nDevelop new sales channels to increase the number of leads/opportunities and explore partnerships with industrial zones or other relevant channels.\nConduct in-depth research to identify new market segments, opportunities, and client preferences to support the creation of effective campaigns.\nForecast market trends and monitor competitor offers.\nGenerate innovative ideas to promote the company's brand and solutions.\nDevelop business cases to support new marketing strategies, budget requests, projects, and marketing plans.\nUtilize customer feedback to ensure client satisfaction.\nEnhance COMPANY visibility by implementing a proper strategy in terms of SEO & SEM.\nDirectly manage the \"Communication and Marketing\" Manager to supervise and drive activities related to branding and communication, including PR, fairs/exhibitions, conferences, websites, social networks, CSR activities, etc.\n\n\n\nQualifications:\n\n\nDegree in Marketing, Engineering or a related field.\nAt least 10 years of experience in Marketing Strategy is required.\nMinimum of 3 years of prior work experience as a Marketing Strategist is essential.\nExpertise in Branding and Communications is advantageous.\nPreferred dual expertise in engineering and marketing.\nProficient in Thai and English with excellent written, spoken, and presentation skills.\nKnowledge of the renewable energy sector is a plus.\nIn-depth knowledge of CRM software and Content Management Systems\nExperience with SEO/SEM and Google Analytics\nOutstanding organizational and time management skills\nExcellent communication, and interpersonal skills\nCreative thinker with data-driven analytical aptitude\nIndependent and proactive attitude, with a demonstrated ability to be a team player.\nProactive and results oriented.\nRequires extensive travel within Thailand to meet customers.\n\nแสดงเพิ่มเติม \nระดับประสบการณ์\nผู้อำนวยการ\nประเภทการจ้างงาน\nงานเต็มเวลา\nหน้าที่งาน\nการตลาดและSales\nอุตสาหกรรม\nการจัดหาและคัดเลือกพนักงาน\n  \n\nคำรับรองเพิ่มโอกาสในการสัมภาษณ์ของคุณที่ Vinarco Group of Companies ได้ถึง 2 เท่า\n\nดูบุคคลที่คุณรู้จัก"
  },
  {
    "id": "M00RxCQbAnQCUyWenwkBAg",
    "url": "https://th.linkedin.com/jobs/view/talent-acquisition-lead-at-cpf-group-3755074790?refId=I6rrr%2B%2FU0zf%2FLdCEBn8IjQ%3D%3D&trackingId=M00RxCQbAnQCUyWenwkBAg%3D%3D&position=5&pageNum=0&trk=public_jobs_jserp-result_search-card",
    "content": "Talent Acquisition Lead\nCPF Group  กรุงเทพมหานคร\n4 ชั่วโมงก่อน  ผู้สมัคร 137 คน\n  \nดูบุคคลที่ CPF Group ได้ว่าจ้างสำหรับตำแหน่งนี้\nสมัคร\nบันทึกPosition: Talent Acquisition Team Lead\n\n(Business Unit : Information Technology, Support Function : Marketing, Finance, Accounting, Investor Relations, Human Resources, CEO's Office, etc.)\n\n\n\n\nResponsibilities:\n\n\n\n\nManage end to end recruitment activities as per CPF's Group recruitment process.\nJob briefing, screening CV’s / applications, conducting telephone interviews, providing short lists, scheduling interviews, negotiates & extend offers, coordinate on-boarding activities, etc.\nManage and build the candidates pool by identifying & utilizing various recruitment channels (university partnership, career events, outsourcing, direct sourcing, employer branding, internal resourcing, referral programs, online-offline communication, niche marketing, etc).\nProvide recruitment for all positions by Business Unit in responsible including entry-level (new graduates and experienced professionals.)\nWork closely with Hiring Manager and HR Business Partners concerning recruitment transactional activities process and support.\nCompile and manage data & reporting of recruitment KPIs and SLAs and provide information upon request.\nEnsure compliance in area of Recruitment policy.\nCoordinates and executes the logistics for recruitment events as appropriate.\nPoint of contact as Recruitment Business Partner for any customer issues & problems in Recruitment\n\n\n\n\nQualifications:\n\nMaster's or Bachelor’s Degree is required;\nMinimum 10 years working experiences in recruiting for the relevant business area or work experience from a recruitment agency is an advantage;\nPleasant personality with strong interpersonal and communication skills;\nCommunicative in both written and spoken English;\nProficient in Microsoft Office application.\n\n\n\n\nInterested candidate please submit your full English resume with your current and expected remuneration package directly to: karun.k@cpf.co.th\n\nแสดงเพิ่มเติม \nระดับประสบการณ์\nกึ่งอาวุโส\nประเภทการจ้างงาน\nงานเต็มเวลา\nหน้าที่งาน\nทรัพยากรบุคคล การให้คำปรึกษา และกลยุทธ์/การวางแผน\nอุตสาหกรรม\nที่ปรึกษาด้านธุรกิจและบริการ การจัดหาและคัดเลือกพนักงาน และการผลิต\n  \n\nคำรับรองเพิ่มโอกาสในการสัมภาษณ์ของคุณที่ CPF Group ได้ถึง 2 เท่า\n\nดูบุคคลที่คุณรู้จัก"
  },
  {
    "id": "xO+57LKqgiHp5E+WR+MqWw",
    "url": "https://th.linkedin.com/jobs/view/payment-specialist-cash-room-senior-cashier-ikea-sukhumvit-at-ikea-3780196480?refId=I6rrr%2B%2FU0zf%2FLdCEBn8IjQ%3D%3D&trackingId=xO%2B57LKqgiHp5E%2BWR%2BMqWw%3D%3D&position=6&pageNum=0&trk=public_jobs_jserp-result_search-card",
    "content": "Payment Specialist (Cash Room & Senior Cashier), IKEA Sukhumvit\nIKEA  กรุงเทพมหานคร\n15 ชั่วโมงก่อน   มาเป็นหนึ่งในผู้สมัคร 25 คนแรก\n  \nดูบุคคลที่ IKEA ได้ว่าจ้างสำหรับตำแหน่งนี้\nสมัคร\nบันทึกCompany Description\n\nIKEA is the world’s largest home furnishing retailer with 460 stores across more than 60 countries. IKEA Thailand is part of Ikano Retail, one of 12 IKEA franchisees and the only one owned by the family of Ingvar Kamprad, who founded IKEA in 1943.\n\nIKEA Thailand creates a better everyday life by offering a wide range of well-designed, functional home furnishing products at prices so low, that as many people as possible can afford them. Ikano (Thailand) Ltd. owns and operates three omnichannel stores in Thailand, including IKEA Bangna, IKEA Bang Yai and IKEA Phuket. To learn more, visit IKEA.co.th\n\nJob Description\n\nYou deliver an easy buying experience for all customers throughout the complete payment process and joyful shopping experience for all IKEA visitors and customers. This includes handling payment in a reliable, efficient, accurate and friendly way as well as supporting the check-out co-worker in their daily work.\n\n\nEnsure that our check-outs are efficiently equipped at all times throughout the day and in shape as new.\nHave the knowledge, confidence, responsibility, authority and desire to support customer payment and that they achieve this in an efficient and simple way.\nBe present in the check-out area in order to support the check-out co-workers and ensure customers leave with a positive impression of the IKEA store.\nDeliver a fast and positive payment experience by steering the check-out operation in a friendly, customer-focused and cost-efficient manner.\nFollow cash handling procedures to ensure the security of money handling.\n\n\nQualifications\n\n\nBe passionate about customers and always strive to deliver a positive shopping experience.\nExperience in consistently meeting and exceeding customer needs through understanding the customers in a service industry.\nAbility to prioritise and organise work and the work of others in order to make the most efficient use of the time available.\nConfident decision-maker\nAbility to communicate clearly and confidently in English.\nComputer proficient\nKnowledge of the IKEA product range, including service products.\nInterested in people’s everyday life at home and home furnishing.\n\n\nAdditional Information\n\nPlease apply by 17 December 2023.\nแสดงเพิ่มเติม \nระดับประสบการณ์\nรองผู้จัดการ\nประเภทการจ้างงาน\nงานเต็มเวลา\nหน้าที่งาน\nฝ่ายบริการลูกค้า\nอุตสาหกรรม\nการค้าปลีก การผลิตเฟอร์นิเจอร์และของตกแต่งบ้าน และการผลิต\n  \n\nคำรับรองเพิ่มโอกาสในการสัมภาษณ์ของคุณที่ IKEA ได้ถึง 2 เท่า\n\nดูบุคคลที่คุณรู้จัก"
  },
  {
    "id": "Cxyzko/J2E5zPee27bQzVQ",
    "url": "https://th.linkedin.com/jobs/view/branding-communication-strategic-leader-ev-car-max-to-120k-asoke-at-pasona-thailand-3775425585?refId=I6rrr%2B%2FU0zf%2FLdCEBn8IjQ%3D%3D&trackingId=Cxyzko%2FJ2E5zPee27bQzVQ%3D%3D&position=7&pageNum=0&trk=public_jobs_jserp-result_search-card",
    "content": "Branding Communication Strategic Leader (EV Car)/ Max to 120k/ Asoke\nPasona Thailand  กรุงเทพมหานคร\n20 ชั่วโมงก่อน   มาเป็นหนึ่งในผู้สมัคร 25 คนแรก\n  \nดูบุคคลที่ Pasona Thailand ได้ว่าจ้างสำหรับตำแหน่งนี้\nสมัคร\nบันทึกส่งข้อความโดยตรงถึงผู้ประกาศรับสมัครงานจาก Pasona Thailand\n\nParon S.\nParon S.\nBusiness Development (Sales & Recruitment Consultant) at Pasona Thailand 【Open to connect】\n\nPosition: Branding Communication Strategic Leader (EV Car)\n\nBusiness: Advertising media Agency (integrating media for marketing and communication, and developing innovative services)\n\n\n\n\nSalary: 80,000-120,000 THB as Total Package (Depends on Negotiation)\n\n\n\n\nWork location: MRT Sukhumvit / BTS Asoke\n\nWork hours: Monday – Friday 09.00/11:00-18.00/20:00 (Flexible Hour)\n\n\n\n\nRequirement\n\n- Proficient in communicating in English or Chinese at an advanced level, holding a bachelor's degree in advertising, sales, or marketing.\n\n- Over 10 years of experience working in advertising agencies, preferably in a 4A-sized company or public relations agency with experience managing brand clients.\n\n- Knowledgeable and familiar with the automotive industry in Thailand, including marketing, competition, and understanding the needs of customers and end-users.\n\n- Experience in strategic planning and integrated marketing communication (IMC), including team management in the strategic department.\n\n- Comprehensive skills in strategy and marketing, covering:\n\n- Marketing strategy skills and post-operational communication strategy skills.\n\n- Expertise in tools and resources (media/social media/platform/Big Data).\n\n- Expertise in advertising and brand understanding, systematic strategy skills, and excellent article writing skills.\n\n- Knowledge of both theoretical and practical aspects of marketing.\n\n- Positive attitude towards work, self-driven with the ability to create motivation, and efficiently innovative under pressure. A good leader with effective team management techniques.\n\n\n\n\nResponsibilities:\n\n- Develop a distinctive and prominent advertising strategy, including the ability to provide strategic advice to customers in both marketing and competitive situations.\n\n- Manage the overall branding of the car project, including promoting the brand and car models, employing a mixed marketing strategy that integrates offline and online media, digital marketing, and social media.\n\n- Lead a team to analyze customer needs, survey market data to plan each stage, and coordinate with relevant departments to achieve the brand's marketing objectives according to the plan.\n\n- Lead the team to achieve monthly and yearly marketing plans (offline and online media) as proposed.\n\n- Control the main strategic direction and the quality of work to be disseminated, ensuring successful communication of strategic messages and reporting results to customers comprehensively.\n\n- Manage team operations and achieve annual goals, understanding and responding well to customer needs, leading the team to develop and create annual marketing plans for new products and projects.\n\n\n\n\n.\n\nIf you’re interested in this position, please submit your English resume by clicking the Apply button or contacting K. Paron for more information by Line ID: paron_pasona\n\n.\n\nLooking forward to hearing from you soon\n\nแสดงเพิ่มเติม \nระดับประสบการณ์\nกึ่งอาวุโส\nประเภทการจ้างงาน\nงานเต็มเวลา\nหน้าที่งาน\nการตลาด ประชาสัมพันธ์ และการเขียน/การเรียบเรียง\nอุตสาหกรรม\nบริการด้านทรัพยากรบุคคล\n  \n\nคำรับรองเพิ่มโอกาสในการสัมภาษณ์ของคุณที่ Pasona Thailand ได้ถึง 2 เท่า\n\nดูบุคคลที่คุณรู้จัก"
  },
  {
    "id": "iqk9ENQdcnkNcp9/RwSg8g",
    "url": "https://th.linkedin.com/jobs/view/marketing-specialist-influencer-engagement-global-operations-tha-at-shein-3763351238?refId=I6rrr%2B%2FU0zf%2FLdCEBn8IjQ%3D%3D&trackingId=iqk9ENQdcnkNcp9%2FRwSg8g%3D%3D&position=11&pageNum=0&trk=public_jobs_jserp-result_search-card",
    "content": "Marketing Specialist (Influencer Engagement) - Global Operations, THA\nSHEIN  กรุงเทพมหานคร\n2 ชั่วโมงก่อน   ผู้สมัครมากกว่า 200 คน\n  \nดูบุคคลที่ SHEIN ได้ว่าจ้างสำหรับตำแหน่งนี้\nสมัคร\nบันทึกส่งข้อความโดยตรงถึงผู้ประกาศรับสมัครงานจาก SHEIN\n\nChloe Liao\nChloe Liao\nSHEIN | HRBP Manager | Bilingual\n\nAbout SHEIN\n\nSHEIN is a global fashion and lifestyle e-retailer committed to making the beauty of fashion accessible to all. We use on-demand manufacturing technology to connect suppliers to our agile supply chain, reducing inventory waste and enabling us to deliver a variety of affordable products to customers around the world. From our global offices, we reach customers in more than 150 countries.\n\nTo learn more about SHEIN, follow us at shein.com, instagram.com/sheinofficial and youtube.com/shein.\n\n\n\n\nSummary\n\nAs a KOL Marketing Specialist/Manager at SHEIN, you will be responsible for developing and executing influencer marketing strategies to enhance brand visibility, engagement, and drive sales. You will play a key role in building and maintaining relationships with key opinion leaders (KOLs), influencers, and content creators to amplify SHEIN's presence in the fashion and lifestyle space.\n\n\n\n\nResponsibilities:\n\n\n\n\nStrategy Development\n\nDevise and implement KOL marketing strategies aligned with SHEIN's brand objectives.\nIdentify and analyze market trends, competitor activities, and audience preferences to optimize influencer campaigns.\n\n\n\n\nInfluencer Relationship Management\n\nBuild and nurture relationships with KOLs, influencers, and content creators.\nNegotiate and execute influencer partnerships, ensuring alignment with brand values and goals.\n\n\n\n\nProject Execution\n\nPlan and execute end-to-end influencer marketing campaigns and events, including content creation, product placements, and sponsored collaborations.\nMonitor project performance, analyze data, and provide insights for continuous improvement.\n\n\n\n\nContent Collaboration\n\nCollaborate with influencers to create engaging and authentic content that resonates with SHEIN's target audience.\nEnsure all content adheres to brand guidelines and promotes a positive brand image. 5. Budget Management:\nManage the influencer marketing budget effectively, maximizing ROI and ensuring cost-effectiveness.\n\n\n\n\nReporting and Analytics\n\nGenerate regular reports on the performance of influencer campaigns, providing actionable insights for future strategies.\nUtilize analytics tools to measure and analyze the impact of KOL marketing initiatives.\n\n\n\n\nJob Requirements:\n\nBachelor's degree in marketing, Communications, Business, or a related field.\nProven experience in influencer marketing, preferably in the fashion or e-commerce industry.\nStrong understanding of social media platforms, trends, and influencer landscapes.\nExcellent communication and negotiation skills.\nAnalytical mindset with the ability to interpret data and make data-driven decisions.\nCreative thinker with a passion for staying updated on industry trends.\nแสดงเพิ่มเติม \nระดับประสบการณ์\nรองผู้จัดการ\nประเภทการจ้างงาน\nงานเต็มเวลา\nหน้าที่งาน\nการตลาดและศิลปะ/งานสร้างสรรค์\nอุตสาหกรรม\nการค้าปลีกเครื่องแต่งกายและแฟชั่นและเทคโนโลยี สารสนเทศ และอินเทอร์เน็ต\n  \n\nคำรับรองเพิ่มโอกาสในการสัมภาษณ์ของคุณที่ SHEIN ได้ถึง 2 เท่า\n\nดูบุคคลที่คุณรู้จัก"
  },
  {
    "id": "E9w9hzN3HdX9QxC0H40+5Q",
    "url": "https://th.linkedin.com/jobs/view/consumer-insights-manager-at-cpf-group-3765709193?refId=I6rrr%2B%2FU0zf%2FLdCEBn8IjQ%3D%3D&trackingId=E9w9hzN3HdX9QxC0H40%2B5Q%3D%3D&position=12&pageNum=0&trk=public_jobs_jserp-result_search-card",
    "content": "Consumer Insights Manager\nCPF Group  กรุงเทพมหานคร\n4 ชั่วโมงก่อน  ผู้สมัคร 101 คน\n  \nดูบุคคลที่ CPF Group ได้ว่าจ้างสำหรับตำแหน่งนี้\nสมัคร\nบันทึกPosition: Manager - Consumer Market Insight (CP-Meiji)\n\n\n\n\nResponsibilities\n\nResponsible for Domestic B2C on Shopper Panel, Brand Tracking, New Product Development Research, or ad-hoc research focusing in Thailand market.\nDeliver meaningful insight and foresight of Thailand market analysis synthesizing trend, market, consumer and shopper data by identifying issue and opportunity to commercial team action plan.\nBe a part of Domestic CMI B2C team to drive “Data driven culture” by optimizing cross function knowledge and utilization of Shopper Panel, Brand Health Tracking, and Domestic Consumer data insight.\n\n\n\n\nKNOWLEDGE AND SKILLS:\n\nResearch and analytical thinking skill\n\n-Able to analyze market and category understanding using Syndicated Data & Brand Tracking\n\n-Able to manage quantitative and/or qualitative research methodologies with minimal supervision\n\n-Ability to utilize and integrate all data sources and translate into relevant business insight and opportunity\n\nCritical thinking\nBusiness analysis & strategy\nKnowledge on Syndicated Tools e.g. Kantar World Panel, NielsenIQ, EGG data\n\n\n\n\nQualifications\n\nBachelor degree or above in marketing, economics, or statistics\nMinimum 3-5 years in research with solid background in:\n\nFirst Priority: Consumer & Shopper Insight quantitative & qualitative research and Brand Health Tracking.\n\nSecond Priority: Syndicated data: Kantar World Panel, NielsenIQ, POS data, Loyalty Card data.\n\nExperience in market analysis by using Syndicated data and turn in to actionable insights.\nExperience in developing, executing, and leading analysis both consumer research and shopper research.\nFluent in English language with good communication skill and presentation skill.\nDetail oriented, but with ability to look at the bigger picture and story telling.\nAbility to work individually (end-to-end) and cross-functional team environment.\n\n\n\n\nInterested candidate please submit your full English resume with your current and expected remuneration package directly to: karun.k@cpf.co.th\n\nแสดงเพิ่มเติม \nระดับประสบการณ์\nกึ่งอาวุโส\nประเภทการจ้างงาน\nงานเต็มเวลา\nหน้าที่งาน\nการตลาด การวิจัย และการให้คำปรึกษา\nอุตสาหกรรม\nการผลิต บริการอาหารและเครื่องดื่ม และบริการวิจัย\n  \n\nคำรับรองเพิ่มโอกาสในการสัมภาษณ์ของคุณที่ CPF Group ได้ถึง 2 เท่า\n\nดูบุคคลที่คุณรู้จัก"
  },
  {
    "id": "9OvKJ5I+nGGl/P3NuAlEjg",
    "url": "https://th.linkedin.com/jobs/view/product-and-project-management-at-shopee-3731728651?refId=I6rrr%2B%2FU0zf%2FLdCEBn8IjQ%3D%3D&trackingId=9OvKJ5I%2BnGGl%2FP3NuAlEjg%3D%3D&position=13&pageNum=0&trk=public_jobs_jserp-result_search-card",
    "content": "Product and Project Management\nShopee  กรุงเทพมหานคร\n15 ชั่วโมงก่อน  ผู้สมัคร 133 คน\n  \nดูบุคคลที่ Shopee ได้ว่าจ้างสำหรับตำแหน่งนี้\nสมัคร \nบันทึกJob Description\n\n\n\n\nKey Responsibility (Product)\n\n\n\n\nDevelop, assess, and manage requirements and roadmap for both products, the SBS modules (PMS, FBS, SRM) and the SHP systems.\nOversee platform/application usage, licenses, and maintenance to ensure optimal performance and compliance.\nPerform configuration and small development tasks within the SBS modules and SHP system, ensuring they align with business needs and requirements.\nCollaborate closely with implementation vendors and partners, providing guidance and direction throughout the implementation process.\nWork closely with other Product Owners and Developer team members to successfully deliver business and technology programs according to the established plan.\nConduct regular assessments and evaluations of the SBS modules and SHP system to identify areas for improvement, risks, and issues and recommend enhancements or mitigation.\nStay up-to-date with industry trends, best practices, and emerging technologies in the fulfillment business, providing insights and recommendations for continuous improvement.\nDrive user adoption and training initiatives to ensure effective utilization of the SBS modules and SHP systems across the organization.\nSupport operations to investigate and resolve daily bugs/minor issues\n\n\n\n\nKey Responsibility (Project Management)\n\n\n\n\nClosely collaborate with involved parties to gather information for analyzing operation pain points and initiating process improvement plans.\nDraw up the project plans and dependencies, and communicate across the involved parties to align new processes and timeline.\nDevelop workflow diagram, process SOP, documentation and training material for internal and external communication.\nMonitor feedback and measure the performance of process adjustment.\nManage ad-hoc project assignments.\n\n\n\n\nRequirements\n\n\n\n\nMinimum Bachelor's Degree in Business Engineering, Business, Supply Chain, Logistics or similar fields. Master’s Degree/MBA is a plus.\n+3 years of technical program/product management experience in a fast-paced environment\nExcellent interpersonal skills, energetic and a self-starter\nExcellent presentation and project management skills are necessary\nStrong organizational skills along with the demonstrated ability to manage multiple tasks simultaneously and able to react to shifting priorities to meet business needs\nEffective communicator (written and verbal). Able to communicate effectively with both business and technical teams.\nStrong problem-solver and detail-oriented.\nThe ability and positive mindset to \"figure things out\nDemonstrated analytical and quantitative skills\nInfluential ability to convey a recommendation or story with insight & strategic thinking\nTeamwork and leadership skills\nCustomer-oriented mindset is a plus\nแสดงเพิ่มเติม \nระดับประสบการณ์\nประสบการณ์น้อย\nประเภทการจ้างงาน\nงานเต็มเวลา\nหน้าที่งาน\nSalesและการพัฒนาธุรกิจ\nอุตสาหกรรม\nเทคโนโลยี สารสนเทศ และอินเทอร์เน็ต\n  \n\nคำรับรองเพิ่มโอกาสในการสัมภาษณ์ของคุณที่ Shopee ได้ถึง 2 เท่า\n\nดูบุคคลที่คุณรู้จัก"
  },
  {
    "id": "ZEVlIG5uB/DkFkf0wxnBBw",
    "url": "https://th.linkedin.com/jobs/view/head-of-people-culture-at-cross-hotels-resorts-3775938313?refId=I6rrr%2B%2FU0zf%2FLdCEBn8IjQ%3D%3D&trackingId=ZEVlIG5uB%2FDkFkf0wxnBBw%3D%3D&position=14&pageNum=0&trk=public_jobs_jserp-result_search-card",
    "content": "Head of People & Culture\nCross Hotels & Resorts  กรุงเทพมหานคร, ประเทศไทย\n1 ชั่วโมงก่อน   มาเป็นหนึ่งในผู้สมัคร 25 คนแรก\n  \nดูบุคคลที่ Cross Hotels & Resorts ได้ว่าจ้างสำหรับตำแหน่งนี้\nสมัคร\nบันทึกส่งข้อความโดยตรงถึงผู้ประกาศรับสมัครงานจาก Cross Hotels & Resorts\n\nBuddhachard Paengchai\nBuddhachard Paengchai\nCross Hotels & Resorts - VP Marketing Communications\n\nAt Cross Hotels & Resorts, our passion for hospitality drives everything we do. Our success is built on the fact that we do things differently and our brands remain relentlessly relevant.\n\n\n\n\nIf you are ready to exceed the needs of our stakeholders and you think you have what it takes, apply now and join as a team of APAC’s Hotel Management operator of choice for hotel owners seeking an innovative alternative to the global chains.\n\n\n\n\nJOB DESCRIPTION\n\n\n\n\nAs the Head of People & Culture, you'll lead HR strategies, foster a positive workplace culture, and drive employee engagement. Responsibilities include talent acquisition, performance management, learning and development initiatives, and ensuring alignment between organizational goals and workforce capabilities. You'll also focus on employee well-being, diversity and inclusion, and maintaining a vibrant company culture. Additionally, you'll collaborate with leadership to shape policies that support the organization's values and growth. Strong communication and leadership skills are essential for success in this role.\n\n\n\n\nCORE TASKS, DUTIES AND RESPONSIBILITIES\n\n\n\n\nORGANISATIONAL LEADERSHIP AND STRATEGY DEVELOPMENT\n\n• Apply knowledge and expertise in specialist People and Culture areas, providing innovative ideas and solutions.\n\n• Develop and implement Cross Hotels & Resorts’ HR strategy, ensuring it meets organisational priorities and promotes diversity, inclusion and equality among staff – periodically reviewing strategy outcomes to ensure it remains relevant to changing organisational needs, circumstances and stays linked to other support function/operational strategies.\n\n• Develop and govern People policies, procedures, and guidelines as required. Promotes consistency and fairness in their execution – ensuring all local required legislations are adhered to, and ongoing training of People policies takes place.\n\n• Maintain and develop People Culture information systems and tools. Explore new technologies where appropriate – introducing and overseeing the preparation and analysis of People and Culture metrics and providing feedback that supports decision-making in specified areas.\n\n• Provide regular advice, guidance, and where necessary challenges SWOT Team and Hotel General Managers on their people management, performance and development plans/issues.\n\n• Maintains relationships and participates with external People and Culture networks.\n\n\n\n\nTEAM LEADERSHIP\n\n• Lead and manage hotel level HR teams who are responsible for the day-to-day delivery of HR services and further develop an effective business partnership model that is responsive and agile; meeting expectations of internal stakeholders.\n\n• Promote professional development of team members and facilitate ongoing performance management including, but not limited to; objective setting, identifying learning and development needs, coaching, and welfare.\n\n• Motivate, encourage and support hotel level HR in the design and delivery of high-quality services.\n\n• Create and maintain key performance indicators – ensuring external good practice and thinking is reflected internally.\n\n• Oversee People information systems, tools and financial planning of the department.\n\n• Support cross-organisational work practices and ensure that the hotel level HR teams influence, and is influenced by, organisational discussions, lessons and decisions.\n\n\n\n\nORGANISATIONAL SUPPORT AND SERVICES\n\n• Responsible for ensuring that we live our core values in our everyday work life\n\n• Ensure innovative recruitment and succession planning is in place: oversee fair and effective processes to attract and bring on board new team members while processing learning from the experiences of those who leave.\n\n• Stimulate global team members engagement and involvement. Work with team members, and lead engagement surveys to ensure feedback is used to generate reflection, learning and improvement.\n\n• Ensure recognition and reward program/strategy is reviewed periodically and its deployment is transparent and in line with organisational values.\n\n• Oversee annual processes to assess and update team members pay rate and benefits, ensuring good performance is valued and adjustments are implemented fairly.\n\n• Encourage and strengthen a culture and practice of forward HR planning – ensuring HR considerations are reflected accurately in new programme design and annual planning processes.\n\n• Act as an innovative, transformational leader who challenges and/or supports SWOT and hotel level leadership teams\n\n\n\n\nGOOD PEOPLE MANAGEMENT PRACTICE\n\n• Advocate for good practices that promotes development and wellbeing of all Cross Hotels & Resorts team members, including a focus on work/life balance.\n\n• Develop and support leaders and team member across the organisation to organise and deliver their priorities effectively through their teams – providing inspiration to advance leadership development processes.\n\n• Champion and advance diversity within the organisation to assist teams understand and live Cross Hotels & Resorts’ core values – help ensure our identity as a peace building organisation is reflected in our ways of working and recruitment.\n\n• Ensure performance review systems are updated, implemented regularly, and lead to positive interaction and follow-up among staff – assisting in identifying ways staff recognition and development initiatives can be met.\n\n• Design and cultivate learning and development strategies to help team members identify areas where skills and experience can be expanded and performance grows – working with others to ensure an appropriate range of tools, resources and development opportunities are accessible across the organisation.\n\n\n\n\nJOB QUALIFICATIONS & SKILLS\n\n\n\n\n• Thai nationality with successful completion of higher education\n\n• Minimum of 5 years’ experience in a progressive organization with People, Culture, Learning and Development exposure\n\n• Excellent command of spoken and written English\n\n• Able to travel and work short stints globally Excellent communication and interpersonal skill\n\n• Strong team playing skill and problem solving\n\nแสดงเพิ่มเติม \nระดับประสบการณ์\nผู้อำนวยการ\nประเภทการจ้างงาน\nงานเต็มเวลา\nหน้าที่งาน\nทรัพยากรบุคคล\nอุตสาหกรรม\nงานบริการ\n  \n\nคำรับรองเพิ่มโอกาสในการสัมภาษณ์ของคุณที่ Cross Hotels & Resorts ได้ถึง 2 เท่า\n\nดูบุคคลที่คุณรู้จัก"
  },
  {
    "id": "sCJ9mJR4amC8xDzDAlHY2w",
    "url": "https://th.linkedin.com/jobs/view/gm-growth-sales-operations-at-cars24-3780835571?refId=I6rrr%2B%2FU0zf%2FLdCEBn8IjQ%3D%3D&trackingId=sCJ9mJR4amC8xDzDAlHY2w%3D%3D&position=19&pageNum=0&trk=public_jobs_jserp-result_search-card",
    "content": "GM - Growth & Sales Operations\nCARS24  กรุงเทพมหานคร\n3 ชั่วโมงก่อน   มาเป็นหนึ่งในผู้สมัคร 25 คนแรก\n  \nดูบุคคลที่ CARS24 ได้ว่าจ้างสำหรับตำแหน่งนี้\nสมัคร\nบันทึกABOUT CARS24:\n\n\n\n\nCars24 is a used vehicle e-commerce unicorn that has reached a billion dollars in sales in five years since inception in 2015. We are backed by both Softbank, Tencent, DST and Alpha Wave Capital with the most recent fundraise of $300mn bringing our valuation to $3.3 billion. In South East Asia, with Thailand being the regional GTM hub, the intent is to fundamentally redefine the used car buying experience for consumers, including all touch points such as searching, buying, financing, insurance and warranty.\n\n\n\n\nABOUT THE ROLE:\n\n\n\n\nAs the GM of Growth & Sales Ops in Thailand your key responsibilities include:\n\nRapidly growing funnel of customers coming to the platform:\nWork with Marketing, Product and Offline Sales teams to ensure higher customer acquisition through all relevant channels\nWork with CRM team to provide digital cues to nudge customers to complete their car buying journey with Cars24\nIdentify suitable opportunities and develop execution plans to unlock growth\nImprove Funnel conversions:\nEnsure high conversion from Test drive to Sales\nDevelop trackers and monitor progress against key initiatives to improve conversions\nConsistently strive to reduce TAT from Test drive to delivery\nEmpower the on-ground team with the right tools\nDevelop monthly and quarterly sales plan along with sizing & tracking of Key initiatives\nBuild and manage a cross-functional team of Sales Ops and Growth\nEnsure focus on a holistic customer experience including a smooth test drive, delivery and post sale experience\nCoordinate with internal stakeholders from sourcing, operations, finance to ensure sales and fulfilment process is run smoothly\nSpecial projects: Drive improvement (e.g. process improvement) and strategic projects on an ad-hoc basis.\nReporting: Develop KPIs & reports, establish required reporting governance and processes and track KPIs on an ongoing basis.\nAnalysis & decision support: Analyse plan/KPI deviations, identify root causes & make recommendations for improvement actions. Provide decision support and develop business cases & financial analyses (e.g. insource vs. outsource decisions, etc.).\n\n\n\n\nThe role reports to the AVP Commercial in Thailand and will be based in Bangkok.\n\n\n\n\nWHAT WE NEED:\n\n\n\n\n5+ years of experience in sales and customer operations in Thailand\nA good understanding of the Thai auto industry or any B2C auto experience with OEMs, large B2C dealerships, used cars platforms, etc. is an advantage\nPrevious experience in the Growth role of a high-growth startup is preferred\nAbility to converse effectively in both English and Thai\nDrive and hustle for continually developing and running sales operations efficiently\nStrong analytical ability with a data-driven approach to making decisions\nExcellent people skills, an ability to collaborate with different stakeholders and apply a cross-functional mindset\nAbility to learn quickly and transfer knowledge\nDriven by working hard, being challenged in a fast-paced environment, and having fun while doing so\n\n\n\n\nWHAT WE OFFER:\n\n\n\n\nGround-up opportunity: Build a big business from scratch and shape the strategic direction of the market, changing the way people buy cars\nAmazing people & network: You are not alone - we keep standards high for anyone who joins us here\nLearning & Development: We focus on employee training both on the job and in organised special sessions. We also have access to an amazing list of advisors and investors that we actively engage\nInsurance & Medical benefits: Subsidised health support for your family & you across Life, Surgery, Inpatient, Outpatient & more\nFocus on mental health: Active counselling to help you pass through tumultuous times\nTruly Global Experience - With teams spanning across 3 continents we are a truly global organisation and offer rich, diverse and multicultural experiences\nCompetitive pay: Full-time salary at market rates\n\n\n\n\nOUR VALUES:\n\n\n\n\nWe’ve told you what CARS24 does. But what is the big picture that we abide by? What values keep driving us to help our customers drive the vehicle they choose?\nWe trust, and build trust - We work hard to get the customer to trust us, and we do it by placing them first. Whether it’s evaluation, customer protection policies, warranties, or just customer support - we’re there for every customer, every stakeholder. This is the bedrock of everything we do, and we work hard with committed goals and timelines to keep improving.\nWe invest in employees and partners - A natural extension of our first point - A culture of trust and cooperation means that every employee and partner is a crucial part of our ecosystem. We invest in every one of them, and we measure success not only in terms of profits and balance sheets but in the success each employee and partner sees in their professional and personal lives.\nTaking ownership - We don’t believe in a system of micromanagement and constant oversight. We train our employees to take control, and they are the owners of the work they do. This is inculcated from the time we hire to each project that comes their way, and in our mind, this is what defines a great workplace - the number of people willing to take ownership.\nHave high standards. Top high results - Perfection and progress is what we work towards. And once we achieve that, we move the bar higher and higher, so we can keep outdoing ourselves.\nWe’re a meritocracy - We never let exceptional performance go unrewarded. We encourage healthy competition, but never at the expense of others. Everyone has a chance to succeed, and a chance to reap the benefit.... After all, the more talented people we have on board, the more there is to accomplish and reward.\nWe’re frugal, in a prudent way - We’re all for spending, but only when we see it adding value - to our employees, partners, customers, or any other stakeholder. A great workplace isn’t defined by bells and whistles like grand offices and fancy food, but in learning, value and profits that benefit every member of CARS24.\nWe’re in it for the long haul - CARS24 is on a long journey, and we’re not taking any shortcuts. The milestones we pass, like quarterly results and yearly targets are but smaller rewards in our longer and uncompromising drive to the very top, and the success we see in the long term is what keeps us going.\nแสดงเพิ่มเติม \nระดับประสบการณ์\nกึ่งอาวุโส\nประเภทการจ้างงาน\nงานเต็มเวลา\nหน้าที่งาน\nนักวิเคราะห์ กลยุทธ์/การวางแผน และการพัฒนาธุรกิจ\nอุตสาหกรรม\nการผลิตยานพาหนะแบบใช้มอเตอร์และการธนาคาร\n  \n\nคำรับรองเพิ่มโอกาสในการสัมภาษณ์ของคุณที่ CARS24 ได้ถึง 2 เท่า\n\nดูบุคคลที่คุณรู้จัก"
  },
  {
    "id": "y61SRXnDk68/vBMPZRk3Aw",
    "url": "https://th.linkedin.com/jobs/view/vp-marketplace-logistics-at-lazada-3779622464?refId=I6rrr%2B%2FU0zf%2FLdCEBn8IjQ%3D%3D&trackingId=y61SRXnDk68%2FvBMPZRk3Aw%3D%3D&position=20&pageNum=0&trk=public_jobs_jserp-result_search-card",
    "content": "VP, Marketplace Logistics\nLazada  เขตปริมณฑลกรุงเทพมหานคร\n3 ชั่วโมงก่อน   มาเป็นหนึ่งในผู้สมัคร 25 คนแรก\n  \nดูบุคคลที่ Lazada ได้ว่าจ้างสำหรับตำแหน่งนี้\nสมัคร\nบันทึกส่งข้อความโดยตรงถึงผู้ประกาศรับสมัครงานจาก Lazada\n\nYi Peng Ang\nYi Peng Ang\nRegional Talent Acquisition Manager at Lazada\n\nTeam and Role Introduction:\n\nMarketplace Logistics is a team that focuses on improving buyer and seller logistics experience. Our goal is to provide industry leading buyers experience through introducing and scaling up different delivery options on the platform, and addressing seller logistics pain points together with leading 3PLs. We are looking for a Head of Marketplace Logistics in Thailand to manage and own the buyer and seller logistics experience.\n\n\n\n\nResponsibilities:\n\nDefine expected buyer experience and translate the target experience back to segmented delivery option services for buyers, subsequently define the right parcel handover strategy between sellers and LEX/3PL to set up relevant services\nDesign roadmaps, work streams for new delivery option introduction and expansion, and ensure a timely execution of individual work streams to continuously evolve the service offering to ensure market competitiveness\nIdentify and drive key initiatives to address seller pain points, work with LEX/3PL to improve key operations metrics that improves seller satisfaction\nImplement framework and tech enhancements in the first mile to improve seller fulfilment speed and consistency\nDrive the initiatives End to End, including alignment of objectives with management and internal teams, PMO, creation of SOP, monitoring of KPIs\n\n\n\n\nRequirements/Qualifications(must have):\n\nMinimum of Bachelor’s degree in Logistics, Engineering or Business Economics\n5 years of relevant work experience in marketplace operations, logistics, transportation, supply chain or last-mile delivery\nGood knowledge and understanding of logistics industry key player competitive landscape and practices, working experience in a well-established 3PL or e-commerce company is a plus\nStrengths in problem solving, proven experience in project management and high tolerance to ambiguity\nGood with numbers and data analytics. Independent & ability to thrive in a fast-paced start-up environment\nDemonstrated ability to learn fast, handle multiple tasks, prioritize objectives to meet deadlines\nแสดงเพิ่มเติม \nระดับประสบการณ์\nผู้อำนวยการ\nประเภทการจ้างงาน\nงานเต็มเวลา\nหน้าที่งาน\nซัพพลายเชน\nอุตสาหกรรม\nเทคโนโลยี สารสนเทศ และอินเทอร์เน็ตและการขนส่ง โลจิสติกส์ ซัพพลายเชนและการจัดเก็บ\n  \n\nคำรับรองเพิ่มโอกาสในการสัมภาษณ์ของคุณที่ Lazada ได้ถึง 2 เท่า\n\nดูบุคคลที่คุณรู้จัก"
  },
  {
    "id": "bB6rsppgiE6/iYe3K4NJMQ",
    "url": "https://th.linkedin.com/jobs/view/recruitment-consultant-thailand-at-hays-3775408419?refId=I6rrr%2B%2FU0zf%2FLdCEBn8IjQ%3D%3D&trackingId=bB6rsppgiE6%2FiYe3K4NJMQ%3D%3D&position=21&pageNum=0&trk=public_jobs_jserp-result_search-card",
    "content": "Recruitment Consultant (Thailand)\nHays  กรุงเทพมหานคร\n22 ชั่วโมงก่อน  ผู้สมัคร 27 คน\n  \nดูบุคคลที่ Hays ได้ว่าจ้างสำหรับตำแหน่งนี้\nสมัคร\nบันทึกWe are looking for sales-driven individuals to become top class recruitment consultants!\n\nYour new company\n\nWe are the world's leading recruiting experts in recruiting qualified, professional and skilled people. We power the world of work by truly understanding our clients and candidates, locally and globally. We provide deep expertise across a wide spectrum of industries and sectors.\n\nWe are looking for ambitious individuals to join our growing family. If you are determined to be the best, thrive under pressure and respond proactively and positively to targets, a career at Hays could be for you. This role will be based in our new Bangkok office located in Sukhumvit Road. Neighbouring country, Malaysia has experienced exponential growth and has been the fastest growing business in the Hays world, we are now looking to replicate that across the region. The senior management team behind this success will be spearheading operations in Thailand, they are a diverse mix of locals and expatriates.\n\nWe are looking for ambitious individuals to join our growing family. If you are determined to be the best, thrive under pressure and respond proactively and positively to targets, a career at Hays could be for you.\n\nYour new role\n\nAs a recruitment consultant, some of your responsibilities include:\n\n\nGenerating strong candidate database through multiple attraction methods\nSourcing for the best candidates for your clients\nManagement of candidate relationships to build trust and ensure a smooth and successful recruitment process\n\nWhat you'll need to succeed\n\nWe welcome professionals from various industries. Key qualities required:\n\n\nExceptional motivation with strong ambition and sales-drive\nThrive under pressure\nRespond proactively and positively to targets\nResilient\nResult oriented\n\nWhat you'll get in return\n\nAt Hays, you'll never stand still because we harness your potential. We believe in promoting our people based on merit. With world-class training and mentoring from senior leaders, the possibilities for your career are endless. As a recruitment consultant, you'll have the opportunity to determine your career path that is aligned with your skills and interests. Achieve and you'll be fast-tracked into people or business leadership. We have transparent promotion criteria, so you'll always have a goal to work towards. We provide attractive KPI & placement bonus and a fast extension to career development.\n\nWhat you need to do now\n\nIf you're interested in this role, click 'apply now' to forward an up-to-date copy of your CV.\n\nAt Hays, we don't just accept difference - we celebrate it, we support it, and we thrive on it for the benefit of our employees, our customers, and our community. Hays is proud to be an equal opportunity workplace that embraces diversity and strives to be inclusive environment for our people.\n\n\nแสดงเพิ่มเติม \nระดับประสบการณ์\nกึ่งอาวุโส\nประเภทการจ้างงาน\nงานเต็มเวลา\nหน้าที่งาน\nทรัพยากรบุคคล\nอุตสาหกรรม\nบริการด้านทรัพยากรบุคคล\n  \n\nคำรับรองเพิ่มโอกาสในการสัมภาษณ์ของคุณที่ Hays ได้ถึง 2 เท่า\n\nดูบุคคลที่คุณรู้จัก"
  },
  {
    "id": "9gCPtXdX3NLFzBNlUXBlow",
    "url": "https://th.linkedin.com/jobs/view/customer-development-executive-at-colgate-palmolive-3779124692?refId=I6rrr%2B%2FU0zf%2FLdCEBn8IjQ%3D%3D&trackingId=9gCPtXdX3NLFzBNlUXBlow%3D%3D&position=24&pageNum=0&trk=public_jobs_jserp-result_search-card",
    "content": "Customer Development Executive\nColgate-Palmolive  กรุงเทพมหานคร\n19 ชั่วโมงก่อน  ผู้สมัคร 30 คน\n  \nดูบุคคลที่ Colgate-Palmolive ได้ว่าจ้างสำหรับตำแหน่งนี้\nสมัคร \nบันทึก# 156925 - Bangkok, Bangkok, Thailand\n\nWho We Are\n\nColgate-Palmolive Company is a caring, innovative growth company that is reimagining a healthier future for all people, their pets and our planet. Focused on Oral Care, Personal Care, Home Care and Pet Nutrition, we sell our products in more than 200 countries and territories under brands such as Colgate, Palmolive, elmex, hello, meridol, Sorriso, Tom’s of Maine, EltaMD, Filorga, Irish Spring, PCA SKIN, Protex, Sanex, Softsoap, Speed Stick, Ajax, Axion, Fabuloso, Soupline and Suavitel, as well as Hill’s Pet Nutrition.\n\nWe are recognized for our leadership and innovation in promoting sustainability and community wellbeing, including our achievements in decreasing plastic waste and promoting recyclability, saving water, conserving natural resources and improving children’s oral health.\n\nIf you want to work for a company that lives by their values, then give your career a reason to smile and join our global team!\n\nDay-to-day responsibilities:\n\n\nEstablishing Strong Relationship With Customers By Providing Effective Coverage And Visiting Stores With Required Frequency\nConducting Regular Business Review to Follow Up Key Issues to Provide Recommendation And Solutions\nDeveloping And Executing Customer Plans To Profitably Increase Sales Volume, Distribution And SOM\nCollaboratively Working With CPG Of Volume Forecasting , CS&L In Term Of Logistics Management\nImplementing With Customers Incentive/Program To Drive Demand, Loyalty And Profitable Growth\nTracking Customer KPI And Taking Action To Improve Performance\nConducting Regular Merchandiser Meeting And Training To Ensure Excellent 5 Ps Execution\nCapturing In-Store Opportunities To Improve Shelf Exhibition And Shopper Communication\n\n\nOur Commitment to Sustainability\n\nWith the Colgate brand in more homes than any other, we are presented with great opportunities and new challenges as we work to integrate sustainability into all aspects of our business and create positive social impact. We are determined to position ourselves for further growth as we act on our 2025 Sustainability & Social Impact Strategy.\n\nOur Commitment to Diversity, Equity & Inclusion\n\nAchieving our purpose starts with our people — ensuring our workforce represents the people and communities we serve —and creating an environment where our people feel they belong; where we can be our authentic selves, feel treated with respect and have the support of leadership to impact the business in a meaningful way.\n\nEqual Opportunity Employer\n\nColgate is an equal opportunity employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity, sexual orientation, national origin, ethnicity, age, disability, marital status, veteran status (United States positions), or any other characteristic protected by law.\n\nReasonable accommodation during the application process is available for persons with disabilities. Please contact Application_Accommodation@colpal.com with the subject \"Accommodation Request\" should you require accommodation.\n\n\nแสดงเพิ่มเติม \nระดับประสบการณ์\nไม่เกี่ยวข้อง\nประเภทการจ้างงาน\nงานเต็มเวลา\nหน้าที่งาน\nการพัฒนาธุรกิจและSales\nอุตสาหกรรม\nการผลิต การขนส่ง โลจิสติกส์ ซัพพลายเชนและการจัดเก็บ และการค้าปลีก\n  \n\nคำรับรองเพิ่มโอกาสในการสัมภาษณ์ของคุณที่ Colgate-Palmolive ได้ถึง 2 เท่า\n\nดูบุคคลที่คุณรู้จัก"
  },
  {
    "id": "oFKhJl76HvFrtGQ3jIpGdA",
    "url": "https://th.linkedin.com/jobs/view/operations-manager-at-scb-%E2%80%93-siam-commercial-bank-3775937466?refId=I6rrr%2B%2FU0zf%2FLdCEBn8IjQ%3D%3D&trackingId=oFKhJl76HvFrtGQ3jIpGdA%3D%3D&position=25&pageNum=0&trk=public_jobs_jserp-result_search-card",
    "content": "Operations Manager\nSCB – Siam Commercial Bank  จตุจักร\n1 ชั่วโมงก่อน   มาเป็นหนึ่งในผู้สมัคร 25 คนแรก\n  \nดูบุคคลที่ SCB – Siam Commercial Bank ได้ว่าจ้างสำหรับตำแหน่งนี้\nสมัคร\nบันทึกJob Summary\n\n\n\n\nOperations Manager will be overseeing the day-to-day operations of SCB Call Center and Wealth Call Center Management with a primary focus on achieving both quantitative and qualitative objectives. Responsibilities include conducting resource planning for optimal productivity, analyzing call-center statistics to drive towards best-in-class service, and tracking and measuring productivity.\n\n\n\n\nJob Descriptions:\n\n\n\n\nOversee day-to-day operations of SCB Call Center 02-777-7777 and Wealth Call Center Management (02-777-7788, 02-777-7799) with a focus on achieving quantitative and qualitative objectives\nConduct resource planning to optimize productivity across people, processes, and technology\nAnalyze call-center statistics (costs, abandon rate, FCR, NPS, Customer Effort, etc.) to drive the call center towards becoming a best-in-class service\nTrack and measure productivity, making comparisons against benchmarks\nConduct staff performance reviews, assess needs, and perform cost/benefit analyses for operational strategy assessments\nSet high standards for productivity, quality, and customer service while defining user guidelines\nManage and enhance center performance through activities such as performance monitoring, problem resolution, system audits, and quality assurance measures\nCollaborate with the human resources department in the recruitment process, including interviewing potential hires and outlining clear job expectations\nMotivate call center agents and team managers to achieve daily, weekly, monthly, and annual sales targets\nAddress and resolve complex issues escalated by call center representatives\n\n\n\n\nQualifications:\n\n\n\n\nBachelor's degree in Marketing, Management Information Technology, or a related field\nAchieve department objectives through effective management of staff, strategic planning, and evaluation of department activities\nBuild and maintain a competent team by recruiting, selecting, orienting, and training employees\nFoster personal growth opportunities for team members\nAttain staff results by clearly communicating job expectations, strategic planning, monitoring progress, and appraising job performance\nแสดงเพิ่มเติม \nระดับประสบการณ์\nกึ่งอาวุโส\nประเภทการจ้างงาน\nงานเต็มเวลา\nหน้าที่งาน\nการจัดการ ฝ่ายบริการลูกค้า และการบริหารโปรเจค\nอุตสาหกรรม\nการธนาคารและบริการด้านการเงิน\n  \n\nคำรับรองเพิ่มโอกาสในการสัมภาษณ์ของคุณที่ SCB – Siam Commercial Bank ได้ถึง 2 เท่า\n\nดูบุคคลที่คุณรู้จัก"
  },
  {
    "id": "XO0/FFESLxfT8lNNdZmLeg",
    "url": "https://th.linkedin.com/jobs/view/manager-regional-hse-at-vinarco-group-of-companies-3779184509?refId=URsyPM4UvbtLzzTh9eAgJg%3D%3D&trackingId=XO0%2FFFESLxfT8lNNdZmLeg%3D%3D&position=4&pageNum=1&trk=public_jobs_jserp-result_search-card",
    "content": "Manager, Regional HSE\nVinarco Group of Companies  กรุงเทพมหานคร\n13 ชั่วโมงก่อน   มาเป็นหนึ่งในผู้สมัคร 25 คนแรก\n  \nดูบุคคลที่ Vinarco Group of Companies ได้ว่าจ้างสำหรับตำแหน่งนี้\nสมัคร \nบันทึกClient: A reputable developer and operator of decentralised solar photovoltaic and energy efficiency projects.\n\nLocation: Sathon, Bangkok or HCMC, Vietnam\n\nType of Hiring: Permanent\n\nJob Description: Strengthen the implementation of HSE across countries (TH, VN, KH).\n\n\nLead and consolidate the governance system to efficiently manage HSE risks and impacts across all COMPANY initiatives in the region.\nDefine distinct roles for all project stakeholders in managing HSE-related matters during the development and operation of COMPANY's assets.\nContribute to the continual improvement of COMPANY's operational HSE performance.\nEnsure the alignment of our global policy with local regulations and its uniform implementation and adherence across various locations (HSE Risk Assessment, Action plan, emergency preparedness and response, Grievance mechanism, Monthly reporting, etc.).\nProvide necessary support and training for resources dedicated to HSE to scrutinize HSE risks and impacts throughout project development, construction, and operational phases.\nReview EPC/AM contracts, ensuring the integration of applicable HSE requirements before signing.\nSupervise the execution of action plans aimed at mitigating adverse impacts of projects on all stakeholders.\nProvide support and guidance to COMPANY's EPC or O&M contractors in developing and executing these plans, including establishing proper communication and consultation channels.\nEstablish control and governance rules to facilitate the self-improvement of all HSE-related procedures within COMPANY.\nCoordinate HSE audits and training to enhance safety awareness among the team, contractors, and partners.\nOrganise comprehensive HSE reporting to the Head Quarter.\n\n\n\nQualifications:\n\n\nBachelor's Degree or higher in Occupational health and safety / Environmental (HSE) or a related field.\nAt least 5 years of experience in a similar role in Muti-national environment would be advantageous.\nProficient in English with excellent written, spoken, and presentation skills.\nTechnical expertise in HSE matters.\nStrong HSE advisory background.\nSound knowledge of OHSAS 18001/ISO 45001 systems.\nPrior experience in health and safety management in an industrial setting.\nExperience in managing environmental and social risks for large industrial projects would be a plus.\nAbility to engage effectively with a diverse range of stakeholders.\nWillingness to travel overseas for at least one week per month.\nOpen to local expatriates residing in Thailand or Vietnam.\n\nแสดงเพิ่มเติม \nระดับประสบการณ์\nกึ่งอาวุโส\nประเภทการจ้างงาน\nงานเต็มเวลา\nหน้าที่งาน\nการจัดการและการผลิต\nอุตสาหกรรม\nการจัดหาและคัดเลือกพนักงาน\n  \n\nคำรับรองเพิ่มโอกาสในการสัมภาษณ์ของคุณที่ Vinarco Group of Companies ได้ถึง 2 เท่า\n\nดูบุคคลที่คุณรู้จัก"
  },
  {
    "id": "pVHLeV0G9/qTkFbULaZsgg",
    "url": "https://th.linkedin.com/jobs/view/airport-services-officer-thailand-at-emirates-3775446081?refId=URsyPM4UvbtLzzTh9eAgJg%3D%3D&trackingId=pVHLeV0G9%2FqTkFbULaZsgg%3D%3D&position=5&pageNum=1&trk=public_jobs_jserp-result_search-card",
    "content": "AIRPORT SERVICES OFFICER- THAILAND\nEmirates  กรุงเทพมหานคร\n16 ชั่วโมงก่อน   มาเป็นหนึ่งในผู้สมัคร 25 คนแรก\n  \nดูบุคคลที่ Emirates ได้ว่าจ้างสำหรับตำแหน่งนี้\nสมัคร \nบันทึกJob Purpose\n\nEnsure a safe, efficient, cost effective and timely airport operation so that Emirates image, reputation and customer service levels are maintained and enhanced, as per the criteria set forth by the Companys commercial, safety and security policies, standards and procedures. Plan, organise and control all aspects of the overall operation including effective co-ordination of all internal and external departments such as Handling Agents, caterers, other airlines, and various authorities at the airport, to ensure customers are provided with a high level of service. Manage and supervise staff on duty ensuring that the relevant areas of the operation are fully covered and assume responsibility for running of the Station during the absences of the Airport Services Manager. Job Outline: - Analyse anticipated operational problems such as overbookings, adverse weather conditions, delays, cancellation of flights, crew flight time limitations etc., undertaking necessary remedial action to ensure disruptions are minimised and the customer service levels are not impacted. - Ensure that Handling Agent, caterers and other service providers are fully briefed regarding Emirates? requirements for the day?s operation including any special handling, and update this information as necessary in order to ensure a smooth operation and avoid unnecessary expenditure and inconvenience to our customers. - Control expenditure on damage baggage replacement and lost baggage claims. Delegate some of the baggage claims processing to the Supervisors/ASAs, to ensure all of the baggage services aspects are processed effectively and in a timely manner. - Assist the Airport Services Manager in preparing and maintaining the staff duty roster and in preparing the staff annual leave plan as necessary and ensure staffing levels are optimised. - Undertake various administrative duties delegated by Airport Services Manager including attending various meetings as directed and ensure Emirates interests/requirements are appropriately represented at such meetings. - Assist the ASM in Employee Regulation Programme and in conducting staff performance reviews in line with Performance Matters (i.e. setting staff?s objectives and development plan) and support, coach and guide staff members to ensure maintenance of customer service and other standards such as grooming. - Manage and administer all operational/supervisory activities on a shift basis and ensure appropriate control of processes related to document and information consolidation (revenue documents , cargo, handling reports etc) in order to safeguard revenues, operational data and avoid discrepancies. - Monitoring of all operational units (Customer Services, Ticket desk, Ramp and Lounge). Establish a regular reporting mechanism to ensure there is a timely and consistent monitoring of service delivery, across operations. Monitor KPI?s for service performance and ensure that these KPI?s are met consistently by each unit. - Under take projects from time to time as advised by the Airport Services Manager in relation to operational standards and procedures thereby improving efficiency and quality of service delivered at the station. Assist ASM in ERP (Emergency Response Planning) and other related tasks. - Ensure Passenger Service and Ground Operations Manual updates are communicated and adhered to, internally and by relevant service providers. Promote a continuously improving culture of safety, with open reporting of safety deficiencies, human factor issues and compliance with local laws to uphold the delivery of safe and secure operations.\n\nQualifications & Experience\n\nAirport Operations.Passenger Handling : Minimum `A' Level or equivalent (Higher Secondary School). Must have completed relevant and recognised professional training courses in Customer Services and Ground Operations. Experience: Given the specific requirements at outstations, a minimum of 5 years experience is required in Airport. Customer handling / Operations including at least 3 years in a supervisory position. Knowledge/Skills: A working knowledge of Reservations/Fares and Ticketing, Departure Control Systems. Knowledge of Dangerous Goods Regulations & Weight & Balance. Knowledge of Baggage Tracing and Claims Handling. Knowledge of Microsoft Word/ E-mail / Excel advantageous and local languages. Fluency in spoken and written English and required local language. Please note that you must have the right to live and work in Thailand.\n\nSalary & Benefits\n\nJoin our growing team and enjoy a competitive remuneration package, discounts on flights and hotel stays. Find out more about working with us in our website www.emirates.com/careers\nแสดงเพิ่มเติม \nระดับประสบการณ์\nประสบการณ์น้อย\nประเภทการจ้างงาน\nงานเต็มเวลา\nหน้าที่งาน\nการจัดการและการผลิต\nอุตสาหกรรม\nการบินและสายการบิน\n  \n\nคำรับรองเพิ่มโอกาสในการสัมภาษณ์ของคุณที่ Emirates ได้ถึง 2 เท่า\n\nดูบุคคลที่คุณรู้จัก"
  },
  {
    "id": "q2XTPu9Z97F1NkgFmdENtA",
    "url": "https://th.linkedin.com/jobs/view/driver-at-%E0%B8%9A%E0%B8%A3%E0%B8%B4%E0%B8%A9%E0%B8%B1%E0%B8%97-%E0%B8%A5%E0%B8%B5%E0%B9%80%E0%B8%A3%E0%B8%84%E0%B9%82%E0%B8%81-%E0%B8%9B%E0%B8%A3%E0%B8%B0%E0%B9%80%E0%B8%97%E0%B8%A8%E0%B9%84%E0%B8%97%E0%B8%A2-%E0%B8%88%E0%B8%B3%E0%B8%81%E0%B8%B1%E0%B8%94-3779649269?refId=URsyPM4UvbtLzzTh9eAgJg%3D%3D&trackingId=q2XTPu9Z97F1NkgFmdENtA%3D%3D&position=6&pageNum=1&trk=public_jobs_jserp-result_search-card",
    "content": "Driver\nบริษัท ลีเรคโก (ประเทศไทย) จำกัด  เขตปริมณฑลกรุงเทพมหานคร\n2 ชั่วโมงก่อน   มาเป็นหนึ่งในผู้สมัคร 25 คนแรก\n  \nดูบุคคลที่ บริษัท ลีเรคโก (ประเทศไทย) จำกัด ได้ว่าจ้างสำหรับตำแหน่งนี้\nสมัคร \nบันทึกAt Lyreco we all share a common goal to strive for passion, excellence, respect and agility. We are proud to be the European leader and the third largest distributor of workplace products and services in the world\n\nWe are committed to the development of our employees and we aim to achieve that by creating a culture that inspires and empowers.\n\nAre you seeking a new challenge? This offer might be for you!\n\nขับรถยนต์รับส่งสินค้า ในเขตกรุงเทพและปริมณฑล และต่างจังหวัด\n\n\nสามารถขับรถยนต์ส่งสินค้าตามที่ได้รับมอบหมายได้\nมีใบอนุญาตขับขี่รถยนต์\nเป็นคนสุภาพ ทำงานร่วมกับผู้อื่นได้ดี\nสามารถเดินทางต่างจังหวัดได้\nผ่านการเกณฑ์ทหารแล้ว\nสุขภาพร่างการแข็งแรง สามารถยกของหนักได้\nไม่โรคประจำตัว\nมีใจรักในงานบริการ\nแสดงเพิ่มเติม \nระดับประสบการณ์\nประสบการณ์น้อย\nประเภทการจ้างงาน\nงานเต็มเวลา\nหน้าที่งาน\nการจัดการและการผลิต\nอุตสาหกรรม\nการค้าปลีกอุปกรณ์สำนักงาน\n  \n\nคำรับรองเพิ่มโอกาสในการสัมภาษณ์ของคุณที่ บริษัท ลีเรคโก (ประเทศไทย) จำกัด ได้ถึง 2 เท่า\n\nดูบุคคลที่คุณรู้จัก"
  },
  {
    "id": "AINI0/K6zwNBAgk0pX6TSQ",
    "url": "https://th.linkedin.com/jobs/view/data-science-at-western-digital-3779989509?refId=URsyPM4UvbtLzzTh9eAgJg%3D%3D&trackingId=AINI0%2FK6zwNBAgk0pX6TSQ%3D%3D&position=9&pageNum=1&trk=public_jobs_jserp-result_search-card",
    "content": "Data Science\nWestern Digital  อำเภอ ศรีมหาโพธิ\n20 ชั่วโมงก่อน   มาเป็นหนึ่งในผู้สมัคร 25 คนแรก\n  \nดูบุคคลที่ Western Digital ได้ว่าจ้างสำหรับตำแหน่งนี้\nสมัคร\nบันทึกCompany Description\n\nAt Western Digital, our vision is to power global innovation and push the boundaries of technology to make what you thought was once impossible, possible.\n\nAt our core, Western Digital is a company of problem solvers. People achieve extraordinary things given the right technology. For decades, we’ve been doing just that. Our technology helped people put a man on the moon.\n\nWe are a key partner to some of the largest and highest growth organizations in the world. From energizing the most competitive gaming platforms, to enabling systems to make cities safer and cars smarter and more connected, to powering the data centers behind many of the world’s biggest companies and public cloud, Western Digital is fueling a brighter, smarter future.\n\nBinge-watch any shows, use social media or shop online lately? You’ll find Western Digital supporting the storage infrastructure behind many of these platforms. And, that flash memory card that captures and preserves your most precious moments? That’s us, too.\n\nWe offer an expansive portfolio of technologies, storage devices and platforms for business and consumers alike. Our data-centric solutions are comprised of the Western Digital®, G-Technology™, SanDisk® and WD® brands.\n\nToday’s exceptional challenges require your unique skills. It’s You & Western Digital. Together, we’re the next BIG thing in data.\n\nJob Description\n\nESSENTIAL DUTIES AND RESPONSIBILITIES:\n\n\nWork with data scientists, data engineers, software engineers, process & product engineers, design engineers, etc collaboratively to develop new data science solutions that improve productivity and operations metrics.\nLeverage data mining techniques in mathematics, statistics, information technology, machine learning, deep learning, visualization etc to discover insightful patterns.\nDevelop/take an idea, access and prepare necessary data to create machine learning models.\nDeploy models and solutions using DevOps/MLOps tools such as Docker, Kubernetes, MLflow to ensure scalability and reproducibility.\nDemonstrate proficiency in version control using Git and collaborate with a team of data scientists in code review and development processes.\nPrepare and deliver presentations with data visualizations and business conclusions.\n\n\nQualifications\n\nQualification\n\n\nMasters or Bachelor Degree in Computer science, data science, computer engineering, information technology, or relevant work experience and education background.\nWe will also consider applicants with the equivalent combination of education, technical expertise, training, or work experience.\nPreferably minimum 1-2 years of working experience in related field.\nFresh graduates are also encouraged to apply.\n\n\nSkills\n\n\nRequired: Python, R, Tensorflow framework, Computer Vision.\nSQL, Relational databases, Big Data platforms, AWS Redshift etc.\nFamiliar with some of the following Statistical Analysis & Modelling Tools: JMP, Minitab, SPSS, Enterprise Miner, Enterprise Guide, SAS coding.\nFamiliarity with core techniques in statistical and machine learning e.g. regularized regression, time series analysis, tree base models, boosting algorithms, neural networks, frequentist and Bayesian inference, power calculation, clustering, collaborative filtering, NLP, cross-validation and bootstrapping, and data visualization\nPractical experience in application of ML and Deep Learning algorithms.\nFamiliar with collaborative solutions, model & code versioning (Github), and solution packaging (Docker)\nAbility to deploy data science solutions in cloud analytics infrastructure and AWS\n\n\nAdditional Information\n\nWestern Digital thrives on the power and potential of diversity. As a global company, we believe the most effective way to embrace the diversity of our customers and communities is to mirror it from within. We believe the fusion of various perspectives results in the best outcomes for our employees, our company, our customers, and the world around us. We are committed to an inclusive environment where every individual can thrive through a sense of belonging, respect and contribution.\n\nWestern Digital is committed to offering opportunities to applicants with disabilities and ensuring all candidates can successfully navigate our careers website and our hiring process. Please contact us at jobs.accommodations@wdc.com to advise us of your accommodation request. In your email, please include a description of the specific accommodation you are requesting as well as the job title and requisition number of the position for which you are applying.\nแสดงเพิ่มเติม \nระดับประสบการณ์\nประสบการณ์น้อย\nประเภทการจ้างงาน\nงานเต็มเวลา\nหน้าที่งาน\nวิศวกรรม\nอุตสาหกรรม\nการผลิตฮาร์ดแวร์คอมพิวเตอร์ การผลิตคอมพิวเตอร์และเครื่องใช้ไฟฟ้า และการผลิตเซมิคอนดัคเตอร์\n  \n\nคำรับรองเพิ่มโอกาสในการสัมภาษณ์ของคุณที่ Western Digital ได้ถึง 2 เท่า\n\nดูบุคคลที่คุณรู้จัก"
  },
  {
    "id": "PFgbd25DFpw/N08c4G6hkw",
    "url": "https://th.linkedin.com/jobs/view/people-and-organisation-manager-at-pwc-south-east-asia-consulting-3752818340?refId=URsyPM4UvbtLzzTh9eAgJg%3D%3D&trackingId=PFgbd25DFpw%2FN08c4G6hkw%3D%3D&position=10&pageNum=1&trk=public_jobs_jserp-result_search-card",
    "content": "People and Organisation Manager\nPwC South East Asia Consulting  กรุงเทพมหานคร, ประเทศไทย\n1 วันก่อน  ผู้สมัคร 151 คน\n  \nดูบุคคลที่ PwC South East Asia Consulting ได้ว่าจ้างสำหรับตำแหน่งนี้\nสมัคร\nบันทึกAbout the Team\n\nAs part of Management Consulting’s market leading People & Organisation Consulting business, we help our clients in solving their most important and challenging business problems. Every day we challenge ourselves to do what matters most for our clients, our people and for the society. We offer the opportunity to be part of a firm that has the purpose of building trust in society and solving important problems, that gives you the opportunity to work with inspiring leaders and talented professionals to deliver outstanding value to our clients in a culture that is diverse, inclusive, collaborative and one that provides exceptional career experience.\n\n\n\n\nWorking within a high performing team and collaborating closely with other parts of PwC, you will be responsible for adding value to your client portfolio through the delivery of People & Organisation projects in the field of HR Transformation, Change Management, Leadership, Culture, Organisation Design, Workforce Transformation and People Analytics.\n\n\n\n\nAbout the Role\n\nDefine, structure and implement improvements to the operation of the HR function and the overall impact and value that HR can drive for the business\nReview HR processes, structure, technologies and use data & analytics to drive business alignment\nMaximise organisational and HR performance and establish a culture focused on optimising business value\nAssess, design and implement operating models aligned to the client’s strategic objectives\nDrive change enablement for clients as part of large transformation programs\nManage teams to ensure on time, on budget delivery and achievement of outcomes\nSupport the sales cycle and help with practice development and eminence building\nSupport development of junior consultants by actively guiding them\n\n\n\n\nAbout you\n\nDemonstrate problem solving skills and the ability to work in complex and dynamic environments\nMinimum 5 - 10 years of relevant experience within the human capital domain, including consulting experience\nExcellent verbal and written communication skills\nExperience managing, coaching and mentoring junior team members\nAbility to build and sustain client relationships\nCollaboration and participation within a highly diverse and inclusive team\nAbility to work independently and lead projects or large streams of work\nGood subject matter knowledge across a range of HR/workforce-related capabilities such as HRT/change management/leadership/organisation design\nAbility to multitask and prioritise workload with good working knowledge of Microsoft Office suite\nGood Thai and English communication skills\nแสดงเพิ่มเติม \nระดับประสบการณ์\nกึ่งอาวุโส\nประเภทการจ้างงาน\nงานเต็มเวลา\nหน้าที่งาน\nการให้คำปรึกษาและทรัพยากรบุคคล\nอุตสาหกรรม\nที่ปรึกษาด้านธุรกิจและบริการ บริการ IT และการให้คำปรึกษาด้าน IT และที่ปรึกษาด้านการเอาท์ซอร์สและการย้ายฐานการผลิตไปต่างประเทศ\n  \n\nคำรับรองเพิ่มโอกาสในการสัมภาษณ์ของคุณที่ PwC South East Asia Consulting ได้ถึง 2 เท่า\n\nดูบุคคลที่คุณรู้จัก"
  },
  {
    "id": "o1eIXpnBa1XxuHgtF9w+Rw",
    "url": "https://th.linkedin.com/jobs/view/senior-branding-specialist-global-operations-centre-tha-at-shein-3764387504?refId=URsyPM4UvbtLzzTh9eAgJg%3D%3D&trackingId=o1eIXpnBa1XxuHgtF9w%2BRw%3D%3D&position=11&pageNum=1&trk=public_jobs_jserp-result_search-card",
    "content": "Senior Branding Specialist - Global Operations Centre, THA\nSHEIN  กรุงเทพมหานคร, ประเทศไทย\n2 ชั่วโมงก่อน  ผู้สมัคร 52 คน\n  \nดูบุคคลที่ SHEIN ได้ว่าจ้างสำหรับตำแหน่งนี้\nสมัคร\nบันทึกส่งข้อความโดยตรงถึงผู้ประกาศรับสมัครงานจาก SHEIN\n\nChloe Liao\nChloe Liao\nSHEIN | HRBP Manager | Bilingual\n\nAt SHEIN, the marketing team consists of various functions: e-commerce website operations, social media, key-opinion leaders’ management, branding and data analysis. Combining these functions, it allows us to implement marketing activities that are attractive and connects us with millions of customers, to achieve our mission where “everyone can enjoy the beauty of fashion” across the region.\n\nJob Responsibilities\n\nEnhance and drive brand image and positioning to market.\nGrow brand equity and drive sales growth for both online and offline channels.\nRun integrated online and offline marketing plans to enhance brand awareness.\nIn charge of the local brand campaigns (Pop-up, Fashion Week, New Product Press Conference)\nBuild strong relationships with talents, PR agency, or marketing agencies.\nWork closely with influencers to establish and maintain a long-term cooperative relationship.\n\nJob Requirements\n\nBachelor’s Degree required with 3 years relevant working experience, have a good command of English.\nFamiliar with the local market and consumer habits, able to integrate both internal and external resources to track local hot news\nProject experience in fashion week or brand campaigns\nAble to identify, analyze and solve problems, and strong resistance to pressure\nExcellent communications and interpersonal skills.\n\nแสดงเพิ่มเติม \nระดับประสบการณ์\nกึ่งอาวุโส\nประเภทการจ้างงาน\nงานเต็มเวลา\nหน้าที่งาน\nการตลาด Sales และประชาสัมพันธ์\nอุตสาหกรรม\nการค้าปลีกเครื่องแต่งกายและแฟชั่นและเทคโนโลยี สารสนเทศ และอินเทอร์เน็ต\n  \n\nคำรับรองเพิ่มโอกาสในการสัมภาษณ์ของคุณที่ SHEIN ได้ถึง 2 เท่า\n\nดูบุคคลที่คุณรู้จัก"
  },
  {
    "id": "8hNxwCfQdWypf0EXLQygxg",
    "url": "https://th.linkedin.com/jobs/view/strategic-marketing-manager-%E2%80%93-intercontinental-at-ge-healthcare-3731605519?refId=URsyPM4UvbtLzzTh9eAgJg%3D%3D&trackingId=8hNxwCfQdWypf0EXLQygxg%3D%3D&position=15&pageNum=1&trk=public_jobs_jserp-result_search-card",
    "content": "Strategic Marketing Manager – Intercontinental\nGE HealthCare  กรุงเทพมหานคร\n18 ชั่วโมงก่อน   ผู้สมัครมากกว่า 200 คน\n  \nดูบุคคลที่ GE HealthCare ได้ว่าจ้างสำหรับตำแหน่งนี้\nสมัคร \nบันทึกJob Description Summary\n\nINTERCONTINENTAL (Japan, ASEAN, Korea, ANZ, South Asia, Latin Americas) is a key growth region for GE Healthcare with an aspiration to reach >$3B over next 3 years by accelerating penetration in existing market/customer segments and expanding into adjacencies. Given the region’s growth ambitions, we are seeking a Strategic Marketing Professional to optimize expansion in existing markets, identify new growth markets, support creation of strategies/proposals and execution on those opportunities in collaboration with sub-region organization. On a day-to-day basis, the role holder will work directly with Strategy & Program Director for the Intercontinental region and sub-regional leadership including Marketing, Commercial Excellence, Product, Sales and Service leaders and will be the point of contact for global market/competitive intelligence, commercial and marketing teams.GE HealthCare is a leading global medical technology and digital solutions innovator. Our purpose is to create a world where healthcare has no limits. Unlock your ambition, turn ideas into world-changing realities, and join an organization where every voice makes a difference, and every difference builds a healthier world.\n\nJob Description\n\nResponsibilities\n\nMarket Analysis & Reporting\n\n\nAnalyze market performance (e.g., market size, growth, share, visibility, win-rate, profitability) by coordinating with commercial excellence / marketing teams across different product groups/sub-regions.\nConduct quarterly market estimate in collaboration with sub-region / global segment team and maintain up to date PowerBI Market Performance Dashboard\nIdentify consolidated drivers of strength and weakness in market, competitive intelligence/competitor strategies/actions, and underlying secular themes to explain commercial performance and areas for targeting counter-measures.\nPeriodically report actual and forecasted performance of commercial metrics to the Intercontinental and leadership team via Monthly Operating Review (MOR), Product Operating Review (POR), Segment Operating Review (SOR)\n\n\nMarketing Strategy Development\n\n\nFrequently collaborate with Marketing, segment team, and external 3rd parties to identify potential areas of adjacencies that can deliver topline and operating margin growth.\nValidate growth opportunities by conducting deep research and analysis on critical and prioritized problems, including market dynamics, customer behavior, unmet needs, and best practice case studies.\nOrganize cross-functional session and workshop to share findings, evaluate options define potential solutions, and build associated business case.\nUltimately, you will establish well supported solutions with specific recommendations that will enable executive management team to make critical go/no go decisions.\n\n\nLong-Term Strategy, Budget Planning, and Strategic Project execution\n\n\nSupport the Intercontinental strategic planning process including forecasting marketing and order metrics, executing customer VoC, investment business case development and prioritization.\nSupport execution of Intercontinental wide strategic projects. Employ best-in-class project management framework (e.g., owner, milestones, transformation), operating mechanisms/review cadence (e.g. bi-weekly, monthly) to deliver on time/on-budget and regularly update management on status and progress.\n\n\nQualifications\n\n\nBachelor’s or Master’s degree in engineering, Business Administration, or related field\n5-8 years’ experience in consulting, product marketing or related field\nStrong analytical and process skills\nExcellent oral and written communications skills\nExperience with Microsoft Office Suite (PowerPoint, Excel, and Word)\nExperience with PowerBI and willingness to learn.\nLeadership skills – capable of executing projects on time and on budget.\nTeam oriented – ability to motivate and work well with diverse, cross-functional teams.\nInfluencing skills – ability to motivate individuals and demonstrate organizational influence.\n\n\nPreferred Qualifications\n\n\nPast experience in management consulting experience preferred.\nDeep expertise in market & customer insights, product commercialization and branding for healthcare medical device or industrial B2B products.\nAbility to thrive in a fast-paced, highly matrixed environment.\nResults-oriented, highly motivated, and able to develop and implement complex projects.\nFlexible and have a “can do” and positive attitude.\n\n\nInclusion and Diversity\n\nGE HealthCare is an Equal Opportunity Employer where inclusion matters. Employment decisions are made without regard to race, color, religion, national or ethnic origin, sex, sexual orientation, gender identity or expression, age, disability, protected veteran status or other characteristics protected by law.\n\nWe expect all employees to live and breathe our behaviors: to act with humility and build trust; lead with transparency; deliver with focus, and drive ownership – always with unyielding integrity.\n\nOur total rewards are designed to unlock your ambition by giving you the boost and flexibility you need to turn your ideas into world-changing realities. Our salary and benefits are everything you’d expect from an organization with global strength and scale, and you’ll be surrounded by career opportunities in a culture that fosters care, collaboration and support.\n\n\n\nAdditional Information\n\nRelocation Assistance Provided: No\n\n\nแสดงเพิ่มเติม \nระดับประสบการณ์\nผู้อำนวยการ\nประเภทการจ้างงาน\nงานเต็มเวลา\nหน้าที่งาน\nการตลาด\nอุตสาหกรรม\nโรงพยาบาลและการดูแลสุขภาพ การผลิตอุปกรณ์ทางการแพทย์ และการผลิตยา\n  \n\nคำรับรองเพิ่มโอกาสในการสัมภาษณ์ของคุณที่ GE HealthCare ได้ถึง 2 เท่า\n\nดูบุคคลที่คุณรู้จัก"
  },
  {
    "id": "EabjiedK58NYo6oRH6Jraw",
    "url": "https://th.linkedin.com/jobs/view/senior-art-director-contract-at-vaynermedia-3779122297?refId=URsyPM4UvbtLzzTh9eAgJg%3D%3D&trackingId=EabjiedK58NYo6oRH6Jraw%3D%3D&position=16&pageNum=1&trk=public_jobs_jserp-result_search-card",
    "content": "Senior Art Director (Contract)\nVaynerMedia  กรุงเทพมหานคร\n20 ชั่วโมงก่อน   มาเป็นหนึ่งในผู้สมัคร 25 คนแรก\n  \nดูบุคคลที่ VaynerMedia ได้ว่าจ้างสำหรับตำแหน่งนี้\nสมัคร\nบันทึกWhat's up? We're VaynerMedia! We are a contemporary global creative and media agency with an expertise in driving relevance for clients and delivering impactful business results. The independently-owned agency was founded in 2009 and has offices in New York, Los Angeles, London, Singapore, Australia, Thailand, Japan and Mexico City. VaynerMedia has been recognized for its work at Cannes Lions, the Clio Awards and The Webby Awards. It is part of the VaynerX family of companies.\n\nCulture is our key and Empathy is how we build it. VaynerMediaAPAC is strong with a world-class combination of diverse backgrounds collaborating to put forward innovative, creative and strategic solutions to the one advantage that stands the test of time --- PEOPLE. Day in and day out, we propel some of the biggest brands in the world to the intersection of attention and culture. In APAC, we are proudly +200, servicing a diverse client all around the region.\n\nThe PITCH\n\nWe are looking for a Senior Art Director who has the know-how and skills to work hands-on who can own and guide the creative process from ideation to execution. Sometimes you'll be leading a team of designers to make a volume of memes and GIFs that'll make people laugh and cry. Sometimes you'll be collaborating in a brainstorm for a big campaign. Sometimes you'll be on set—using your eye to make sure everything in frame looks \"just so.\" Every task is challenging, but highly rewarding.\n\nYou'll be joining a tightly-knit creative team working on an established entertainment brand and have the opportunity to possibly work on more. The team is a diverse mix of makers, creators, and ideators from musicians to viral TikTokers. But we're all passionate about our mission: How do we level-up our clients to be the next big thing? This will be a 6 months contract role, with a hybrid working arrangement.\n\nAre you based in Bangkok? Geeking the creative world in the Vietnam market for six plus years now? Oh well, we could be meant to be --\n\nHere's where you come in.\n\n\nIntegrate seamlessly art, copy, and editing techniques, and guides the team across each.\nYou are a creator and an ideator who can execute at both a high speed and volume.\nCapable of working with large creative groups, and with cross-functional disciplines with the agency.\nMasters crafts and ideas accompanied by delivering high quality, actionable feedback.\nConnecting the dots between culture and content to make concise and relevant creative recommendations.\nChampioning the look and feel of your brands. (Style guides are your bible.)\nSupport CDs, ACDs and win new business pitches.\nHelp review and optimize the juniors output while making sure they are being developed as creative problem solvers.\nAssisting in the development and delivery of creative solutions, from content work to larger campaign initiatives for a variety of clients and industries. This includes both executing work on your own as well as managing and approving the work of your assigned creative team.\nAssists in developing company wide creative processes including voice and content workshops, brief sessions, high priority brainstorms, emerging technology and social opportunities, and innovating on campaign work.\nUnderstanding, articulating, and strategically applying the latest social best-practices to every creative opportunity.\nMasters industry best practices and be able to articulate the unique VaynerMedia POV\nEmbodies strong creative vision and understanding of client and agency business needs and objectives.\n\n\nYour Experience\n\n\n6+ years of relevant work experience in the creative media or advertising field in the Thailand market.\nCollaborate with our creative and strategy teams, to create and manipulate video, a plethora of photography, social copy, gifs, short clips, streaming stories, etc.\nSelf-starter and demonstrates ability to get things done without direct supervision and understand what it means to deliver excellence to clients.\nWrangle and roll with your teammates on rapid-fire requests and seriously tight timelines while keeping a chill, proactive attitude.\nLastly, think logically even under pressure and come up with innovative solutions to problems.\n\n\nWhat You Should Know About VaynerMedia\n\nThink \"lab\" and not \"agency\". We get excited about solving business problems, not creating advertising for the sake of making advertising. Our entrepreneurship DNA runs deep. We're willing to break rules, try new things, and test hypotheses if it means better understanding our craft. It's fun!\n\nOur environment (and pace) feels much more like a start-up than most agencies you might be used to. Hopefully that, and the opportunity to collaborate with the talented and enthusiastic crew, work with big brands excites you, as it does us. We can't wait to meet you.\n\nP.S Send us your portfolio --- always excited to see some unicorn talents :)\nแสดงเพิ่มเติม \nระดับประสบการณ์\nผู้อำนวยการ\nประเภทการจ้างงาน\nงานสัญญาจ้าง\nหน้าที่งาน\nการออกแบบ ศิลปะ/งานสร้างสรรค์ และเทคโนโลยีสารสนเทศ\nอุตสาหกรรม\nเทคโนโลยี สารสนเทศ และอินเทอร์เน็ต\n  \n\nคำรับรองเพิ่มโอกาสในการสัมภาษณ์ของคุณที่ VaynerMedia ได้ถึง 2 เท่า\n\nดูบุคคลที่คุณรู้จัก"
  },
  {
    "id": "psAxIG7dBtSZ0l6v5ki87A",
    "url": "https://th.linkedin.com/jobs/view/head-of-service-delivery-at-ericsson-3775415237?refId=URsyPM4UvbtLzzTh9eAgJg%3D%3D&trackingId=psAxIG7dBtSZ0l6v5ki87A%3D%3D&position=17&pageNum=1&trk=public_jobs_jserp-result_search-card",
    "content": "Head of Service Delivery\nEricsson  กรุงเทพมหานคร\n21 ชั่วโมงก่อน   มาเป็นหนึ่งในผู้สมัคร 25 คนแรก\n  \nดูบุคคลที่ Ericsson ได้ว่าจ้างสำหรับตำแหน่งนี้\nสมัคร \nบันทึกJob Summary !\n\nEricsson is growing! Supporting a fast-growing account. This role will require an established people leader with the ability to ensure customer value and happiness through an efficient service delivery.\n\nAs a Head of Service Delivery within the Digital Services organisation, you will support service sales directly or indirectly via the unit resources as you understand and align with the overall service delivery processes, models, and strategies.\n\nIn this people leadership role in the operational organization, you will collaborate to ensure that work is driven within the scope of agreed customer contract & requirements and provide performance feedback, recognition and remuneration management using existing Ericsson tools and processes.\n\nYou will!\n\n\nCreate and maintain effective working relationships with internal and external stakeholders, including within partner/supplier ecosystems.\nAble to maintain and develop Customer Relationship at C-Level.\nDirect line management responsibility for the delivery team.\nResponsible for supervising and reporting of program related trends, capability development and performance against project plans and budgets.\nEnsure project outcomes are achieved\nEnsure project management capability is maintained across the program.\nOverall accountability for Program financial results including cost center management, utilization and billability and empower the organization to seek to achieve business outcomes.\nDevelop a positive & productive culture within the program and long-term strategy and plan for the business\nGenerating and seeking out potential new opportunities.\nDrive operational performance, innovation, and continuous perfection.\n\n\nTo be successful in the role you must have:\n\n\n10+ Yrs experience within the Telco/Systems Integration Industry on driving IT and Network transformation programs or projects of high complexity.\nProven experience to transform customer requirements and expectations at a high level into a solution draft that Ericsson can realize as a customer engagement!.\nDeep experience of leading teams in a multicultural environment.\n\n\nWhy Join Ericsson?\n\nAt Ericsson, you´ll have an outstanding opportunity. The chance to use your skills and imagination to push the boundaries of what´s possible. To build never seen before solutions to some of the world’s toughest problems. You´ll be challenged, but you won’t be alone. You´ll be joining a team of diverse innovators, all driven to go beyond the status quo to craft what comes next.\n\nWhat Happens once you apply?\n\nClick Here to find all you need to know about what our typical hiring process looks like.\n\nEncouraging a diverse and inclusive organization is core to our values at Ericsson, that's why we nurture it in everything we do. We truly believe that by collaborating with people with different experiences we drive innovation, which is essential for our future growth. We encourage people from all backgrounds to apply and realize their full potential as part of our Ericsson team.\n\nEricsson is proud to be an Equal Opportunity and Affirmative Action employer, learn more. We are committed to providing reasonable accommodations to all individuals participating in the application and interview process. If you need assistance or to request an accommodation due to a disability please reach out to Contact us\n\n“We are proud to announce Ericsson Thailand have been again officially Great Place to Work Certified™ in 2023. Every year, more than 10,000 organizations from over 60 countries partner with the Great Place to Work® Institute for assessment, benchmarking and planning actions to strengthen their workplace culture and this Certification acknowledges our employees value their employee experience and our workplace culture.”\n\n]]>\nแสดงเพิ่มเติม \nระดับประสบการณ์\nไม่เกี่ยวข้อง\nประเภทการจ้างงาน\nงานเต็มเวลา\nหน้าที่งาน\nอื่น ๆ\nอุตสาหกรรม\nการสื่อสารโทรคมนาคม\n  \n\nคำรับรองเพิ่มโอกาสในการสัมภาษณ์ของคุณที่ Ericsson ได้ถึง 2 เท่า\n\nดูบุคคลที่คุณรู้จัก"
  },
  {
    "id": "TYatgw3T76rx65FCheBN0Q",
    "url": "https://th.linkedin.com/jobs/view/product-manager-at-bitazza-3779166603?refId=URsyPM4UvbtLzzTh9eAgJg%3D%3D&trackingId=TYatgw3T76rx65FCheBN0Q%3D%3D&position=20&pageNum=1&trk=public_jobs_jserp-result_search-card",
    "content": "Product Manager\nBitazza  กรุงเทพมหานคร, ประเทศไทย\n14 ชั่วโมงก่อน  ผู้สมัคร 49 คน\n  \nดูบุคคลที่ Bitazza ได้ว่าจ้างสำหรับตำแหน่งนี้\nสมัคร\nบันทึกส่งข้อความโดยตรงถึงผู้ประกาศรับสมัครงานจาก Bitazza\n\nKevin H.\nKevin H.\nCo-Founder & CSO at Bitazza | Freedom World\n\nTo direct and oversee the end-to-end product strategy, development, and enhancement specific to our cryptocurrency and brokerage offerings. The role demands a thorough understanding of the financial markets, cryptocurrency landscapes, and regulatory nuances inherent to the industry.\n\n\n\n\nKey Responsibilities:\n\nUndertake thorough business, market, and user research to inform product strategy.\nFormulate and execute a detailed product roadmap in alignment with business objectives.\nConvert roadmap into clear, actionable stories and requirements.\nCollaborate seamlessly with the project manager, UX/UI teams, and QA department to design intuitive web and mobile experiences.\nCoordinate diligently with relevant stakeholders, spanning business, marketing, operations, compliance, and more to guarantee product readiness and operational excellence.\n\n\n\n\nRequired Experience and Skills:\n\nA minimum of 3-5 years of experience in product management, strategy, or related domains.\nDemonstrable experience in formulating strategic plans, including the creation of business cases and models.\nProficiency in analytical problem solving, coupled with quantitative analysis capabilities.\nA proven track record of successful product or feature launches, substantiated by clear metrics and impact.\nAbility to define and consistently measure both customer and business impact, optimizing product conversion funnels accordingly.\nSuperior project and stakeholder management skills, with experience managing executive-level stakeholders.\nExcellent communication skills, both written and verbal, complemented by adeptness in visual presentations.\nA detail-oriented approach, coupled with creativity and speed in problem-solving.\nSelf-motivated and proactive in the execution of responsibilities.\n\n\n\n\n\n\n\nOUR CORE\n\nWe believe that everyone deserves the freedom to control their own finances and ultimately their life. Through cryptocurrency, we challenge the status quo by making wealth more democratic, fair, and equitable.\n\n\n\n\nBy joining our dynamic team, you'll be at the forefront of the financial revolution, shaping the future of crypto trading and brokerage services.\n\nแสดงเพิ่มเติม \nระดับประสบการณ์\nกึ่งอาวุโส\nประเภทการจ้างงาน\nงานเต็มเวลา\nหน้าที่งาน\nการจัดการสินค้า กลยุทธ์/การวางแผน และการวิจัย\nอุตสาหกรรม\nบริการด้านการเงิน เทคโนโลยี สารสนเทศ และอินเทอร์เน็ต และการพัฒนาซอฟต์แวร์\n  \n\nคำรับรองเพิ่มโอกาสในการสัมภาษณ์ของคุณที่ Bitazza ได้ถึง 2 เท่า\n\nดูบุคคลที่คุณรู้จัก"
  }
]